{
  "input_message": "Generate a list of various subtasks related to a provided primary task. The aim is to generate subtasks that can be applied universally to any text eligible for the original task. Please generate a JSON list of 15 different subtasks. Each subtask should represent a unique type of task that can be performed on any text provided for the original task. For each subtask, include:\n\n1) The name of the subtask.\n2) A short description outlining the subtask in three sentences.\n\nInput example: \n\nPrimary Task: Summarization\nDescription: The task involves creating a concise version of a given text, capturing its essential messages or key points in a shorter form.\n\nOutput example:\n\n[\n  {\n\t\"name\": \"Key Points Summarization\",\n\t\"description\": \"This subtask focuses on extracting and summarizing the essential points or main arguments from the text. It involves sorting through the material to identify the key ideas, while leaving out less critical details. The objective is to create a brief summary that clearly conveys the main themes of the text.\n\"\n{ \n\"name\": \"Thematic Summarization\", \n\"description\": \"This subtask is about summarizing the text by focusing on its major themes and concepts. It requires sifting through the content to identify overarching themes, and then concisely expressing these themes in a coherent summary. The objective is to distill the text into a summary that captures its thematic essence, providing a clear understanding of the text's overall subject matter.\" \n},\n// ...additional subtasks...\n]\n\n\n\n",
  "data": {
    "descr": "These are three most general types of tasks",
    "Information Processing and Retrieval": {
      "descr": "This category includes classical NLP tasks that involve the handling, interpretation, and retrieval of information. It encompasses activities where the primary goal is to manage and utilize existing knowledge or data.",
      "Factual Question Answering": "Responding to queries with accurate, specific information based on available data or known facts.",
      "Text Summarization": "Condensing lengthy texts into concise summaries, capturing the essential points.",
      "Information Extraction": "Identifying and extracting key pieces of information from a larger dataset or complex texts.",
      "Translation": "Converting text or speech from one language to another while maintaining the original meaning and context.",
      "Document Classification": "Categorizing documents into predefined classes based on their content, such as spam detection in emails.",
      "Keyword Extraction": "Identifying and extracting the most relevant or significant words or phrases from a text.",
      "Named Entity Recognition": "Identifying and classifying key entities in the text, such as names of people, places, organizations, dates, and other specifics.",
      "Sentiment Analysis": "Determining the emotional tone of the text, categorizing it as positive, negative, or neutral.",
      "Theme Identification": "Determining central themes or topics discussed in the text.",
      "Part-of-Speech Tagging": "The process of identifying and labeling each word in a text with its corresponding part of speech, such as noun, verb, adjective, etc., based on both its definition and context within the sentence."
    },
    "Creative and Generative Tasks": {
      "descr": "This category is for tasks that require the generation of new content or ideas. It emphasizes creativity, originality, and the ability to construct meaningful or aesthetically pleasing outputs.",
      "Artistic Concept Generation": "The creative process of coming up with concepts, themes, or inspiration for artistic endeavors, applicable to visual arts, music, writing, or other forms of artistic expression.",
      "Code Writing": "The task of creating software code, involving writing scripts or programs in various programming languages, focusing on aspects like functionality, efficiency, and readability.",
      "Creative Writing and Composition": "The process of generating original artistic content, such as poems, stories, or narratives, emphasizing creativity, narrative structure, and expressive use of language.",
      "Textual Adaptation and Transformation": "Involves modifying existing texts to create new versions, such as developing alternative endings for stories, converting texts into different genres, or reimagining narratives from new perspectives.",
      "Assisting with Emails": "The skill of drafting and structuring emails for business or professional communication, focusing on clarity, tone, and appropriateness to the context and audience.",
      "Culinary Assistance and Guidance": "Providing support and advice in cooking processes, including recipe selection, ingredient substitution, cooking techniques, and presentation tips.",
      "Humor and Joke Crafting": "The creative process of developing humorous content, jokes, or witty remarks, tailored to entertain or engage a specific audience.",
      "Personalized Recommendation Generation": "Generating tailored suggestions or recommendations based on user preferences or requirements, applicable in areas like books, movies, products, or travel destinations.",
      "Hobby Development Assistance": "Providing guidance and support for exploring and developing new hobbies, including advice on selecting hobbies, creating learning plans, and offering tips for skill advancement.",
      "Prompt Development and Customization": "The process of creating and refining prompts for various applications, encompassing the generation of original prompts and the modification of existing ones to suit specific needs or contexts."
    },
    "Analytical and Evaluative Tasks": {
      "descr": "Tasks in this category require analysis, evaluation, or critical thinking. They involve interpreting information, making judgments, or providing reasoned arguments.",
      "Linguistic Analysis": "Analyzing grammatical, syntactic, and stylistic aspects of the text.",
      "Critical Review and Assessment": "Evaluating content, such as articles, books, or projects, for quality, coherence, and overall effectiveness, often providing constructive feedback.",
      "Grammatical Error Correction": "The task of detecting and correcting grammatical errors in a text, which includes fixing issues related to verb tense, subject-verb agreement, sentence structure, punctuation, and other aspects of grammar.",
      "Simplifying Complex Ideas": "The process of breaking down and explaining complex concepts or information in a simpler, more understandable way, making them accessible to a broader audience.",
      "Mathematical Problem Solving": "The task of solving mathematical problems or equations, ranging from basic arithmetic to more advanced areas like calculus, statistics, or algebra.",
      "Code Analysis": "Involves examining, interpreting, and debugging existing code, as well as providing insights on code structure, optimization, and best practices in software development.",
      "Business Analysis and Strategy Development": "The process of evaluating business opportunities, analyzing plans and reports, and generating strategic ideas to support business growth, decision-making, and operational efficiency.",
      "Healthcare and Medical Analysis": "Examining healthcare practices, medical treatments, or patient data to improve health outcomes and care efficiency.",
      "Legal Case Analysis": "Examining legal documents, cases, and precedents to interpret laws and provide legal insights or strategies.",
      "Cybersecurity Threat Assessment": "Evaluating digital systems for potential security threats and vulnerabilities, suggesting measures to enhance security.",
      "Fiction Analysis": "Critically evaluating a piece of flash fiction, focusing on its narrative structure, character development, and impact."
    }
  },
  "output": {
    "descr": "These are three most general types of tasks",
    "Information Processing and Retrieval": {
      "descr": "This category includes classical NLP tasks that involve the handling, interpretation, and retrieval of information. It encompasses activities where the primary goal is to manage and utilize existing knowledge or data.",
      "Factual Question Answering": {
        "descr": "Responding to queries with accurate, specific information based on available data or known facts.",
        "subtasks": [
          {
            "name": "Direct Answer Extraction",
            "description": "This subtask involves scanning the text to find and extract a concise, direct answer to a specific factual question. It requires pinpointing exact phrases or data within the text that directly respond to the query. The goal is to provide a straightforward and precise answer without additional commentary or explanation."
          },
          {
            "name": "Data Synthesis for Answering",
            "description": "This subtask entails combining disparate pieces of information from the text to formulate a cohesive answer to a factual question. It may involve correlating dates, events, or statistical data to provide a comprehensive response. The objective is to synthesize available information to answer questions that cannot be responded to with a single fact."
          },
          {
            "name": "Contextual Clarification",
            "description": "This task is about providing the necessary background or contextual details that are crucial for understanding the answer to a factual question. It involves distinguishing and conveying the context in which the facts are presented in the text. The purpose is to ensure that the answer is clear and meaningful within the larger framework of the subject matter."
          },
          {
            "name": "Definitional Response",
            "description": "The aim of this subtask is to offer a definition or explanation of terms or concepts asked about in the factual question. It requires extracting and reformulating descriptions or definitions from the text. The goal is to aid understanding by defining any technical or specialized terms relevant to the question."
          },
          {
            "name": "Historical Information Retrieval",
            "description": "When a factual question pertains to historical data within the text, this subtask focuses on retrieving and presenting that information accurately. It may involve identifying dates, timelines, and significant events. The objective is to provide answers that accurately reflect the historical aspect of the question."
          },
          {
            "name": "Quantitative Information Extraction",
            "description": "This subtask concentrates on locating and extracting numerical data, statistics, or quantities from the text that are requested in a factual question. It requires an understanding of numerical figures and their relevance to the inquiry. The purpose is to deliver precise numerical answers to fact-based questions."
          },
          {
            "name": "Causal Explanation",
            "description": "This subtask aims to explain the cause-and-effect relationships present in the text in response to factual questions about why something occurred. It involves deducing and elucidating the causal links between events or phenomena described in the text. The goal is to provide a clear explanation of the causes behind the queried effect."
          },
          {
            "name": "Procedure Outline",
            "description": "For factual questions regarding procedures or processes described in the text, this subtask focuses on outlining the steps or stages in a clear and logical sequence. It requires distillation of the process into a clear, concise, and orderly format. The aim is to provide a step-by-step answer that captures the procedure's essence."
          },
          {
            "name": "Geographic Information Response",
            "description": "This subtask targets the identification and provision of geographic details in response to location-based factual questions. It involves parsing the text for place names, geographical features, or spatial relationships. The objective is to deliver accurate geographic information as per the question's focus."
          },
          {
            "name": "Person-Related Facts Identification",
            "description": "When factual questions pertain to individuals mentioned in the text, this subtask revolves around identifying and presenting facts related to those persons. It includes pinpointing biographical data, contributions, or any relevant personal details. The goal is to answer questions specifically about people with accurate information from the text."
          },
          {
            "name": "Temporal Fact Addressing",
            "description": "This subtask involves identifying and responding to questions about the timing of events or the duration of occurrences as stated in the text. It requires a careful analysis to provide accurate chronological information or timeframes. The purpose is to give precise temporal answers to questions regarding 'when'."
          },
          {
            "name": "Correlation Explanation",
            "description": "In response to factual questions seeking to understand correlations within the text, this subtask is about explaining any connections or relationships between different pieces of information. It involves discerning and explicating these relationships clearly. The aim is to clarify how different facts presented in the text are interrelated."
          },
          {
            "name": "Implication Deduction",
            "description": "This subtask requires determining the implications or inferences that can be drawn from the facts presented in response to a question asking about consequences or outcomes. It involves reading between the lines to deduce the unstated consequences or inferences. The objective is to provide insightful answers that reflect an understanding of the text's implications."
          },
          {
            "name": "Direct Factual Answering",
            "description": "This subtask involves providing straightforward answers to questions that can be directly retrieved from the text. It requires identifying and extracting specific facts without the need for inference or interpretation. The goal is to deliver clear and concise responses that accurately address the questions posed."
          },
          {
            "name": "Contextual Information Retrieval",
            "description": "The subtask necessitates fetching not just the plain facts, but also the contextual information surrounding them. It calls for a comprehension of the text to pinpoint the circumstances or background details relevant to the question. The aim is to furnish a factual answer enriched with context to give a fuller understanding of the topic."
          },
          {
            "name": "Inference-Based Answering",
            "description": "This subtask requires deducing answers from the text that are not explicitly stated but can be inferred from given information. It demands critical thinking and the ability to connect the dots within the text. The objective is to provide accurate answers by interpreting and synthesizing facts and details."
          },
          {
            "name": "Comparative Fact Retrieval",
            "description": "The task here is to answer questions that require comparing and contrasting information from different parts of the text. It involves analyzing and evaluating similarities and differences to deliver a comprehensive response. The goal is to synthesize comparison-based answers that highlight factual distinctions or similarities."
          },
          {
            "name": "Sequential Event Answering",
            "description": "This subtask focuses on questions concerning the sequence or order of events described in the text. It requires an understanding of the timeline and the ability to summarize the sequence of factual occurrences. The aim is to present information in a logical and chronological order in response to the query."
          },
          {
            "name": "Quantitative Fact Answering",
            "description": "The subtask involves providing numerical answers to questions that ask about quantities, statistics, or measurements contained within the text. It requires pinpointing and extracting exact figures or data. The objective is to deliver precise numeric information that directly answers the question."
          },
          {
            "name": "Definition Extraction",
            "description": "This subtask revolves around answering questions by finding and presenting definitions or explanations for terms or concepts in the text. It entails locating and paraphrasing definitional content. The goal is to clearly convey the meaning or concept behind specific terminology used within the text."
          },
          {
            "name": "Causality Determination",
            "description": "The subtask here is to answer questions that involve cause and effect relationships present in the text. It focuses on identifying and articulating the reasons or motives behind events or situations. The aim is to provide answers that encompass an understanding of the causal links mentioned in the text."
          },
          {
            "name": "Geographic Fact Answering",
            "description": "This subtask requires responding to questions about locations, geographic terms, or spatial relationships as described in the text. It involves identifying and summarizing the geographic details that are pertinent to the question. The goal is to offer accurate geographic information in a clear and relevant manner."
          },
          {
            "name": "Biographical Fact Answering",
            "description": "The subtask concentrates on answering questions related to individual histories or profiles based on the text. It requires extracting and summarizing relevant personal information or career facts. The objective is to provide a brief but informative overview of a person's background or accomplishments."
          },
          {
            "name": "Historical Fact Answering",
            "description": "This subtask involves addressing questions that pertain to historical events, periods, or figures as mentioned in the text. It necessitates the extraction of pertinent historical facts and details. The goal is to furnish accurate historical answers that are informative and reflective of the temporal context in the text."
          },
          {
            "name": "Technical Term Answering",
            "description": "The subtask focuses on providing clear explanations for technical terms and jargon found within the text when queried. It entails identifying and defining specialized language in a way that is accessible. The objective is to demystify complex terms and present them in a comprehensible format."
          },
          {
            "name": "Subject-Specific Fact Answering",
            "description": "This subtask addresses questions that require knowledge of a specific subject mentioned in the text. It demands an understanding of the subject matter to retrieve and explain subject-related facts. The aim is to provide expert-level responses that showcase a grasp of the specialized content."
          },
          {
            "name": "Procedure Outline Answering",
            "description": "The task is to answer questions about procedures, methods, or steps outlined in the text. It involves summarizing the sequence and details of the activities described. The goal is to clearly articulate the process or set of actions required to achieve a specific outcome."
          },
          {
            "name": "Hypothesis Testing Answering",
            "description": "This subtask requires addressing questions that explore hypothetical scenarios or predictions stated in the text. It calls for evaluating the text to affirm or refute hypotheses based on the information provided. The objective is to offer answers that assess the validity of conjectures within the context of the text."
          }
        ]
      },
      "Text Summarization": {
        "descr": "Condensing lengthy texts into concise summaries, capturing the essential points.",
        "subtasks": [
          {
            "name": "Abstract Summarization",
            "description": "This subtask aims to generate an abstract, or self-contained, summary that presents the core points of the text without necessarily using the original text's words or phrases. It challenges the summarizer to paraphrase and condense content independently. The goal is to create an entirely new summary that stands on its own while accurately reflecting the text's information."
          },
          {
            "name": "Executive Summarization",
            "description": "The executive summarization subtask is designed to craft summaries suited for executives or decision-makers, focusing on the most critical information affecting business or operational decisions. It requires identifying and emphasizing data, results, and actionable insights. The summary must be succinct, highlight vital statistics or facts, and aim to support efficient decision-making."
          },
          {
            "name": "Comparative Summarization",
            "description": "This subtask involves creating summaries that compare and contrast key elements or viewpoints presented in the text. It requires the identification of similarities and differences within the material. The result is a summary that helps the reader understand varying perspectives or competing information on the same topic."
          },
          {
            "name": "Critical Summarization",
            "description": "Critical summarization involves analyzing and summarizing text with a critical eye, questioning underlying assumptions or potential biases. It aims to present a balanced view by considering various perspectives and critiques. This subtask is essential for creating summaries that offer depth and a comprehensive understanding of the text's context and implications."
          },
          {
            "name": "Technical Summarization",
            "description": "Technical summarization requires distilling complex, technical texts into more accessible summaries without losing key technical details. It involves translating specialized jargon into language that is understandable to a broader audience. The summary should accurately convey the original text's technical content in a form that is both concise and clear to non-experts."
          },
          {
            "name": "Narrative Summarization",
            "description": "Narrative summarization focuses on condensing stories, plots, or accounts into their most essential narrative elements. It aims to preserve the story arc and key character developments while removing extraneous details. The outcome is a short narrative that captures the spirit and progression of the original storytelling."
          },
          {
            "name": "Subjective Summarization",
            "description": "Subjective summarization allows for the inclusion of the summarizer's interpretations, opinions, or reactions to the text. It involves providing a personal touch to the summary, highlighting what the summarizer found most compelling or relevant. This subtask is particularly useful for texts where personal engagement or opinion adds value, such as in book reviews or editorial commentaries."
          },
          {
            "name": "Sentiment Summarization",
            "description": "Sentiment summarization identifies and conveys the emotions or sentiments expressed in the text. The subtask involves detecting the tone, mood, and attitudes present and succinctly summarizing them. This type of summary aids in quickly understanding the emotional content or stance of the original material."
          },
          {
            "name": "Informative Summarization",
            "description": "Informative summarization prioritizes the conveyance of factual information and data contained within the text. This subtask focuses on distilling figures, statistics, and verifiable facts into a compact summary. It is crucial for texts where factual accuracy and data density are more important than narrative or opinion."
          },
          {
            "name": "Instructional Summarization",
            "description": "Instructional summarization is about summarizing texts that contain instructions or procedural information. It aims to streamline the steps, rules, or guidelines presented, ensuring the essential details for performing a task remain clear and actionable. This subtask is critical for creating concise how-to guides, manuals, or recipes."
          },
          {
            "name": "Question-Driven Summarization",
            "description": "Question-driven summarization crafts summaries that directly address specific questions posed by the reader or inherent in the text. It requires identifying and extracting information that is relevant to the posed questions. The resulting summary is tailored to provide answers and is useful for informational texts like FAQs or research articles."
          },
          {
            "name": "Thematic Summarization",
            "description": "This subtask creates summaries centered around the dominant themes or motifs in the text. Identifying and focusing on recurring ideas or concepts is crucial to convey the overarching messages. The thematic summary distills a text into its fundamental thematic elements, providing insight into the core issues and concerns it addresses."
          },
          {
            "name": "Predictive Summarization",
            "description": "Predictive summarization looks to create summaries that highlight the text's implications for future events or developments. This includes forecasting potential outcomes or conclusions that could logically follow from the information presented. Such summaries are particularly useful for texts dealing with trends, projections, or scenarios, assisting the reader in anticipating what may come next based on the summarized content."
          },
          {
            "name": "Keyword Identification",
            "description": "Identify and list the most important words or phrases that are central to the text's content. This task helps determine the focal elements within the material, which can be critical for further analysis or summarization. Keywords serve as signposts for the main topics and ideas presented in the text."
          },
          {
            "name": "Contextual Understanding",
            "description": "This subtask involves interpreting the context in which the text is written, including recognizing the setting, time period, and any relevant cultural or social aspects. Understanding the context is crucial for accurate summarization as it affects the interpretation of the text's content. The subtask ensures the summary retains the intended meaning behind the original writing."
          },
          {
            "name": "Paraphrasing",
            "description": "Rewrite the text using different words and phrases while preserving the original meaning. Paraphrasing challenges the summarizer to express the same ideas in a new form, which can make the resulting summary feel fresh and distinct from the source text. This subtask is essential for avoiding plagiarism and ensuring originality in the summary."
          },
          {
            "name": "Sentence Reduction",
            "description": "This task requires reducing the length and complexity of sentences without losing their intended information or meaning. Efficient sentence reduction often involves removing redundant words or phrases and simplifying sentence structures. The focus is on clarity and brevity, making the summary easier to read and understand."
          },
          {
            "name": "Structural Organization",
            "description": "Reorganize the text to present the information in a logical and coherent order that facilitates quick understanding. This may include grouping related ideas or creating a hierarchy of information from the original text. The subtask enhances the summary's readability and aids the reader in grasping the essential points more effectively."
          },
          {
            "name": "Quantitative Reduction",
            "description": "Measure and execute a reduction in the word count or page number to reach a predetermined summary size while retaining key information. The task sets quantitative goals for the summary's length, necessitating careful selection of content. It ensures the final summary is concise and adheres to any specific length requirements."
          },
          {
            "name": "Purposive Summarization",
            "description": "Tailor the summary to serve a specific purpose or meet the needs of a particular audience. This might involve emphasizing certain aspects of the text over others based on the intended use of the summary. The subtask ensures the most relevant and useful information is highlighted for the target readership."
          },
          {
            "name": "Critical Analysis",
            "description": "Evaluate the text's arguments, ideas, or information critically before summarizing. This involves assessing the strength, validity, relevance, and originality of the content. A summary derived from a critical analysis provides a nuanced understanding of the text and highlights its most substantial or contentious points."
          },
          {
            "name": "Information Extraction",
            "description": "Extract factual data, statistics, dates, names, and other concrete information from the text. This subtask requires the identification and isolation of objective details that are crucial to the text's message or narrative. The extracted information is often pivotal for a summary that focuses on fact-based comprehension."
          },
          {
            "name": "Tone Identification",
            "description": "Determine the tone or mood conveyed in the text, such as formal, informal, optimistic, pessimistic, etc. Identifying the tone is important because it influences how information is perceived and should be reflected in the summary. The subtask helps maintain the original text's emotional and stylistic undertones in the condensed version."
          },
          {
            "name": "Simplification",
            "description": "Transform complex language, technical terms, and advanced concepts into simpler, more understandable content. The subtask is particularly important when the target audience lacks expertise in the subject matter. Simplification aids in making the summary accessible to a broader range of readers."
          },
          {
            "name": "Cause and Effect Identification",
            "description": "Identify key cause-and-effect relationships present in the text to ensure they are represented in the summary. Understanding these relationships helps preserve the narrative or logical flow of the original content. This subtask emphasizes the connections between events, actions, or ideas that are central to the text's message."
          },
          {
            "name": "Inference Drawing",
            "description": "Draw inferences from the text that may not be explicitly stated but are implied by the content. This involves reading between the lines to understand the underlying messages or themes. Capturing these inferences in the summary adds depth and provides a more comprehensive understanding of the text."
          },
          {
            "name": "Point of View Identification",
            "description": "Identify the narrator's or author's point of view and ensure that it is considered in the summarization process. Whether it is first-person, second-person, or third-person, understanding the point of view influences how the information is presented. This subtask is crucial for maintaining the perspective of the original text in the summary."
          },
          {
            "name": "Textual Cohesion",
            "description": "Ensure that the summary maintains coherence and flows smoothly by using effective transitions and clear connections between ideas. The subtask assesses the logical arrangement of the content and the use of cohesive devices. A cohesive summary is easier to follow and provides a better reading experience."
          }
        ]
      },
      "Information Extraction": {
        "descr": "Identifying and extracting key pieces of information from a larger dataset or complex texts.",
        "subtasks": [
          {
            "name": "Named Entity Recognition",
            "description": "This subtask involves scanning the text to find and label entities such as names of people, organizations, locations, dates, and other specific information. The process includes categorizing these entities based on their types and significance within the text. The goal is to structure unstructured data for easy access to particular details."
          },
          {
            "name": "Key Phrase Extraction",
            "description": "This subtask is focused on identifying important phrases within the text that capture significant themes or concepts. It usually involves algorithms that can detect relevance and frequency of phrases. The end result is a list of phrases that provide insight into the text's main points."
          },
          {
            "name": "Fact Extraction",
            "description": "The aim of this subtask is to identify and extract factual statements from the text. This involves discerning between opinions and factual data, ensuring that the extracted information is objective and verifiable. The outcome is a collection of facts that can be used for data validation or knowledge base development."
          },
          {
            "name": "Event Extraction",
            "description": "Event Extraction is about finding mentions of events within the text and detailing their characteristics, such as time, location, participants, and nature of the event. The goal is to create a timeline or database of events for further analysis or record-keeping. This helps in understanding the sequence and impact of occurrences mentioned in the text."
          },
          {
            "name": "Pattern Recognition",
            "description": "This subtask entails identifying recurring patterns or anomalies within the text. By analyzing frequency and co-occurrence of words or phrases, patterns can be detected, which may reveal hidden structures or meanings. This forms the basis for more advanced text analysis and data mining."
          },
          {
            "name": "Keyword Extraction",
            "description": "The goal is to extract the most relevant and significant words from the text that are key to understanding its content. This typically involves statistical analysis to identify high-frequency and relevant terms. Keywords serve as a quick reference to the text's main points."
          },
          {
            "name": "Concept Linking",
            "description": "This subtask requires mapping the extracted information to existing concepts in a knowledge base. It is about finding connections between the text and known concepts to enrich the content with external data. This linking process aids in deepening the context and understanding of the text."
          },
          {
            "name": "Anomaly Detection",
            "description": "The subtask is to identify outlying pieces of information or data that deviate from the norm within the text. It involves recognizing inconsistencies or unexpected occurrences. Detecting anomalies can help in catching errors, fraud, or highlighting areas for further investigation."
          },
          {
            "name": "Relationship Extraction",
            "description": "This subtask is concerned with detecting and extracting semantic relationships between the identified entities within the text. It seeks to understand the connections or associations between different entities, such as who did what to whom, when and where. The result is a network of relationships that can be used for further analysis or knowledge discovery."
          },
          {
            "name": "Causal Relationship Identification",
            "description": "The aim here is to identify cause-and-effect relationships within the text, which may not be explicitly stated. Understanding these relationships can provide insights into the underlying reasons for certain events or actions. This subtask is key for deep text analysis and reasoning."
          },
          {
            "name": "Coreference Resolution",
            "description": "This task strives to find all expressions that refer to the same entity in the text, such as pronouns or synonyms, and link them together. It is essential for understanding the text holistically and for maintaining the continuity of subjects throughout the discussion. The end goal is to resolve ambiguities in who or what is being referenced."
          },
          {
            "name": "Fact Checking",
            "description": "Here, the goal is to verify the accuracy of factual statements within the text by cross-referencing reliable sources. This subtask is important for maintaining the credibility of information and preventing the spread of misinformation. Fact checking promotes informed decision-making and trust in the extracted data."
          },
          {
            "name": "Temporal Information Extraction",
            "description": "This subtask focuses on identifying and extracting temporal expressions such as dates, times, durations, and frequencies. Understanding the timeline of events and how they relate to each other is crucial for many analytical tasks. The objective is to create a temporal map of events for sequence analysis."
          },
          {
            "name": "Geographical Information Extraction",
            "description": "The aim of this subtask is to extract and analyze geographical data such as place names, addresses, and lat-long coordinates. It helps in mapping events or entities to specific locations, which is useful for a variety of geo-spatial analyses. The goal is to understand the geographical context of the text content."
          },
          {
            "name": "Document Classification",
            "description": "This includes assigning a document to one or more categories based on its content, facilitating document retrieval and organization. It is a more holistic approach than categorizing snippets of text, as it takes into account the full context of a document. The objective is to streamline the sorting and filing of documents into a predefined taxonomy."
          },
          {
            "name": "Summarization for Information Extraction",
            "description": "Although summarization is often a primary task, it can also serve as a subtask of information extraction by condensing the text into a summary that highlights extracted information. This allows for a quick review of the main points and pertinent details without delving into the full text. The goal is to produce an informative abstract that captures key data points succinctly."
          }
        ]
      },
      "Translation": {
        "descr": "Converting text or speech from one language to another while maintaining the original meaning and context.",
        "subtasks": [
          {
            "name": "Literal Translation",
            "description": "This subtask involves translating the text word-for-word from the source language to the target language. It pays close attention to the original grammar and vocabulary without adding interpretation or stylistic changes. The objective is to produce a translation that is as close as possible to the exact wording of the original text."
          },
          {
            "name": "Localized Translation",
            "description": "This subtask requires adapting the text to the cultural and regional nuances of the target language audience. It goes beyond literal translation to include local idioms, expressions, and references that are familiar to the target audience. The goal is to create a translation that feels natural and culturally relevant to native speakers."
          },
          {
            "name": "Technical Translation",
            "description": "The focus of this subtask is on texts that contain specialized vocabulary, such as scientific, engineering, or legal documentation. It necessitates a deep understanding of the subject matter to accurately convert technical terms and concepts. The aim is to provide a precise and clear translation that maintains the integrity of the specialized content."
          },
          {
            "name": "Simplified Translation",
            "description": "This subtask aims to translate text into a simpler version of the target language, making it more accessible to individuals with limited proficiency in the language. It involves using basic vocabulary and sentence structures while preserving the original message. The goal is to make the information understandable to a wider audience."
          },
          {
            "name": "Artistic Translation",
            "description": "Artistic translation is about conveying the original style, tone, and emotions of the source text in the target language. It is particularly important for works of literature, poetry, and other creative texts. The objective is to produce a translation that resonates with the target audience as strongly as the original text did with its audience."
          },
          {
            "name": "Dynamic Equivalence Translation",
            "description": "This subtask focuses on translating the meaning and intent of the source text rather than adhering strictly to its words and structure. It aims to evoke the same response in the target audience as the original text did. The priority is to ensure that the translation is equivalent in effect, though it may differ in form."
          },
          {
            "name": "Legal Translation",
            "description": "Legal translation is a subtask that requires dealing with legal documents such as contracts, statutes, and litigation materials. It demands high precision and an understanding of legal terminology and concepts in both source and target languages. The goal is to produce a translation that is legally sound and can be used in a legal context."
          },
          {
            "name": "Medical Translation",
            "description": "Medical translation specializes in translating healthcare-related documents, such as clinical study reports, patient records, and medical device manuals. It requires knowledge of medical terminology and compliance with regulatory standards. The goal is to deliver accurate and accessible translations for healthcare professionals and patients."
          },
          {
            "name": "Semantic Translation",
            "description": "Semantic translation prioritizes the meaning and concepts behind the words of the original text. The translator interprets the text and renders it in the target language with the intent to convey the same ideas. The goal is to maintain the integrity of the original message within the cultural context of the target language."
          },
          {
            "name": "Transcreation",
            "description": "Transcreation goes beyond translation to include the creation of new content within the target language, often for marketing and advertising purposes. It blends translation with copywriting to produce culturally and emotionally engaging content. The aim is to recreate the message in a way that resonates with the target audience’s cultural context and expectations."
          },
          {
            "name": "Glossary Compilation",
            "description": "This subtask involves creating a comprehensive list of key terms and phrases found in the source text and providing their equivalents in the target language. It is an essential step for ensuring consistency and accuracy in translations, especially for larger projects. The objective is to establish a reference that can be used throughout the translation process."
          },
          {
            "name": "Back Translation",
            "description": "Back translation is the process of translating a document that has already been translated into another language back to the original language. It is often used as a quality assurance measure to check the accuracy and fidelity of the initial translation. The goal is to identify discrepancies and refine the translation to better reflect the original text."
          },
          {
            "name": "Machine Translation Post-Editing",
            "description": "This subtask involves reviewing and editing machine-generated translations to correct errors and improve fluency. It combines the efficiency of automated translation with the expertise of a human translator. The aim is to refine the output to meet professional translation standards."
          },
          {
            "name": "Literal Translation",
            "description": "This subtask involves a word-for-word translation of the text, preserving the exact wording and phrasing from the source language. It prioritizes strict adherence to the original language's syntax and lexical choices. The goal is to produce a translation that is as close to the original wording as possible, regardless of fluency in the target language."
          },
          {
            "name": "Localized Translation",
            "description": "This task requires adapting the text to fit the cultural and linguistic context of the target language. It means not only translating the words but also modifying expressions, idioms, and references to be culturally appropriate. The objective is a translation that is both linguistically and culturally fluent for native speakers of the target language."
          },
          {
            "name": "Technical Translation",
            "description": "This subtask deals with translating texts that contain specialized terminology, such as scientific, engineering, or legal documentation. It requires a deep understanding of the subject matter and mastery of relevant jargon in both languages. The aim is to provide a precise and accurate translation that professionals in the field can rely on."
          },
          {
            "name": "Summarized Translation",
            "description": "This entails creating a condensed version of the original text in the target language, focusing on the main points or arguments. It combines translation with summarization skills to deliver the essence of the text without extraneous details. The result is a shorter, translated version that captures the core message of the source material."
          },
          {
            "name": "Literary Translation",
            "description": "A subtask centered around translating literature, such as novels, poems, or plays, where artistic and stylistic elements are crucial. It requires sensitivity to tone, style, and the author's voice, ensuring these are preserved in the translation. The goal is to produce a version that resonates with the target audience as effectively as the original does with its audience."
          },
          {
            "name": "Subtitling",
            "description": "This involves translating spoken dialogue into written text for subtitles in video content, requiring conciseness and synchronization with the timing of speech. The translator must balance readability and timing with accurate representation of the dialogue. The end result should allow viewers to follow the narrative seamlessly in the target language."
          },
          {
            "name": "Dynamic Equivalence Translation",
            "description": "This subtask aims to convey the same meaning and emotional impact as the original text, but not necessarily using the same words. It involves creative linguistic choices to evoke similar responses from the target language audience. The priority is equivalency in effect, rather than word-for-word accuracy."
          },
          {
            "name": "Legal Translation",
            "description": "This task involves translating legal documents such as contracts, statutes, and case files while ensuring precise legal terminology and adherence to the legal framework of the target language. It demands familiarity with legal concepts in both source and target legal systems. Accuracy and clarity are paramount to prevent any legal ambiguities."
          },
          {
            "name": "Medical Translation",
            "description": "The focus here is on translating medical documentation, such as patient records, clinical trial reports, and pharmaceutical literature. It requires a combination of linguistic proficiency and medical knowledge to guarantee accuracy and compliance with regulatory standards. The outcome is a translation that healthcare providers and patients can trust."
          },
          {
            "name": "Website Localization",
            "description": "This subtask extends beyond translating text to include adapting website content and navigation to suit a target language audience, often involving cultural adaptation as well. It encompasses everything from menus and buttons to articles and product descriptions. The goal is to create a user-friendly and culturally resonant experience for visitors in the target language."
          },
          {
            "name": "Interpretation",
            "description": "This subtask pertains to the real-time translation of spoken language, either face-to-face, over the phone, or through video communication. It requires the ability to quickly and accurately convey the substance and tone of spoken words from one language to another. Interpreters must facilitate smooth communication between parties speaking different languages."
          },
          {
            "name": "Gisting",
            "description": "Gisting is the task of providing a rough translation that gives the basic meaning of the text without aiming for perfection or completeness. It's valuable for quickly understanding the general content of the material without spending time on nuanced translation. The gist helps determine whether the text is relevant for a more detailed translation."
          },
          {
            "name": "Proofreading Translated Text",
            "description": "This subtask revolves around reviewing translated texts for accuracy, grammar, syntax, style, and coherence. It involves comparing the source text with the target text to ensure the translation is faithful and fluent. The objective is to refine the translated material to a high standard of quality."
          },
          {
            "name": "Audiovisual Translation",
            "description": "This pertains to translating content for multimedia resources, including film, television, and online videos. It not only requires linguistic skills but also an understanding of the technical aspects of timing and space constraints. The final product must maintain the integrity of the original while being accessible to the target language audience."
          },
          {
            "name": "Machine Translation Post-Editing",
            "description": "This involves editing and correcting machine-generated translations to improve their quality and ensure they are contextually appropriate and stylistically acceptable. The task balances the efficiency of automated translation with the nuance and expertise of a human translator. The end goal is to produce a reliable and intelligible translation that reads naturally in the target language."
          }
        ]
      },
      "Document Classification": {
        "descr": "Categorizing documents into predefined classes based on their content, such as spam detection in emails.",
        "subtasks": [
          {
            "name": "Topic Identification",
            "description": "In this subtask, the goal is to determine the main topic or topics that the document covers. It requires a review of the document to discern its overarching subject matter. This helps in classifying the document into a category that best represents its primary focus."
          },
          {
            "name": "Language Detection",
            "description": "This subtask involves identifying the language in which the document is written. It requires analyzing the text for language-specific characters, words, and sentence structures. Knowing the language is crucial for applying the correct classification models and for documents that are sorted by language."
          },
          {
            "name": "Authorship Attribution",
            "description": "Authorship attribution focuses on analyzing the writing style to hypothesize the potential author of the document. It looks at linguistic features, such as word choice and syntax. This can be particularly useful in classifying anonymous or disputed texts."
          },
          {
            "name": "Text Complexity Assessment",
            "description": "This subtask aims to evaluate the level of complexity in the document's language and structure. It involves analyzing factors like vocabulary difficulty, sentence length, and overall readability. Classifying documents by complexity can help in targeting the appropriate audience."
          },
          {
            "name": "Genre Classification",
            "description": "The objective here is to categorize the document based on its genre, such as fiction, non-fiction, news article, or academic paper. It requires distinguishing textual characteristics that are typical of different genres. This classification helps in organizing content according to its form and purpose."
          },
          {
            "name": "Functionality Determination",
            "description": "This subtask seeks to classify the document by its intended function or use, such as informative, persuasive, or instructional. By analyzing the document's content and style, one can discern its primary purpose. This is vital for understanding and categorizing documents by their function within communication."
          },
          {
            "name": "Length Classification",
            "description": "Length classification involves categorizing documents by their size, such as short, medium, or long texts. The subtask includes counting the number of words or characters. This information can be beneficial for allocating reading time or for filtering content based on length preferences."
          },
          {
            "name": "Time Period Analysis",
            "description": "This subtask focuses on determining the time period or era that the document relates to or was created in. It involves analyzing historical references, language evolution, and context clues. Classifying documents by time period can be crucial for historical analysis and temporal categorization."
          },
          {
            "name": "Audience Targeting",
            "description": "The subtask aims to identify the intended audience of the document, such as children, adults, professionals, or the general public. This involves examining the content for clues about the target demographic. Knowing the audience is important for classifying content by its suitability for different reader groups."
          },
          {
            "name": "Formality Level Rating",
            "description": "This subtask assesses the degree of formality in the document's language, categorizing it as formal, informal, or colloquial. It looks at the use of jargon, slang, and the overall tone. Recognizing the formality level aids in classifying professional versus casual communications."
          },
          {
            "name": "Cultural Context Identification",
            "description": "Identifying the cultural context involves recognizing references, norms, and values that are specific to particular cultures within the document. This helps in understanding the cultural perspective and classifying the document accordingly. It's essential for sensitive and accurate content categorization."
          },
          {
            "name": "Legal Relevance Scanning",
            "description": "This subtask is concerned with detecting legal terminology and concepts that indicate the document's relevance to legal matters. It includes identifying statutes, case law references, or regulatory language. Classifying documents based on legal relevance is crucial for law-related categorization."
          },
          {
            "name": "Technical Jargon Identification",
            "description": "Aiming to identify technical terms and specialized language used within the document, this subtask evaluates the presence of industry-specific jargon. This is an important step in classifying documents into technical or scientific categories and ensuring that they reach the right audience."
          },
          {
            "name": "Topic Identification",
            "description": "This subtask involves determining the core subjects or topics addressed in the document. It requires analyzing the content to identify subject matter and main ideas presented. The goal is to classify the document into the most relevant topics for easier indexing and retrieval."
          },
          {
            "name": "Sentiment Analysis",
            "description": "The purpose of this subtask is to assess the sentiment or emotional tone conveyed in the document. It entails examining the language and expressions used to determine whether the sentiment is positive, negative, or neutral. This can be particularly useful for understanding opinions in product reviews or customer feedback."
          },
          {
            "name": "Authorship Attribution",
            "description": "This subtask aims to analyze the writing style and other linguistic features to hypothesize about the authorship of the document. It involves computational techniques to compare document features with known works of potential authors. The goal is to suggest the most probable author(s) for unidentified or disputed documents."
          },
          {
            "name": "Genre Classification",
            "description": "This subtask classifies the document into a specific genre or format, such as news, fiction, technical, or academic. It requires an examination of the content, style, and structure of the text. Successfully categorizing the genre aids users in finding the appropriate type of content they are searching for."
          },
          {
            "name": "Urgency Detection",
            "description": "The goal of this subtask is to determine the level of urgency in a document. It involves detecting phrases or signals that indicate a need for immediate attention or action. This classification can prioritize certain documents, such as urgent emails or alerts."
          },
          {
            "name": "Language Detection",
            "description": "This subtask seeks to identify the language used in the document. It involves recognizing language-specific features, such as character sets, syntax, and vocabulary. Accurate language detection is crucial for routing the document through the appropriate language processing workflows."
          },
          {
            "name": "Length Classification",
            "description": "The objective here is to classify documents based on their length, categorizing them as short, medium, or long. This involves counting words, sentences, or pages. This information can be used to manage reader expectations or allocate time for document review."
          },
          {
            "name": "Complexity Assessment",
            "description": "This subtask evaluates the complexity level of the document's language and concepts. It includes analyzing vocabulary difficulty, sentence structure, and conceptual depth. Complexity assessment helps in tailoring content to the appropriate audience."
          },
          {
            "name": "Readability Scoring",
            "description": "The purpose of this subtask is to assign a readability score to the document, indicating how easy it is to understand. It requires analysis of sentence length, word complexity, and syntax. Such scoring can guide the presentation of content to match the reader's literacy level."
          },
          {
            "name": "Legal Document Detection",
            "description": "This subtask involves detecting whether the document is of a legal nature, such as contracts or terms of service. It looks for specific legal terminology, format, and references to statutes or case law. This form of classification is essential for legal professionals and compliance officers."
          },
          {
            "name": "Privacy Information Identification",
            "description": "The goal here is to scan documents for sensitive or personal information that may include names, addresses, or financial information. This task is crucial for privacy compliance and data protection. It involves pattern recognition and anomaly detection to flag potential privacy concerns."
          },
          {
            "name": "Spam Detection",
            "description": "This subtask aims to identify and classify unsolicited or irrelevant documents, commonly known as spam. It involves detecting certain patterns, keywords, and sender reputation. Spam detection is vital for maintaining the integrity of communication channels."
          },
          {
            "name": "Historical Reference Highlighting",
            "description": "The objective of this subtask is to identify and highlight references to historical events, figures, or periods within a document. It requires detecting and classifying content based on historical relevance. This can be useful for educational or research purposes."
          },
          {
            "name": "Technical Jargon Identification",
            "description": "This subtask focuses on recognizing and classifying documents that contain specialized technical language. It includes scanning for industry-specific terminologies and acronyms. Identification of technical jargon is important for directing documents to subject matter experts or for specialized processing."
          },
          {
            "name": "Citation Analysis",
            "description": "This subtask involves identifying and evaluating the references and citations within academic or research documents. It examines the usage of cited works and their relevance to the document's content. Citation analysis is important for understanding the impact and validity of research findings."
          }
        ]
      },
      "Keyword Extraction": {
        "descr": "Identifying and extracting the most relevant or significant words or phrases from a text.",
        "subtasks": [
          {
            "name": "Frequency-Based Keyword Extraction",
            "description": "This subtask involves identifying keywords based on the frequency of their occurrence within the text. It entails counting words, ranking them according to how often they appear, and selecting the most frequent as the probable keywords. The goal is to capture the most repeated concepts or terms that could reflect the text's primary focus."
          },
          {
            "name": "Contextual Keyword Extraction",
            "description": "The aim of this subtask is to extract keywords that are relevant to the context of the text, even if they do not have the highest frequency of appearance. It involves analyzing the context in which words are used to determine their significance. This method prioritizes meaning over mere frequency, focusing on the importance of terms within particular sections or topics."
          },
          {
            "name": "Semantic Keyword Extraction",
            "description": "Semantic extraction is about finding keywords that carry the core meaning of the text, often using advanced linguistic and statistical models. This process involves understanding synonyms, word relationships, and the broader topics the text discusses. The goal is to identify keywords that represent the essence of the content semantically, not just syntactically."
          },
          {
            "name": "Co-occurrence Keyword Extraction",
            "description": "This subtask determines keywords by identifying words that frequently appear in close proximity to each other. By mapping these co-occurrences, it helps in revealing the network of terms that jointly contribute to the main subject of the text. This approach is effective for finding groups of words that, together, form significant concepts within the document."
          },
          {
            "name": "Collocation Extraction",
            "description": "Collocation extraction focuses on capturing common word pairings or sequences that tend to occur together more frequently than by chance. It helps in identifying idiomatic expressions or fixed phrases within the text. The result is a set of collocated terms that enhance the understanding of the text's language patterns."
          },
          {
            "name": "Part-of-Speech Filtering",
            "description": "Keywords are extracted based on specific parts of speech, such as nouns, adjectives, or verbs, using grammatical tagging. This approach assumes that certain parts of speech are more likely to contain keywords that define the content of the text. The process filters and highlights terms that play a significant role in conveying the message."
          },
          {
            "name": "Trend-Related Keyword Extraction",
            "description": "This subtask aims to identify keywords that are currently trending or have gained relevance over a period of time. It involves comparing the text against a dataset of time-sensitive terms and phrases. The goal is to discover and extract keywords that resonate with ongoing trends or events."
          },
          {
            "name": "Domain-Specific Keyword Extraction",
            "description": "Extraction of keywords with respect to a specific domain or field of study, utilizing specialized vocabulary. This process requires an understanding of the subject matter to accurately identify terms that are crucial within a particular area. Keywords found through this method are tailored to industry experts or an audience familiar with the field."
          },
          {
            "name": "Weighted Keyword Extraction",
            "description": "Keywords are extracted based on their weighted importance within the text, which might be determined by algorithms like TF-IDF (Term Frequency-Inverse Document Frequency). This approach emphasizes terms that are unique and significant across a collection of documents, thus distinguishing the importance of keywords within the context of the larger dataset. The objective is to pinpoint keywords that uniquely characterize the text."
          },
          {
            "name": "Pattern-Based Keyword Extraction",
            "description": "This subtask employs pattern recognition to identify and extract keywords, often based on predefined or discovered templates and structures within the text. It might use regular expressions or other pattern-matching techniques to pinpoint keywords that adhere to certain syntactic patterns. The focus is on systematic discovery of keywords through structural analysis."
          },
          {
            "name": "Sentiment-Associated Keyword Extraction",
            "description": "Keywords are identified based on their association with sentiments expressed in the text, such as positive, negative, or neutral. This approach not only extracts terms but also provides insight into the emotional tone of the text. It is valuable for understanding the sentiment-driven themes and viewpoints present in the content."
          },
          {
            "name": "Frequency-Based Keyword Extraction",
            "description": "This subtask involves identifying keywords based on their frequency of occurrence within the text. It requires counting the number of times each word appears and typically involves filtering out common stop words. The goal is to isolate words that are mentioned often and may signify important topics or concepts within the text."
          },
          {
            "name": "Contextual Keyword Extraction",
            "description": "As part of this subtask, keywords are determined by the context in which they appear, considering not just frequency but also the surrounding words and phrases. It involves analyzing patterns of usage and the relationships between words. The aim is to extract keywords that are contextually significant and contribute to the understanding of the text."
          },
          {
            "name": "Noun Phrase Keyword Extraction",
            "description": "This task involves extracting keywords that are specifically noun phrases, as they often represent key concepts or entities. It entails parsing the text for parts of speech and identifying noun phrases that can be significant. The objective is to capture multi-word expressions that can provide a deeper understanding of the text's subject matter."
          },
          {
            "name": "Bi-gram Keyword Extraction",
            "description": "Focusing on the extraction of two adjacent words, or bi-grams, this subtask looks for word pairs that might have a special significance when used together. It involves scanning the text for recurring word pairs. This can reveal important concepts that single-word analysis might miss."
          },
          {
            "name": "Tri-gram Keyword Extraction",
            "description": "Similar to bi-grams, this subtask focuses on tri-grams, which are sequences of three adjacent words. By identifying common tri-grams, the task aims to find phrases that capture more nuanced or specific ideas within the text. The result is a list of keyword trios that offer insight into the content."
          },
          {
            "name": "Semantic Keyword Extraction",
            "description": "This subtask involves extracting keywords by understanding the underlying semantics of the text. It uses natural language processing techniques to discern the meaning and significance of words in context. The goal is to identify keywords that truly represent the essence of the text, beyond just their frequency or proximity to other words."
          },
          {
            "name": "Hashtag Keyword Extraction",
            "description": "In texts containing hashtags, this subtask focuses on identifying and extracting these hashtags as pre-identified keywords. It assumes that hashtags are already a form of keyword determined by the author or audience. The objective is to compile a list of these user-generated identifiers to understand the highlighted topics."
          },
          {
            "name": "Sentiment-Associated Keyword Extraction",
            "description": "This subtask aims to extract keywords that are associated with sentiments expressed in the text. It analyzes the text to determine the emotional tone and identifies words that are central to those sentiments. This allows for the isolation of keywords that not only are relevant to the content, but also convey the emotional undertones present."
          },
          {
            "name": "Domain-Specific Keyword Extraction",
            "description": "This subtask targets the extraction of keywords that are particularly relevant to a specific domain or field of study. It requires knowledge of the domain to recognize terminology and concepts that are of significance. The goal is to retrieve keywords that would be informative for experts or interested parties within that particular field."
          },
          {
            "name": "Acronym and Abbreviation Keyword Extraction",
            "description": "This subtask specifically seeks to identify and extract acronyms, initialisms, and abbreviations within the text that serve as keywords. It involves recognizing these shortened forms and understanding their expanded meanings. This is crucial for understanding texts with specialized language or texts that heavily use acronyms and abbreviations."
          },
          {
            "name": "Keyword Extraction for Summarization",
            "description": "The aim of this subtask is to extract keywords that can aid in creating a summary of the text. It requires determining the most pivotal words or phrases that encapsulate the main ideas or themes. These keywords can then be used as a foundation for generating concise summaries."
          },
          {
            "name": "Named Entity Keyword Extraction",
            "description": "This subtask involves identifying proper nouns and named entities such as people, organizations, and locations. It employs specialized algorithms to detect these entities within texts. The objective is to highlight these entities as keywords, given their importance in understanding the context or focus of the text."
          },
          {
            "name": "Cross-Document Keyword Extraction",
            "description": "In this subtask, the goal is to extract keywords not just from a single text but across multiple documents. It involves analyzing a set of texts to find common and significant words or phrases. This can reveal overarching keywords that are relevant across a collection of related texts."
          },
          {
            "name": "Keyword Trend Analysis",
            "description": "This subtask extends keyword extraction to analyze the popularity or trend of certain keywords over time. It involves examining texts from different time periods to track the emergence or decline of specific words or phrases. This can be particularly useful in understanding evolving topics or interests in a given area."
          },
          {
            "name": "Keyword Extraction for Information Retrieval",
            "description": "The goal of this subtask is to extract keywords that will be effective in retrieving relevant information from databases or search engines. It requires selecting words or phrases that are likely to be used as search queries. This helps in optimizing texts or content for better visibility and accessibility through search mechanisms."
          }
        ]
      },
      "Named Entity Recognition": {
        "descr": "Identifying and classifying key entities in the text, such as names of people, places, organizations, dates, and other specifics.",
        "subtasks": [
          {
            "name": "Person Entities Extraction",
            "description": "This subtask involves identifying all the proper nouns that refer to people within the text. It requires the recognition of names and sometimes titles, distinguishing them from other entities. The aim is to generate a list of all individual persons mentioned in the text."
          },
          {
            "name": "Location Entities Extraction",
            "description": "The subtask focuses on pinpointing geographical entities within the text, such as countries, cities, landmarks, and natural features. It includes distinguishing these from non-geographical names. The goal is to catalog every mentioned location."
          },
          {
            "name": "Organization Entities Extraction",
            "description": "This subtask seeks to identify all mentions of institutions, companies, governments, and other organized groups. It involves distinguishing these from other entities within the text. The output is a list of all organizations mentioned."
          },
          {
            "name": "Temporal Entities Extraction",
            "description": "The focus here is on identifying all time-related entities, including dates, days, months, years, and even specific times of events. It separates these temporal indicators from other numerical information. The task results in a compilation of all time references."
          },
          {
            "name": "Monetary Entities Extraction",
            "description": "This subtask aims to locate and classify all mentions of money, including currencies, amounts, and financial terms. It requires differentiating monetary references from other numerical data. This creates a record of all financial entities."
          },
          {
            "name": "Statistical Entities Extraction",
            "description": "The purpose of this subtask is to extract all statistical data, such as percentages, numerical data, and quantifiable measures. It focuses on distinguishing this information from other non-statistical content. It results in a collection of all statistical figures mentioned."
          },
          {
            "name": "Product Entities Extraction",
            "description": "This subtask targets the identification of product names, brands, and associated trademarks mentioned in the text. It differentiates these product references from other entities. The task compiles a list of all products identified."
          },
          {
            "name": "Event Entities Extraction",
            "description": "The subtask aims to single out references to specific events, historical milestones, or occurrences. It involves distinguishing event names from generic activities. A summary of all notable events mentioned is compiled."
          },
          {
            "name": "Legal Entities Extraction",
            "description": "The objective here is to locate any mention of legal documents, laws, treaties, court cases, or legal terms. It necessitates differentiating between legal references and general text. A list of legal entities cited in the text is produced."
          },
          {
            "name": "Artistic Entities Extraction",
            "description": "This subtask focuses on the identification of titles and names related to art, such as books, movies, paintings, and songs. It requires the differentiation of these from regular text. The end goal is to compile all artistic references."
          },
          {
            "name": "Medical Entities Extraction",
            "description": "Identifying medical terminology, disease names, medications, and treatments is the focus of this subtask. It demands a distinction between these terms and non-medical language. The result is a list of all medical entities mentioned."
          },
          {
            "name": "Technological Entities Extraction",
            "description": "This subtask involves identifying references to technology, including software, hardware, devices, and platforms. It differentiates technological entities from unrelated terms. A catalog of all technology-related entities is the outcome."
          },
          {
            "name": "Educational Entities Extraction",
            "description": "The goal of this subtask is to find mentions of educational entities, such as schools, universities, degrees, and educational theories. It separates educational references from other text content. The task results in a collection of educational entities."
          },
          {
            "name": "Scientific Entities Extraction",
            "description": "This subtask is dedicated to recognizing scientific terminology, theories, laws, and names of studies or experiments. It distinguishes scientific entities from generic content. A list of these scientific references is created."
          },
          {
            "name": "Sport Entities Extraction",
            "description": "The subtask has the objective of extracting names and terms related to sports, including names of athletes, teams, sporting events, and leagues. It involves distinguishing these from other types of entities in the text. The output is a comprehensive list of all sports-related entities."
          },
          {
            "name": "Person Entity Identification",
            "description": "This subtask involves pinpointing and extracting names of individuals within the text. It requires analyzing the text to accurately identify and label each instance where a person is mentioned. The goal is to create a list or database of all named individuals, which is useful for understanding relationships or networks within the text."
          },
          {
            "name": "Location Entity Extraction",
            "description": "This subtask focuses on recognizing and categorizing all geographic locations referenced in the text. It includes cities, countries, rivers, mountains, and other significant places. The objective is to compile a comprehensive directory of all location-based entities mentioned across the text."
          },
          {
            "name": "Organization Entity Identification",
            "description": "The purpose of this subtask is to find and classify references to named organizations, including companies, governments, and other entities. It is important to detect and distinguish organizations to provide insight into the text's social and economic context. The end product is an aggregated list of entities that represent institutional actors."
          },
          {
            "name": "Date and Time Entity Recognition",
            "description": "This subtask is concerned with identifying all mentions of dates, times, and durations within the text. It involves parsing the text for chronological information and normalizing these mentions to a standard format. This is key for establishing a timeline or understanding the sequence of events related to the text."
          },
          {
            "name": "Monetary Entity Detection",
            "description": "Focusing on financial references, this subtask involves isolating and tagging any mentions of currency, including amounts, transactions, and economic terms. It requires precision to ensure that all monetary information is captured accurately. The output is a structured overview of the economic aspects within the text."
          },
          {
            "name": "Statistical Entity Recognition",
            "description": "This subtask targets the extraction of statistical and numerical data presented in the text. It encompasses figures, percentages, and any form of quantitative data. By recognizing these entities, it is possible to synthesize complex information into useful statistics."
          },
          {
            "name": "Event Entity Identification",
            "description": "The aim is to detect and label events described in the text, which may include historical occurrences, meetings, or any significant happenings. This process involves discerning text passages that describe specific events and categorizing them accordingly. Collating this information helps to map out the key events relevant to the text's narrative."
          },
          {
            "name": "Product Entity Recognition",
            "description": "This subtask requires the identification of commercial products or services mentioned within the text. It involves distinguishing brand names, product types, and service categories. The result is an organized compilation of consumer goods and services, providing a commercial perspective to the text."
          },
          {
            "name": "Legislative Entity Extraction",
            "description": "The objective here is to identify and classify references to laws, bills, decrees, or any legislative documents. Careful reading is needed to pinpoint these legal entities, which can range from international treaties to local ordinances. This subtask facilitates the understanding of the legal framework or implications present in the text."
          },
          {
            "name": "Artistic Works Entity Recognition",
            "description": "This subtask includes the detection of references to artistic works such as books, movies, paintings, and songs within the text. It aims to catalog cultural products and contribute to an appreciation of the creative context. As a result, it provides an inventory of cultural entities that can be of interest to those studying the text's cultural references."
          },
          {
            "name": "Scientific Term Extraction",
            "description": "Focused on the realm of science, this subtask involves identifying and categorizing scientific terms and jargon. It requires the ability to distinguish complex concepts and terminologies unique to various scientific fields. The resulting data can be used to support research activities or to clarify scientific discourse in the text."
          },
          {
            "name": "Medical Entity Recognition",
            "description": "In this subtask, the aim is to locate and classify medical terminology and references, including names of diseases, treatments, and medications. This task is crucial for extracting relevant health and medical information from the text. The output can be especially valuable for health-related research and documentation."
          },
          {
            "name": "Technology Entity Extraction",
            "description": "This subtask entails identifying terms and concepts related to technology, including device names, software, and technological processes. It involves distinguishing technological entities to shed light on the text's engagement with technological advancements. This is particularly useful for texts focused on innovation or tech industry developments."
          },
          {
            "name": "Education Entity Recognition",
            "description": "The goal here is to extract entities related to educational systems, institutions, qualifications, and educational jargon. It requires a keen eye to discern relevant educational terms that contribute to the text’s context on learning or academia. This task is beneficial for academic research and educational analysis."
          },
          {
            "name": "Sports Entity Detection",
            "description": "This subtask is about identifying and cataloging sport-related entities, such as names of athletes, sports teams, tournaments, and sporting events. It is crucial for parsing sports-related content and contributes to an understanding of the sporting landscape referenced in the text. The outcome is a resourceful collection for fans and analysts of sports discourse."
          }
        ]
      },
      "Sentiment Analysis": {
        "descr": "Determining the emotional tone of the text, categorizing it as positive, negative, or neutral.",
        "subtasks": [
          {
            "name": "Polarity Identification",
            "description": "This subtask involves identifying the overall sentiment polarity of the text, without delving into the specifics of emotion or intensity. It aims to classify the text into broad categories such as positive, negative, or neutral. The result provides a quick and general sense of the emotional tone conveyed by the text."
          },
          {
            "name": "Emotion Detection",
            "description": "The aim of this subtask is to detect specific emotions, such as joy, anger, sadness, or surprise, that are expressed in the text. It goes beyond simple polarity to understand the nuances of emotional expression. Doing so can provide deeper insights into the text's emotional subtext and the author's intent."
          },
          {
            "name": "Intensity Scoring",
            "description": "This subtask quantifies the intensity or strength of the sentiments expressed in the text. It typically involves assigning a numerical score that reflects the degree of positive or negative feeling. This can be particularly useful for comparing sentiments across multiple texts or monitoring shifts in tone over time."
          },
          {
            "name": "Subjectivity/Objectivity Identification",
            "description": "Determining whether the text is subjective (expressing personal opinions or emotions) or objective (stating facts without bias) is the goal of this subtask. This helps in distinguishing between factual information and personal commentary. It's useful in various applications like news analysis and product reviews."
          },
          {
            "name": "Sentiment Trend Analysis",
            "description": "This subtask entails tracking the changes in sentiment over a series of texts or over time to identify trends. It can reveal how sentiments shift in response to events or within ongoing conversations. Such analyses are valuable for monitoring public opinion or brand sentiment evolution."
          },
          {
            "name": "Comparative Sentiment Analysis",
            "description": "This subtask involves comparing the sentiment of two or more texts to discern relative sentiment. It can highlight which of the compared entities is perceived more positively or negatively. This comparison is particularly relevant for competitive analysis in business scenarios."
          },
          {
            "name": "Sarcasm Detection",
            "description": "A specialized task focusing on identifying sarcasm, where the literal meaning is opposite to the intended sentiment. Sarcasm detection is challenging but essential for accurate sentiment analysis, as it changes the sentiment polarity. Accurate detection prevents misinterpretation of the text's true sentiment."
          },
          {
            "name": "Contextual Sentiment Analysis",
            "description": "This subtask requires understanding the context in which the sentiment is expressed to accurately assess its meaning. It considers the surrounding text, situational context, and cultural factors. Contextual analysis helps in handling ambiguous cases where sentiment might not be clear at first glance."
          },
          {
            "name": "Sentiment Lexicon Expansion",
            "description": "The objective here is to identify and add new sentiment-bearing words or phrases to an existing sentiment lexicon. This involves processing the text to discover novel expression of sentiments. It's a crucial step for updating sentiment analysis models to adapt to evolving language use."
          },
          {
            "name": "Multi-Lingual Sentiment Analysis",
            "description": "This subtask is the application of sentiment analysis to text in multiple languages. It helps in understanding the sentiment of text without language barriers. Multi-lingual sentiment analysis is particularly useful for global platforms and diverse datasets."
          },
          {
            "name": "Sentiment Association with Demographics",
            "description": "Analyzing sentiments in conjunction with demographic data, such as age, gender, or location, is the focus of this subtask. It enables the discovery of patterns and differences in sentiment across different demographic groups. This is beneficial for targeted marketing and opinion research."
          },
          {
            "name": "Irony Detection",
            "description": "This subtask targets the identification of irony, where the intended meaning differs from the literal meaning, often for humorous or emphatic effect. Irony detection is crucial for understanding the text's true sentiment. It enhances the sentiment analysis model's ability to handle complex linguistic nuances."
          },
          {
            "name": "Time-Series Sentiment Analysis",
            "description": "The goal of this subtask is to analyze sentiment over a time series to detect fluctuations and patterns. It can reveal how sentiment about a topic or entity changes over a set period. Time-series analysis is useful for tracking sentiment in response to events or measuring the impact of campaigns."
          },
          {
            "name": "Sentiment Analysis Model Evaluation",
            "description": "Assessing the performance of sentiment analysis models or algorithms is the purpose of this subtask. It involves comparing predicted sentiments with human-annotated sentiments to determine accuracy. Model evaluation is key for improving sentiment analysis techniques and ensuring reliable outcomes."
          },
          {
            "name": "Polarity Identification",
            "description": "This subtask involves determining the positive, negative, or neutral sentiment of each sentence within the text. It breaks down the text into sentence-level assessments to provide a more granular analysis of sentiment. The objective is to understand the sentiment flow throughout the text."
          },
          {
            "name": "Aspect-Based Sentiment Analysis",
            "description": "The goal here is to dissect the text and identify sentiments associated with specific aspects or features mentioned within it. It helps in understanding how different components or characteristics are perceived. This subtask is particularly useful for detailed product or service reviews."
          },
          {
            "name": "Sentiment Trend Over Time",
            "description": "For texts from sources like social media or continuous customer feedback, this subtask tracks how sentiments expressed about a topic change over time. It involves analyzing a sequence of texts chronologically. The objective is to spot patterns and trends in sentiment evolution."
          },
          {
            "name": "Emotion Detection",
            "description": "Beyond basic polarity, this task identifies specific emotions such as joy, anger, or sadness within the text. It requires a nuanced understanding of language to recognize subtle emotional cues. The goal is to provide a more complex emotional profile of the text."
          },
          {
            "name": "Subjectivity/Objectivity Analysis",
            "description": "This subtask differentiates between objective statements, which present factual information, and subjective statements, which express personal feelings, opinions, or beliefs. It is crucial for understanding the writer's intention and bias. The summary of subjectivity levels adds depth to the sentiment analysis."
          },
          {
            "name": "Intent Detection",
            "description": "This subtask focuses on identifying the intention behind the sentiments expressed, such as complaint, praise, or inquiry. It interprets underlying purposes within the text. This is particularly helpful for customer service automation and response planning."
          },
          {
            "name": "Sarcasm Detection",
            "description": "Sarcasm detection aims to recognize instances where the literal sentiment expressed is opposite to the intended sentiment. It tackles the challenge of implicit sentiment conveyed through irony or satire. This subtask is essential for accurate sentiment interpretation in complex texts."
          },
          {
            "name": "Comparative Sentiment Analysis",
            "description": "The objective here is to identify and compare sentiments expressed about different entities, products, or services within the same text. It enables the understanding of relative perceptions. This subtask can inform competitive analysis and market positioning."
          },
          {
            "name": "Sentiment Consistency Checking",
            "description": "This subtask evaluates the text for consistency in sentiment, identifying any discrepancies or contradictions in emotional tone. It assesses the overall cohesiveness of the sentiment expressed. This can be important for verifying the reliability of a source or message."
          },
          {
            "name": "Multilingual Sentiment Analysis",
            "description": "This task involves analyzing sentiment in texts written in various languages, possibly translating before analysis. It caters to a global audience, allowing sentiments to be understood across language barriers. The challenge is to maintain sentiment accuracy despite linguistic nuances."
          },
          {
            "name": "Sentiment Lexicon Expansion",
            "description": "The task here is to identify and add new sentiment-bearing words or phrases to the existing sentiment lexicon. It allows for the adaptation to evolving language use and slang. This is essential for keeping sentiment analysis tools up-to-date and accurately tuned to current expressions."
          },
          {
            "name": "Sentiment Visualization",
            "description": "This involves creating visual representations, such as graphs or heat maps, to display sentiment distributions within the text. It makes the data more accessible and facilitates pattern recognition. Visualization aids in interpreting complex sentiment data at a glance."
          },
          {
            "name": "Contextual Sentiment Analysis",
            "description": "This subtask acknowledges that sentiment can be highly context-dependent and aims to analyze sentiment within the situational context it appears. It requires taking into account the broader scenario or background information. Ensuring context is considered prevents misinterpretation of sentiments."
          },
          {
            "name": "Sentiment Correlation with External Factors",
            "description": "This subtask explores correlations between sentiments expressed in the text and external factors such as current events or market trends. It involves cross-referencing text sentiment with data from other sources. The goal is to uncover factors that could influence or explain sentiment patterns."
          },
          {
            "name": "User Demographic Sentiment Analysis",
            "description": "This task assesses how sentiments in the text vary according to different user demographics, such as age, gender, or location. It requires additional data about the text provider. This analysis can be invaluable for targeted marketing and product development strategies."
          }
        ]
      },
      "Theme Identification": {
        "descr": "Determining central themes or topics discussed in the text.",
        "subtasks": [
          {
            "name": "Explicit Theme Extraction",
            "description": "Identify and list the explicit themes directly stated or clearly evident in the text. This involves scanning the text for key phrases and statements that directly relate to the central subjects. The objective is to catalog themes that are openly presented by the author."
          },
          {
            "name": "Implicit Theme Exploration",
            "description": "Examine the text for underlying themes that are not directly stated but implied through context, symbolism, or character actions. This requires a deeper analysis of the text to interpret the subtler messages conveyed. The goal is to reveal themes that are suggested rather than straightforwardly discussed."
          },
          {
            "name": "Comparative Theme Analysis",
            "description": "Compare and contrast themes within the text or across different texts. This task involves identifying similarities and differences in how themes are presented and developed. It aims to provide insight into the various ways themes manifest and interact with each other."
          },
          {
            "name": "Character-Driven Theme Analysis",
            "description": "Analyze how the actions, development, and interactions of characters underscore the text's themes. This includes examining character arcs and relationships to understand their thematic significance. The aim is to elucidate how character dynamics inform the central themes."
          },
          {
            "name": "Setting as a Theme Indicator",
            "description": "Explore how the time and place settings of the text contribute to its thematic elements. This task involves detailing the ways in which the setting reflects or enhances the text's themes. It is intended to uncover the relationship between setting and theme."
          },
          {
            "name": "Historical Context Theme Analysis",
            "description": "Assess how the themes of the text relate to its historical context, including the time period it was written or the time period it represents. This requires knowledge of the relevant historical background to determine its influence on the themes. The goal is to reveal the interplay between the text and its historical framework."
          },
          {
            "name": "Cultural Influence on Themes",
            "description": "Evaluate the impact of cultural aspects, such as beliefs, values, and norms, on the thematic content of the text. This includes understanding how cultural context shapes the expression of themes. It aims to shed light on the cultural dimensions of theme development."
          },
          {
            "name": "Authorial Intent and Theme Exploration",
            "description": "Investigate the author's purpose and how it informs the themes present in the text. This involves an analysis of the author's background, previous works, and possible intentions. The goal is to link the author's motives to the thematic structure of the text."
          },
          {
            "name": "Genre-Based Theme Analysis",
            "description": "Determine the typical themes associated with the genre of the text and identify how the text aligns or deviates from these norms. This requires an understanding of genre conventions and how they influence thematic expression. The objective is to contextualize the text within its genre."
          },
          {
            "name": "Reader Response Theme Interpretation",
            "description": "Focus on how different readers might interpret the themes of the text based on their personal backgrounds and experiences. This subtask acknowledges that individual perspectives can vary widely, leading to diverse thematic interpretations. The aim is to address the subjective nature of theme identification."
          },
          {
            "name": "Narrative Perspective Theme Analysis",
            "description": "Analyze how the narrator's perspective influences the presentation of themes within the text. This includes examining the narrator's reliability, tone, and knowledge. It aims to understand the effect of narrative voice on the thematic elements."
          },
          {
            "name": "Linguistic Styling in Theme Conveyance",
            "description": "Examine the author's language choices and how they contribute to the development and conveyance of themes. This subtask looks at word choice, figurative language, and syntax to analyze their thematic significance. The goal is to decipher how language style affects theme interpretation."
          },
          {
            "name": "Conflict and Resolution Theme Analysis",
            "description": "Describe how the central conflicts and their resolutions in the text highlight its major themes. This entails identifying the main conflicts, character struggles, and how they are resolved, to understand their thematic importance. It seeks to underline the role of conflict in thematic development."
          },
          {
            "name": "Intertextual Theme Connections",
            "description": "Identify connections between the themes of the text and those in other works, exploring intertextuality. This involves recognizing allusions, parallels, and references that link the text's themes to broader literary conversations. The objective is to place the text's themes within a larger literary context."
          },
          {
            "name": "Direct Theme Identification",
            "description": "This subtask entails pinpointing the explicit themes directly stated or clearly presented in the text. The process involves scanning the text for overt mentions of subjects or ideas that the author discusses. The goal is to list themes that are unambiguously articulated within the content."
          },
          {
            "name": "Indirect Theme Identification",
            "description": "This subtask requires inferring latent themes that are implied rather than directly stated. It demands a deeper analysis of the narrative, symbolism, and character behavior to derive underlying messages. The aim is to reveal and articulate themes that may not be immediately evident on the surface level of the text."
          },
          {
            "name": "Comparative Theme Analysis",
            "description": "This subtask involves identifying themes and then comparing how they are treated or evolved throughout the text. It requires the examination of various passages to understand differences or similarities in the presentation of themes. The objective is to provide insight into the dynamic aspects or multiple perspectives of the themes in question."
          },
          {
            "name": "Cross-textual Theme Linking",
            "description": "This subtask includes identifying themes within the text and linking them to themes from other texts. It entails recognizing commonalities or contrasts with other works to place the text within a larger thematic context. The purpose is to create a broader understanding of the themes by establishing intertextual connections."
          },
          {
            "name": "Historical/Cultural Theme Contextualization",
            "description": "This subtask focuses on placing the themes identified in the text within historical or cultural contexts. It involves researching the time period or cultural background of the text to discern how these aspects influence the themes. The aim is to provide a summary of the themes with consideration to their societal or historical significance."
          },
          {
            "name": "Moral and Philosophical Theme Extraction",
            "description": "This subtask is concerned with identifying ethical, moral, or philosophical questions raised in the text. It requires examining the text's content for lessons, questions, or messages regarding human behavior and thought. The goal is to outline the moral or philosophical themes that prompt reflection or debate."
          },
          {
            "name": "Character-driven Theme Analysis",
            "description": "This subtask involves analyzing the text through the lens of character development to uncover themes. It necessitates a study of character arcs, motivations, and interactions to identify how they reveal or relate to the text's themes. The aim is to summarize how the characters embody or propel the central themes."
          },
          {
            "name": "Setting-based Theme Exploration",
            "description": "This subtask focuses on exploring how the setting of the text contributes to its themes. It requires examining the location, time, and environment in which the text is set to determine how these elements reinforce thematic elements. The objective is to elucidate the relationship between the setting and the text's overarching topics."
          },
          {
            "name": "Symbolic Theme Interpretation",
            "description": "This subtask is about interpreting symbols within the text to uncover associated themes. It involves identifying symbolic objects, events, or characters, and explaining how they relate to the larger themes. The goal is to articulate how symbolism contributes to deeper thematic understanding."
          },
          {
            "name": "Structural Theme Analysis",
            "description": "This subtask entails examining the structure of the text, such as its plot, narrative style, and pacing, to identify how they influence themes. It involves breaking down the text's form to understand how it shapes or is shaped by thematic content. The aim is to provide insights into the interplay between the text's structure and its central themes."
          },
          {
            "name": "Conflict-driven Theme Identification",
            "description": "This subtask involves identifying the central conflicts in the text and analyzing how these conflicts elucidate themes. It requires a close reading to determine how character, plot, or thematic conflicts reveal deeper messages. The objective is to connect the resolution or persistence of conflict to the text's thematic statements."
          },
          {
            "name": "Genre-based Theme Differentiation",
            "description": "This subtask requires distinguishing themes that are characteristic of the text's genre from unique thematic elements. It involves recognizing genre conventions to understand how the text aligns with or diverges from typical thematic patterns. The goal is to separate and highlight the text's unique themes in the context of its genre."
          },
          {
            "name": "Narrative Voice and Perspective Theme Analysis",
            "description": "This subtask involves analyzing the narrator's voice or character perspectives to identify their influence on themes. It requires an exploration of viewpoint, bias, and reliability to understand how perspective shapes thematic interpretation. The aim is to detail how the narrative voice affects the presentation of themes."
          },
          {
            "name": "Thematic Motif Recognition",
            "description": "This subtask is about identifying recurring motifs within the text and linking them to its themes. It involves recognizing and analyzing repeated elements or concepts to understand their thematic significance. The goal is to summarize how motifs support or enhance the text's central themes."
          },
          {
            "name": "Psychological Theme Analysis",
            "description": "This subtask focuses on uncovering psychological themes by analyzing characters’ mental states and behaviors. It requires delving into the psychological underpinnings of the text to understand characters' internal conflicts and motivations. The aim is to articulate themes pertaining to the human psyche and emotional experience."
          }
        ]
      },
      "Part-of-Speech Tagging": {
        "descr": "The process of identifying and labeling each word in a text with its corresponding part of speech, such as noun, verb, adjective, etc., based on both its definition and context within the sentence.",
        "subtasks": [
          {
            "name": "Noun Identification",
            "description": "This subtask entails identifying all the nouns within the text. It requires parsing each sentence to isolate every noun, whether proper, common, abstract, or collective. The goal is to produce a list or a tagged text highlighting only the noun elements."
          },
          {
            "name": "Verb Identification",
            "description": "This subtask involves pinpointing every verb within the text. The task demands an analysis of sentences to detect action words, states of being, and auxiliary verbs. The end product is a list or a tagged version of the text showcasing all the verbs."
          },
          {
            "name": "Adjective Identification",
            "description": "The purpose of this subtask is to locate and label all adjectives in the text. It necessitates scrutinizing sentence structure to highlight words that describe or modify nouns. The output is a compilation or a modified version of the text with adjectives clearly marked."
          },
          {
            "name": "Adverb Identification",
            "description": "This subtask concentrates on finding all adverbs within the text. It involves examining sentences to spot words that modify verbs, adjectives, or other adverbs. The result is a tagged text or collection where each adverb is clearly indicated."
          },
          {
            "name": "Pronoun Resolution",
            "description": "This subtask aims to resolve all pronouns to their antecedents or the terms they refer to in the text. It requires careful analysis to connect each pronoun to its correct noun, ensuring clarity. The task leads to a text where pronoun references are explicitly stated."
          },
          {
            "name": "Determiner Tagging",
            "description": "The objective of this subtask is to tag determiners, which are words that introduce nouns. It involves the identification of articles, possessive pronouns, and other determiners setting up noun phrases. The deliverable is a version of the text where all determiners are labeled."
          },
          {
            "name": "Preposition Recognition",
            "description": "This subtask is about identifying prepositions that connect nouns, pronouns, or phrases to other words within a sentence. It requires analysis of the text to find these relational words. The output is a text with all prepositions marked for their roles in indicating relationships."
          },
          {
            "name": "Conjunction Categorization",
            "description": "This subtask focuses on categorizing conjunctions within the text into coordinating, subordinating, or correlative. It entails examining sentence structure and context. The goal is a tagged text reflecting the function and type of each conjunction."
          },
          {
            "name": "Interjection Detection",
            "description": "This subtask is designed to spot interjections throughout the text. It searches for expressions of emotion or exclamations that are often grammatically independent. The result is a tagged text with all interjections clearly indicated."
          },
          {
            "name": "Modal Auxiliary Verb Tagging",
            "description": "The subtask aims to tag modal auxiliary verbs, which express necessity or possibility. It involves identifying words like 'can', 'will', 'must', and 'should' that modify the main verb for mood. The output is a text with modal auxiliaries distinctly tagged."
          },
          {
            "name": "Part-of-Speech Pattern Analysis",
            "description": "This subtask involves analyzing the text for common part-of-speech patterns, such as noun phrases or verb phrases. It requires the examination of word groupings to understand syntactic structures. The deliverable is an analysis report detailing these patterns."
          },
          {
            "name": "Grammatical Error Identification",
            "description": "The subtask entails identifying grammatical errors related to incorrect part-of-speech usage. It requires a thorough review to find and correct misused words based on their parts of speech. The outcome is a corrected text with identified errors."
          },
          {
            "name": "Frequency Distribution of Parts of Speech",
            "description": "This subtask computes the frequency distribution of each part of speech within the text. It involves counting how often each part of speech appears and presenting the data statistically. The end product is a statistical breakdown showing the prevalence of each part of speech."
          },
          {
            "name": "Semantic Role Labeling",
            "description": "The subtask is to assign labels to words or phrases in the text that indicate their semantic role in the sentences, such as agent, goal, or instrument. It requires a deep understanding of sentence meaning. The output is a text annotated with semantic roles tied to parts of speech."
          },
          {
            "name": "Part-of-Speech Homonym Clarification",
            "description": "This subtask focuses on clarifying homonyms by correctly tagging their part of speech based on context. It deals with words that are spelled the same but have different meanings and parts of speech. The objective is to provide an unambiguous, tagged text where homonyms are correctly interpreted."
          },
          {
            "name": "Noun Identification",
            "description": "This subtask requires identifying all nouns within the text. The focus is on recognizing and tagging every person, place, thing, or idea. It helps to understand the entities involved in the text and their relationships."
          },
          {
            "name": "Verb Identification",
            "description": "The goal of this subtask is to find and label all the verbs. It involves determining actions, states, or occurrences within the text. This is crucial for understanding the dynamics of the sentences."
          },
          {
            "name": "Adjective Identification",
            "description": "This subtask is about pinpointing and tagging descriptive words, adjectives, that modify nouns. It requires attention to detail to provide context about the size, quantity, age, color, shape, etc., of nouns."
          },
          {
            "name": "Adverb Identification",
            "description": "In this subtask, the objective is to locate and tag adverbs, which generally modify verbs, adjectives, or other adverbs. It involves looking for words that describe how, when, where, or to what extent an action is performed."
          },
          {
            "name": "Preposition Identification",
            "description": "The subtask involves recognizing and tagging prepositions that indicate the relationship between a noun (or pronoun) and other words in a sentence. It focuses on spatial, temporal, and other relational concepts within the text."
          },
          {
            "name": "Pronoun Resolution",
            "description": "This subtask targets the identification and tagging of pronouns, followed by linking each pronoun to its antecedent or the noun it replaces. It is key for maintaining coherence in understanding the text."
          },
          {
            "name": "Conjunction Identification",
            "description": "The aim here is to identify and tag conjunctions, the words that connect clauses, sentences, words, or phrases. This subtask helps to discern the structure and flow of complex sentences."
          },
          {
            "name": "Determiner Tagging",
            "description": "This subtask focuses on locating and labeling determiners, which precede and modify nouns. It's important for identifying noun phrases and their limits within the text."
          },
          {
            "name": "Interjection Identification",
            "description": "The subtask involves spotting and tagging interjections, which are words or phrases that express sudden emotion. It assists in capturing the emotional context of the text."
          },
          {
            "name": "Article Specification",
            "description": "This task requires identifying definite and indefinite articles within the text, tagging 'the', 'a', and 'an'. These words are crucial for specifying noun references."
          },
          {
            "name": "Numeral Tagging",
            "description": "The focus of this subtask is on identifying and tagging numerals, words that denote numbers. It is essential for understanding quantities, sequences, and statistics in the text."
          },
          {
            "name": "Possessive Identification",
            "description": "This subtask involves recognizing possessive forms of nouns and pronouns, tagging words that show ownership or belonging. It clarifies relationships between different entities within the text."
          },
          {
            "name": "Auxiliary Verb Tagging",
            "description": "The goal is to identify and tag auxiliary verbs that accompany main verbs to form verb phrases, indicating tense, mood, or voice. This is key for understanding the temporal and modal aspects of actions."
          },
          {
            "name": "Modal Verb Identification",
            "description": "This subtask targets the identification and tagging of modal verbs that express necessity or possibility. It is crucial for grasping the speaker’s attitude towards the action."
          },
          {
            "name": "Infinitive Marker Spotting",
            "description": "The subtask aims at locating and tagging the infinitive marker 'to' that precedes the base form of a verb. It aids in identifying infinitive verb phrases and their roles in sentences."
          }
        ]
      }
    },
    "Creative and Generative Tasks": {
      "descr": "This category is for tasks that require the generation of new content or ideas. It emphasizes creativity, originality, and the ability to construct meaningful or aesthetically pleasing outputs.",
      "Artistic Concept Generation": {
        "descr": "The creative process of coming up with concepts, themes, or inspiration for artistic endeavors, applicable to visual arts, music, writing, or other forms of artistic expression.",
        "subtasks": [
          {
            "name": "Historical Theme Exploration",
            "description": "This subtask requires researching and drawing inspiration from a specific historical period or event to inform the artistic concept. It involves an in-depth study of the chosen time period's aesthetics, values, and motifs. The outcome is to enrich the artistic concept with historical context and depth."
          },
          {
            "name": "Color Palette Development",
            "description": "For this subtask, the focus is on creating a harmonious color palette that fits the artistic concept's intended emotion or theme. It entails selecting colors and their relationships to evoke a desired response. The resulting color palette is intended to consistently guide the visual elements of the artwork."
          },
          {
            "name": "Genre Fusion",
            "description": "The task here is to blend elements from multiple artistic genres to create a unique and innovative concept. It requires identifying core attributes from each genre and combining them thoughtfully. The objective is to produce a concept that offers a fresh perspective while still acknowledging its roots."
          },
          {
            "name": "Cultural Inspiration",
            "description": "This subtask focuses on infusing the artistic concept with elements derived from specific cultures or traditions. It involves researching cultural artifacts, practices, and beliefs to authentically represent them within the concept. The aim is to celebrate and respect cultural diversity in the artistic creation."
          },
          {
            "name": "Music Genre Adaptation",
            "description": "In this subtask, the goal is to adapt or incorporate elements of a particular music genre into the artistic concept. It requires an understanding of the genre's characteristics and its emotional impact. The resultant adaptation should enhance the artistic concept's auditory experience."
          },
          {
            "name": "Sensory Experience Design",
            "description": "This subtask is about designing the concept to provide a multi-sensory experience. It involves considering not just visual elements but also textures, sounds, and possibly smells that contribute to the concept. The objective is to create a more immersive and engaging artistic experience."
          },
          {
            "name": "Dialogue and Feedback Iteration",
            "description": "The subtask here is to engage in dialogue with peers or the target audience to gain feedback on the artistic concept. It requires presenting preliminary ideas, actively listening to responses, and iterating on the concept. The goal is to refine and develop the concept collaboratively, ensuring it resonates with others."
          },
          {
            "name": "Visual Theme Inspiration",
            "description": "This subtask aims to provide inspiration for visual themes related to the artistic concept. It involves analyzing the primary task input for aesthetically compelling elements, which can be translated into visual art. The objective is to generate ideas that can guide artists in their creation of visual pieces."
          },
          {
            "name": "Musical Motif Development",
            "description": "The subtask involves developing motifs or sequences that could form the basis of a musical composition. It requires abstracting emotions, narratives or images from the text and translating them into musical ideas. The goal is to inspire composers to create music that resonates with the original artistic concept."
          },
          {
            "name": "Choreography Inspiration",
            "description": "Choreography inspiration involves generating dance movement ideas that encapsulate the artistic concept. It includes deriving the rhythm, style, and expression that could translate the concept into dance form. Choreographers can use this as a foundation for their performance pieces."
          },
          {
            "name": "Sensory Detail Extraction",
            "description": "This task is about extracting sensory details from the artistic concept that can be emphasized in the artwork. It focuses on identifying descriptions of sight, sound, touch, taste, and smell. Artists can use these details to create a multi-sensory experience in their work."
          },
          {
            "name": "Genre Identification",
            "description": "The subtask involves identifying the proper artistic genre or genres that align with the primary task output. It requires deciphering the text to match genres that best express the concept, such as surrealism, fantasy, or realism in visual arts. This can help artists to align their work with established genres."
          },
          {
            "name": "Symbolism and Metaphor Creation",
            "description": "This subtask aims to create symbols and metaphors from the artistic concept suitable for incorporation into various art forms. It involves identifying themes and messages from the text that can be represented symbolically. Artists can use these metaphors to add depth and layers of meaning to their work."
          },
          {
            "name": "Mood Board Compilation",
            "description": "Creating a mood board is a subtask that involves curating images, textures, and materials that resonate with the artistic concept. It serves as a visual reference that captures the essence of the concept. Designers and artists can use mood boards to maintain a consistent aesthetic in their projects."
          },
          {
            "name": "Title and Naming",
            "description": "This subtask involves generating titles or names that encapsulate the essence of the artistic concept. It requires condensing the overall idea into a few impactful words. Titles and names can be used for pieces of art, performances, or exhibitions."
          },
          {
            "name": "Cultural Context Integration",
            "description": "Integrating cultural context includes identifying and incorporating cultural elements relevant to the artistic concept. It requires understanding and selecting cultural symbols, traditions, or motifs that align with the concept. This can help in creating art that is culturally rich and resonant."
          },
          {
            "name": "Historical Era Adaptation",
            "description": "This subtask aims to adapt the artistic concept to a specific historical era for thematic depth. It involves researching and applying aesthetic and thematic elements from the chosen period. Artists can then create works that echo or contrast with the identified historical context."
          },
          {
            "name": "Material and Medium Selection",
            "description": "The selection of materials and mediums is crucial in expressing the artistic concept. This subtask involves choosing the appropriate mediums (e.g., oils, watercolors, digital, sculpture) and materials that best convey the intended ideas and emotions. The selection can profoundly affect the message and reception of the art piece."
          },
          {
            "name": "Target Audience Definition",
            "description": "Defining the target audience is a subtask that tailors the artistic concept to the preferences and expectations of a specific group. It requires analyzing demographics, interests, and cultural factors to identify the ideal audience. Artists can then refine their work to appeal more directly to this group."
          }
        ]
      },
      "Code Writing": {
        "descr": "The task of creating software code, involving writing scripts or programs in various programming languages, focusing on aspects like functionality, efficiency, and readability.",
        "subtasks": [
          {
            "name": "Function Implementation",
            "description": "This subtask involves writing a specific function to perform a defined operation or to solve a particular problem stated in the text. It requires understanding the requirements, designing the logic, and coding the function. The aim is to deliver a self-contained piece of code that can be integrated into a larger system."
          },
          {
            "name": "Code Optimization",
            "description": "The focus of this subtask is to refine existing code to improve efficiency and performance. It involves analyzing the code for bottlenecks, implementing better algorithms, and reducing complexity. The goal is to enhance the speed and resource management of the code without altering its functionality."
          },
          {
            "name": "Error Debugging",
            "description": "Error debugging is about identifying and fixing bugs or errors in the given code. This subtask requires a thorough examination of the code to pinpoint inaccuracies and apply corrective measures. The objective is to ensure the program runs smoothly and correctly."
          },
          {
            "name": "Code Documentation",
            "description": "This subtask consists of creating comprehensive documentation for the given code. It includes writing comments, explanations, and usage guidelines to help future developers understand and maintain the code. The purpose is to provide clarity and facilitate collaboration."
          },
          {
            "name": "Unit Testing",
            "description": "Unit testing is the process of writing tests for individual units or components of the code to verify that each part functions correctly. This subtask is crucial for validating code behavior and preventing future regressions. The goal is to create a suite of tests that cover various use cases and edge cases."
          },
          {
            "name": "Feature Extension",
            "description": "This subtask involves extending the code to include additional features or capabilities as described in the text. It requires building upon the existing codebase to implement new functions and integrate them seamlessly. The objective is to enhance the software while preserving existing functionality."
          },
          {
            "name": "Code Refactoring",
            "description": "Code refactoring is the process of restructuring existing code without changing its external behavior. The subtask aims to clean up the codebase, improving readability and maintainability. This is a proactive step to keep the codebase healthy and scalable."
          },
          {
            "name": "Code Translation",
            "description": "This subtask involves translating the code from one programming language to another. It requires a deep understanding of both source and target languages as well as their respective idioms and patterns. The objective is to recreate the software's functionality in a different coding language."
          },

          {
            "name": "Dependency Management",
            "description": "Dependency management is the subtask of handling the software's external libraries and modules that it relies on. It entails keeping track of versions, updating libraries, and ensuring compatibility. The goal is to maintain a stable and up-to-date codebase while minimizing dependency-related issues."
          },
          {
            "name": "User Interface Development",
            "description": "This subtask involves creating and implementing the graphical elements that users interact with in software. It requires designing the layout, defining user interactions, and ensuring the interface is intuitive and accessible. The outcome should be a user-friendly and aesthetically pleasing interface that complements the underlying code."
          },
          {
            "name": "Security Enhancement",
            "description": "Improving the security aspects of code is an essential subtask that aims to protect data and prevent vulnerabilities. It involves the implementation of encryption, authentication, and secure coding practices. The goal is to create robust software that resists unauthorized access and attacks."
          },
          {
            "name": "Performance Testing",
            "description": "Performance testing is the process of determining the speed, responsiveness, and stability of a program under a particular workload. It is crucial for verifying that the software meets the performance criteria and can handle anticipated loads. This subtask helps identify any performance issues that need addressing."
          },
          {
            "name": "Dependency Management",
            "description": "This subtask encompasses managing libraries and packages that the software depends on for its functionality. It involves ensuring compatibility, updating to recent versions, and resolving any conflicts between dependencies. Proper dependency management is key to a stable and up-to-date codebase."
          },
          {
            "name": "Code Compilation",
            "description": "Code compilation is the process of transforming code written in a high-level programming language into executable machine code. This subtask involves using a compiler to check for syntax errors, optimize the code, and generate the executable. The resulting program is then ready for deployment or testing."
          },
          {
            "name": "Version Control",
            "description": "Version control is the practice of tracking and managing changes to software code. This subtask includes committing changes, merging code branches, and maintaining the history of the codebase. Effective version control is fundamental for collaborative coding environments and managing the evolution of the software over time."
          }
        ]
      },
      "Creative Writing and Composition": {
        "descr": "The process of generating original artistic content, such as poems, stories, or narratives, emphasizing creativity, narrative structure, and expressive use of language.",
        "subtasks": [
          {
            "name": "Character Development",
            "description": "This subtask aims to elaborate and enhance individual character profiles within a text. It involves crafting detailed backstories, personalities, and motivations to create more nuanced and compelling characters. The objective is to deepen readers' understanding and connection to the characters in the creative work."
          },
          {
            "name": "Setting Expansion",
            "description": "The focus here is to enrich the setting where the narrative unfolds. It requires detailing the environment, historical period, or cultural context to better immerse the reader. The goal is to provide a vivid and well-established backdrop for the story."
          },
          {
            "name": "Plot Structuring",
            "description": "This subtask deals with organizing the series of events that make up the narrative. It involves outlining a clear beginning, development, climax, and resolution to ensure a coherent and engaging storyline. The purpose is to create a satisfying narrative arc that captivates the audience."
          },
          {
            "name": "Dialogue Refinement",
            "description": "Enhancing the quality of conversations between characters is the main goal of this subtask. It includes making dialogue more realistic, expressive, and tailored to each character’s voice. The aim is to make interactions more dynamic and contribute to character and plot development."
          },
          {
            "name": "Theme Exploration",
            "description": "This subtask is dedicated to identifying and exploring the overarching themes of the creative text. It demands a thoughtful investigation of the main ideas and messages the author wishes to convey. The intention is to make these themes more pronounced and meaningful within the narrative."
          },
          {
            "name": "Conflict Creation",
            "description": "In this subtask, the focus is on developing and introducing conflicts to drive the narrative forward. This includes internal character conflicts or external conflicts with other characters or the environment. The objective is to build tension and interest, which is crucial for an engaging story."
          },

          {
            "name": "Emotional Layering",
            "description": "This subtask works on adding depth to the emotional experiences conveyed in the text. It requires careful crafting of scenes and dialogue to evoke a range of emotions. The objective is to connect deeply with the reader and to add richness to the characters’ journeys."
          },
          {
            "name": "Motif Reinforcement",
            "description": "Reinforcement of motifs entails repeatedly weaving a significant element through the narrative for symbolic purpose. This subtask requires identifying and consistently incorporating this element to contribute to the theme or mood. The goal is to create a pattern that adds significance to the narrative."
          },
          {
            "name": "Backstory Weaving",
            "description": "This subtask involves creating and integrating characters’ histories into the main narrative. It requires revealing past events that shape characters’ personalities and motives. The aim is to provide context and deepen the reader's understanding of character decisions and actions."
          },
          {
            "name": "Metaphorical Language Crafting",
            "description": "This subtask focuses on enhancing the text with metaphoric language. It includes creating analogies, metaphors, and similes that enrich the narrative and elucidate concepts. The intent is to reveal deeper insights through figurative and imaginative language."
          },
          {
            "name": "Character Development",
            "description": "This subtask involves creating detailed backgrounds, personalities, and growth arcs for characters within a creative text. It necessitates the author to imagine and describe complex characters that readers can connect with and understand. The objective is to foster relatable and dynamic characters that enhance the narrative."
          },
          {
            "name": "Setting Establishment",
            "description": "This subtask requires the author to craft vivid, immersive environments in which the narrative unfolds. The setting should be described in such a way that it complements and enriches the story. The goal is to create a believable, richly detailed world that captivates the reader's senses."
          },
          {
            "name": "Plot Structuring",
            "description": "The task is to outline and develop a coherent sequence of events that form the story's backbone. It involves careful planning of the narrative's beginning, middle, and end to ensure a logical and engaging progression. The purpose is to provide a satisfying narrative structure that keeps readers invested."
          },
          {
            "name": "Dialogue Crafting",
            "description": "This subtask is about writing authentic and purposeful exchanges between characters that reveal their personalities and advance the plot. The dialogue should be distinctive to each character and drive the story forward. The aim is to create conversations that feel natural and contribute to character and plot development."
          },
          {
            "name": "Conflict Creation",
            "description": "The objective here is to introduce challenges, obstacles, or antagonists that the protagonist must confront. Effective conflict generates tension and propels the narrative forward. The goal is to create stakes that are high enough to maintain reader interest and fuel the progression of the story."
          },
          {
            "name": "Theme Exploration",
            "description": "This involves weaving underlying themes into the narrative that offer deeper meaning or commentary. The writer should subtly integrate themes through symbols, motifs, or character experiences. The aim is to enrich the story with layers of significance that resonate with readers."
          },
          {
            "name": "Perspective and Point of View",
            "description": "The task is to choose and consistently use a narrative perspective that best suits the story, whether it be first person, third person, or omniscient. This subtask influences how the reader experiences the story and relates to the characters. The goal is to select a viewpoint that enhances storytelling and reader engagement."
          },
          {
            "name": "Tone and Mood",
            "description": "This subtask requires the author to set the tone and mood of the story, affecting how readers feel as they read. It involves the careful selection of words, pacing, and imagery to evoke specific emotions. The objective is to create an atmosphere that complements and intensifies the reader's experience of the narrative."
          },
          {
            "name": "Pacing Control",
            "description": "The author needs to regulate the rhythm at which the story unfolds, balancing action with exposition. Effective pacing maintains reader interest and ensures that the story neither rushes nor drags. The goal is to deliver a narrative that moves at an appropriate speed, keeping readers engaged from start to finish."
          },
          {
            "name": "Symbolism and Metaphor",
            "description": "This subtask involves using symbols and metaphors to imbue the narrative with a deeper level of meaning. Such literary devices should enrich the text and invite readers to explore beyond the literal. The objective is to craft a layered narrative that rewards insight and reflection."
          },
          {
            "name": "Consistency Maintenance",
            "description": "The writer must ensure that the story's internal logic, character behaviors, and world-building elements remain consistent throughout the text. Inconsistencies can distract or confuse the reader. The aim is to create a cohesive and believable narrative that sustains suspension of disbelief."
          },
          {
            "name": "Revision and Editing",
            "description": "This subtask is the process of reviewing and refining the written text to enhance its clarity, coherence, and style. It may involve rephrasing, cutting unnecessary parts, or making other adjustments for improvement. The goal is to polish the narrative until it is seamless and effectively conveys the author's artistic vision."
          },
          {
            "name": "Genre Integration",
            "description": "This involves identifying and incorporating elements that are characteristic of the chosen genre, whether it's romance, horror, fantasy, or another category. These elements guide reader expectations and narrative style. The objective is to fulfill and, where possible, innovate upon genre conventions."
          },
          {
            "name": "Audience Engagement",
            "description": "The task is to write in a way that captivates the intended audience, considering their interests, age group, and preferences. It involves using relatable characters, compelling storytelling, and appropriate language. The goal is to create a narrative that resonates with and retains the attention of the target readership."
          },
          {
            "name": "Literary Device Usage",
            "description": "This subtask requires skillful employment of literary devices such as foreshadowing, irony, and alliteration to enhance the text. These tools can add depth, emphasis, and artistry to the narrative. The purpose is to utilize these devices to enrich the storytelling without overwhelming the reader."
          }
        ]
      },
      "Textual Adaptation and Transformation": {
        "descr": "Involves modifying existing texts to create new versions, such as developing alternative endings for stories, converting texts into different genres, or reimagining narratives from new perspectives.",
        "subtasks": [
          {
            "name": "Alternative Endings Creation",
            "description": "This subtask requires the writer to reimagine the conclusion of a story, creating one or more alternative endings. It involves a creative understanding of the narrative's tone, characters, and plot to ensure coherence with the original storyline. The aim is to provide readers with different possible outcomes that are engaging and thought-provoking."
          },
          {
            "name": "Genre Transformation",
            "description": "The goal of this subtask is to convert the text into a different literary or writing genre. This involves identifying the core elements of both the original and target genres, and effectively adapting the text's style, tone, and content. The result should be a coherent piece that stays true to the essence of the original while fitting into the new genre."
          },
          {
            "name": "Narrative Perspective Shift",
            "description": "This subtask requires rewriting the text from a different narrative point of view. It could involve changing from first-person to third-person perspective, or vice versa, or adopting the viewpoint of a different character. The challenge lies in staying true to the original text's events while altering the lens through which the story is told."
          },
          {
            "name": "Time Period Conversion",
            "description": "This subtask involves transporting the narrative to a different time period, while maintaining the original's core themes and story arc. It requires adjusting cultural and historical references, dialogue, and setting details to fit the selected era. The reimagined text should resonate with the ambiance of the new time period, offering a fresh take on the original material."
          },
          {
            "name": "Cultural Contextualization",
            "description": "The objective of this subtask is to adapt the text to reflect a different cultural setting. It requires a nuanced understanding of both the source and target cultures, and careful modification of language, customs, and contexts. The aim is to create a version of the text that preserves its original message while making it relatable to a new cultural audience."
          },
          {
            "name": "Modernization",
            "description": "The aim here is to update the text with contemporary language, expressions, and contexts. This subtask requires a delicate balance of preserving the original's tone and substance while making it more accessible and engaging for today's audience. The modernized version should feel fresh and relevant while honoring the source material."
          },
          {
            "name": "Simplification",
            "description": "This subtask is about rewriting the text in a simpler language for ease of understanding. It is particularly useful for audiences with different levels of language proficiency or for educational purposes. The simplified text should convey the same information and narrative as the original, but in a more accessible manner."
          },

          {
            "name": "Poetic Translation",
            "description": "This creative subtask involves transforming prose into poetry, distilling the essence of the text into verse form. It necessitates not only a grasp of poetic techniques but also the ability to capture the original's emotive power and thematic resonance in a more condensed, rhythmic format. The resulting poem should evoke the spirit of the original text through the beauty and brevity of poetry."
          },
          {
            "name": "Educational Adaption",
            "description": "This subtask targets the transformation of the text to serve educational purposes, such as creating study guides, lesson plans, or adaptations for young readers. It involves tailoring the content to fit pedagogical objectives, ensuring that the adaptation is both informative and age-appropriate. The end product should facilitate learning while keeping the text engaging."
          },
          {
            "name": "Interactive Adaptation",
            "description": "The subtask of interactive adaptation entails reworking the text into an interactive format, such as a choose-your-own-adventure book or an interactive digital narrative. It requires branching story lines and multiple decision points, providing the audience with agency over the narrative's direction. The interactive version should offer a dynamic and participatory experience while remaining faithful to the original's core story."
          },
          {
            "name": "Genre Conversion",
            "description": "This subtask entails transforming the text into a different genre, for instance, converting a news article into a poem or a diary entry into a screenplay. It requires a deep understanding of genre conventions and the ability to creatively adapt the content to fit those norms. The objective is to present the original text in a new form while retaining its core messages and content."
          },
          {
            "name": "Narrative Perspective Shift",
            "description": "The goal here is to rewrite the text from a different narrative point of view, such as changing from first-person to third-person or vice versa. It involves reimagining the narrative structure to suit the new perspective while maintaining the original storyline and character dynamics. This subtask can offer a fresh look at familiar events by showing them through the eyes of a different narrator."
          },
          {
            "name": "Text Simplification",
            "description": "This subtask aims to simplify complex texts, making them accessible to audiences with varying levels of language proficiency. It includes breaking down difficult language, simplifying concepts, and using more straightforward sentence structures. The end result should be a text that conveys the same information as the original but is easier to understand."
          },
          {
            "name": "Text Modernization",
            "description": "The subtask involves updating the language and content of a text to make it relevant to contemporary audiences. This might include altering dated references, slang, or cultural allusions. The challenge is to modernize the text without losing the essence of the original message."
          },
          {
            "name": "Alternative Ending Creation",
            "description": "This task focuses on crafting a new conclusion for a narrative, diverging from the original ending. It requires creativity and an understanding of the story's elements to construct a satisfying and plausible alternative outcome. The new ending should feel consistent with the rest of the narrative yet offer a distinct departure from the original plot."
          },
          {
            "name": "Text Abridgment",
            "description": "Text abridgment consists of shortening the original text by omitting less significant parts while retaining the main storyline or argument. It's a process of condensing the content to make it more concise and to the point. The abridged version should still function coherently and maintain the integrity of the text."
          },
          {
            "name": "Localization",
            "description": "Localization involves adapting the text to suit a specific cultural or geographic audience, beyond mere translation. It includes adjusting cultural references, units of measure, idioms, and other region-specific elements. The goal is to make the text resonate with the target audience as though it were originally written for them."
          },
          {
            "name": "Text Paraphrasing",
            "description": "Paraphrasing is about rewriting the text in different words, aiming for a version that is unmistakably distinct in expression but identical in meaning. It calls for a thorough comprehension of the original content and dexterous language skills. This subtask is useful for clarifying the text or avoiding plagiarism."
          },
          {
            "name": "Dramatization",
            "description": "Turning a non-dramatic text into a script suitable for performance falls under this subtask. It involves creating dialogues, stage directions, and possibly scenes while keeping the original narrative or message intact. The task is to make the text engaging and performable for a live audience or readership."
          },
          {
            "name": "Language Style Formalization",
            "description": "This subtask requires altering the text to fit a more formal register, suitable for professional or academic settings. It includes refining colloquial language, improving sentence structure, and ensuring that the tone is appropriately elevated. The formalized text should convey the same information with an increased level of sophistication and politeness."
          },
          {
            "name": "Interactive Adaptation",
            "description": "Interactive adaptation is about converting the text into an interactive format, such as a choose-your-own-adventure story or an interactive online article. The subtask requires creating decision points and branching narratives or interactions. The end product should engage the audience in a direct and participatory manner."
          },
          {
            "name": "Poetic Restructuring",
            "description": "The task here is to reshape the text into a poem, focusing on rhythm, meter, rhyme, or free verse poetic structures. It emphasizes the expressive and aesthetic qualities of language, potentially distilling the original message into a more evocative and artistic form. The resulting poem should encapsulate the essence of the original text."
          },
          {
            "name": "Adaptation for Children",
            "description": "The subtask involves altering a text to make it suitable for a young audience. This includes simplifying vocabulary, adding educational elements, and ensuring that themes and content are age-appropriate. The adapted text should be engaging for children while educating or entertaining them in line with the purpose of the original text."
          },
          {
            "name": "Text Expansion",
            "description": "Text expansion is the process of elaborating on the content of the original text, adding more detail and context. It requires a deeper dive into the subject matter to enhance the richness of the narrative or exposition. The objective is to provide a more comprehensive understanding of the topics covered in the original text."
          },
          {
            "name": "Cross-cultural Adaptation",
            "description": "This subtask involves modifying the text so that it accurately portrays or appeals to a different cultural context than the one it was originally written for. It requires careful consideration of cultural norms, values, and taboos, as well as a sensitive approach to translation and adaptation. The objective is a text that maintains its original intent and meaning while being fully accessible to a new audience."
          }
        ]
      },
      "Assisting with Emails": {
        "descr": "The skill of drafting and structuring emails for business or professional communication, focusing on clarity, tone, and appropriateness to the context and audience.",
        "subtasks": [
          {
            "name": "Email Reply Generation",
            "description": "This subtask involves generating a relevant and coherent response to an incoming email. It includes comprehending the original message's request or information and responding appropriately while maintaining the context and tone. The goal is to reply in a manner that is both informative and prompt, ensuring clear communication."
          },
          {
            "name": "Action Item Extraction",
            "description": "This task is about identifying and listing specific tasks or follow-up actions required by the email. It involves filtering the text to pinpoint duties, deadlines, or requests for response. The result is a clear list of actionable items that need attention."
          },
          {
            "name": "Clarification Request",
            "description": "When an email contains ambiguous or unclear information, this subtask is to craft a polite request for clarification. This involves pinpointing the unclear aspects and formulating questions that can elicit more precise information. The objective is to enhance understanding and avoid miscommunication."
          },
          {
            "name": "Greeting and Closing Customization",
            "description": "Personalizing the opening and closing of an email to match the recipient and context is crucial. This task involves choosing an appropriate salutation and sign-off that reflect the email's formality level and the relationship with the recipient. The aim is to establish a tone that fosters good relations and respect."
          },
          {
            "name": "Tone Analysis",
            "description": "Analyzing the tone of an email to ensure it matches the intended sentiment and professionalism required by the context. This task includes examining the language and style used, making adjustments to convey the correct emotional tone. The aim is to maintain the appropriateness of communication for the given audience."
          },
          {
            "name": "Sensitive Content Filter",
            "description": "This subtask is crucial in detecting and addressing sensitive or inappropriate content within an email. It involves scanning the text for potentially offensive or confidential information and suggesting edits or removals as necessary. The aim is to uphold professionalism and adhere to privacy and ethical standards."
          },
          {
            "name": "Follow-up Reminder",
            "description": "Creating reminders for future follow-up on important emails is the focus of this subtask. It encompasses setting up alerts or notes to revisit the conversation at a later time. The aim is to ensure that no crucial communication or required action falls through the cracks."
          },

          {
            "name": "Email Drafting",
            "description": "This subtask involves composing an entirely new email based on the given context, instructions, or topics provided. The process includes structuring the email with a clear introduction, body, and conclusion. The objective is to create a well-crafted email that effectively communicates the intended message."
          },
          {
            "name": "Email Editing",
            "description": "The aim of this subtask is to refine an existing email draft by enhancing its clarity, grammar, and style. It requires reviewing the email content critically, correcting any errors, and ensuring the message is concise and to the point. The objective is to polish the email to a high standard of professionalism."
          },
          {
            "name": "Tone Adjustment",
            "description": "This subtask focuses on adjusting the tone of the email to suit the intended audience or purpose, be it formal, informal, persuasive, or apologetic. It involves analyzing the current tone and making necessary adjustments. The goal is to align the email's tone with the sender’s objectives and the recipient's expectations."
          },
          {
            "name": "Email Summarization",
            "description": "The task here is to create a brief summary of an email's content, preserving the main points and purpose of the original message. This involves identifying the primary information and intentions. The intended outcome is a concise representation of the email's key content."
          },
          {
            "name": "Response Generation",
            "description": "This subtask requires generating a reply to an email received. It includes understanding the initial email's content, context, and tone, and replying appropriately. The goal is to provide a response that is both relevant and timely, maintaining the flow of communication."
          },
          {
            "name": "Email Classification",
            "description": "The subtask consists of categorizing emails into predefined groups such as 'urgent', 'important', 'query', or others based on content, purpose, or sender. It involves analyzing the content to determine the appropriate category. This facilitates better email management and prioritization."
          },
          {
            "name": "Email Translation",
            "description": "This subtask includes translating an email's content from one language to another without losing the original message's nuances and context. It requires proficiency in both the source and target languages. The goal is to produce a clear and accurate translation suitable for the intended audience."
          },
          {
            "name": "Follow-Up Email Creation",
            "description": "The task involves creating an email meant to follow up on a previous conversation, meeting, or email exchange. It includes recapping prior discussions and prompting for further engagement or action. The aim is to continue the dialogue and encourage a response or update."
          },
          {
            "name": "Email Template Development",
            "description": "This subtask focuses on building templates for common email types, such as inquiries, confirmations, or updates. It requires drafting versatile templates that can be easily customized. The objective is to streamline email communication for frequent and repetitive subjects."
          },
          {
            "name": "Attachment Management",
            "description": "This involves managing files attached to emails, including ensuring the correct documents are attached and that they are accessible and properly formatted. It requires checking for relevance and completeness of attachments. The goal is to ensure that the attachments support the email content effectively."
          },
          {
            "name": "Signature Creation",
            "description": "The task here is to design an email signature that conveys the sender's professional information, such as name, title, and contact details. It includes creating a format that is professional and consistent across communications. The goal is to leave the recipients with the sender's pertinent information and a lasting impression."
          },
          {
            "name": "Email Scheduling",
            "description": "This subtask involves planning the timing of email deliveries to ensure they reach the recipient at the most appropriate or effective time. It takes into consideration time zones, work schedules, and urgency. The objective is to maximize the impact and promptness of the email communication."
          },
          {
            "name": "Action Item Extraction",
            "description": "The goal of this subtask is to identify and list actionable items from the email content, such as tasks to complete, deadlines to meet, or meetings to schedule. It requires discerning which parts of the email require a response or follow-up. This helps in organizing work and ensuring that nothing is overlooked."
          },
          {
            "name": "Contact Information Extraction",
            "description": "The subtask focuses on extracting contact information like phone numbers, addresses, or email addresses from the email content. It involves identifying relevant information that may be necessary for future communication. This information can then be organized into a contact management system."
          },
          {
            "name": "Priority Setting",
            "description": "This involves evaluating and setting the priority level of incoming emails based on the content, sender, or urgency indicators within the email. It requires quick assessment skills to categorize emails and determine the order in which they should be addressed. The goal is to improve efficiency and response times to critical communications."
          }
        ]
      },
      "Culinary Assistance and Guidance": {
        "descr": "Providing support and advice in cooking processes, including recipe selection, ingredient substitution, cooking techniques, and presentation tips.",
        "subtasks": [
          {
            "name": "Recipe Recommendation",
            "description": "This subtask involves suggesting recipes based on specific criteria such as available ingredients, dietary restrictions, or desired cuisine. It requires understanding the user's needs and preferences to provide suitable cooking options. The objective is to offer tailored recipes that align with the user’s requirements and tastes."
          },
          {
            "name": "Ingredient Substitution",
            "description": "This subtask provides alternatives for ingredients that a user might need to replace due to allergies, dietary preferences, or unavailability. It entails identifying suitable substitutes that maintain the dish's integrity. The goal is to ensure that the cooking process can continue smoothly with minimal impact on the final result."
          },
          {
            "name": "Cooking Technique Explanation",
            "description": "This subtask is focused on clarifying the steps and methods involved in a particular cooking technique. It requires breaking down complex processes into simple, understandable instructions. The aim is to enhance the user's culinary skills and confidence in executing various cooking methods."
          },
          {
            "name": "Nutritional Information Analysis",
            "description": "This subtask requires analyzing the nutritional content of recipes or ingredients. It provides insights into calories, macronutrients, and micronutrients. The goal is to inform the user about the nutritional value of their meals, aiding in healthy eating decisions."
          },
          {
            "name": "Cooking Time Estimation",
            "description": "This subtask estimates the total time required to prepare and cook a recipe. It considers factors such as prep work, cooking methods, and ingredient quantity. The purpose is to help users manage their time effectively when planning to cook."
          },
          {
            "name": "Meal Planning Assistance",
            "description": "This subtask involves curating a series of recipes to create a balanced meal plan for a specified duration. It requires consideration of variety, nutritional balance, and user preferences. The objective is to simplify the process of deciding what to cook by providing a structured plan."
          },
          {
            "name": "Food Safety Guidelines",
            "description": "This subtask provides information on proper food handling, storage, and cooking temperatures to prevent foodborne illnesses. It educates users on best practices to ensure safety in the kitchen. The goal is to promote hygienic cooking habits and safe consumption."
          },
          {
            "name": "Culinary Terminology Clarification",
            "description": "This subtask involves explaining culinary terms and jargon that a user may encounter in recipes or cooking shows. It demystifies complex language to aid comprehension. The objective is to enhance the user’s culinary literacy and understanding of cooking instructions."
          },
          {
            "name": "Utensil and Equipment Recommendation",
            "description": "This subtask involves suggesting the appropriate kitchen tools and equipment necessary to prepare a given recipe. It informs users about the utility and proper use of different utensils. The objective is to optimize the cooking process with the recommended tools for best results."
          },
          {
            "name": "Leftover Transformation",
            "description": "This subtask offers creative ideas for repurposing leftovers into new and appealing dishes. It encourages waste reduction and resourcefulness in the kitchen. The goal is to extend the life of meals and provide innovative ways to enjoy them again."
          },
          {
            "name": "Food Pairing Suggestions",
            "description": "This subtask proposes complementary food and drink pairings to enhance the dining experience. It takes into account flavors, textures, and the nature of the main dish. The objective is to create a cohesive and enjoyable meal from appetizer to dessert."
          },
          {
            "name": "Presentation and Plating Techniques",
            "description": "This subtask advises on the visual arrangement of food on a plate to enhance its appeal. It involves tips for garnishing, color contrast, and layout that elevate the aesthetics of a dish. The objective is to improve the overall dining experience through attractive presentation."
          },
          {
            "name": "Recipe Selection",
            "description": "This subtask aids users in choosing a recipe that suits their preferences, dietary restrictions, or available ingredients. It includes analyzing the user's requirements and suggesting recipes that closely match their criteria. The goal is to provide a tailored list of recipes for the user to consider and select from."
          },
          {
            "name": "Ingredient Substitution",
            "description": "This subtask assists users in finding alternatives for ingredients they may be missing or need to avoid due to allergies or dietary restrictions. It requires knowledge of suitable substitutes that maintain the integrity of the dish. The objective is to help users adapt recipes to their specific needs without compromising on taste or texture."
          },
          {
            "name": "Cooking Technique Clarification",
            "description": "The subtask involves explaining various cooking methods and techniques to the user in a clear and understandable way. It encompasses providing step-by-step instructions, tips for success, and potential pitfalls to avoid. The aim is to ensure users can execute cooking techniques with confidence and achieve the best possible results."
          },
          {
            "name": "Portion Adjustment",
            "description": "In this subtask, users are guided on how to adjust the quantity of ingredients in a recipe to suit a different number of servings. It includes calculations to increase or decrease ingredient amounts while maintaining the recipe's balance. The goal is to enable users to accurately scale recipes to meet their specific serving needs."
          },
          {
            "name": "Nutritional Information Provision",
            "description": "This subtask provides users with detailed nutritional information for recipes or individual ingredients. It involves calculating or retrieving data such as calorie count, macronutrients, and micronutrients. The aim is to support users in making informed dietary choices."
          },
          {
            "name": "Cooking Timer Setting",
            "description": "The subtask helps users determine the correct cooking times for various dishes and ingredients. It includes setting reminders or timers to alert users when to take action during the cooking process. The objective is to prevent overcooking or undercooking and ensure perfectly timed dishes."
          },
          {
            "name": "Meal Planning",
            "description": "This subtask aids in creating a comprehensive meal plan based on user preferences, nutritional goals, or ingredient availability. It includes organizing recipes and meals for specific times or days. The goal is to simplify the user's grocery shopping and cooking schedule."
          },
          {
            "name": "Flavor Pairing Suggestions",
            "description": "The subtask offers advice on which flavors and ingredients pair well together in a dish. It uses knowledge of taste profiles and culinary principles to recommend combinations. The objective is to inspire creativity and enhance the taste of the user's meals."
          },
          {
            "name": "Food Safety Guidance",
            "description": "This subtask provides users with important information on safe food handling, storage, and preparation practices. It includes guidelines to prevent foodborne illness and ensure the freshness and safety of food. The aim is to educate users on maintaining high food safety standards in their kitchen."
          },
          {
            "name": "Kitchen Equipment Usage",
            "description": "The subtask involves advising users on the correct use and maintenance of various kitchen appliances and tools. It includes instructions on operating equipment safely and tips for cleaning and upkeep. The goal is to help users utilize their kitchen tools effectively and extend their lifespan."
          },
          {
            "name": "Leftover Transformation",
            "description": "This subtask helps users repurpose leftovers into new and appetizing meals. It requires creativity to suggest recipes that incorporate leftover ingredients in a way that feels fresh and exciting. The objective is to reduce food waste and provide variety in the user's diet."
          },
          {
            "name": "Cooking Temperature Conversion",
            "description": "The subtask assists users in converting cooking temperatures between different measurement systems, such as Fahrenheit to Celsius or vice versa. It includes providing accurate conversion formulas and sometimes adjusting cooking times accordingly. The goal is to facilitate the following of international recipes without confusion."
          },
          {
            "name": "Food Presentation Techniques",
            "description": "This subtask guides users in the art of plating and presenting their dishes in an aesthetically pleasing manner. It encompasses suggestions on garnishing, arrangement, and color contrast to enhance the visual appeal of a meal. The aim is to elevate the dining experience by making dishes look as good as they taste."
          },
          {
            "name": "Special Diet Recipes",
            "description": "The subtask focuses on providing recipes that cater to specific dietary needs, such as gluten-free, vegan, or keto diets. It involves curating a selection of dishes that adhere to the guidelines of these special diets. The objective is to support users in maintaining their dietary choices without sacrificing flavor or variety."
          },
          {
            "name": "Cooking Skill Improvement",
            "description": "This subtask is designed to help users enhance their culinary skills through tips, tutorials, and practice recipes. It includes guidance on advanced cooking techniques and encourages users to expand their cooking repertoire. The goal is for users to gain confidence in the kitchen and enjoy the process of cooking."
          }
        ]
      },
      "Humor and Joke Crafting": {
        "descr": "The creative process of developing humorous content, jokes, or witty remarks, tailored to entertain or engage a specific audience.",
        "subtasks": [
          {
            "name": "Pun Creation",
            "description": "This subtask involves creating puns based on the content provided, using wordplay to elicit humor. It requires identifying words with multiple meanings or similar sounding words that can be used to create a humorous twist. The objective is to generate a light-hearted and clever interpretation of the text that makes the audience chuckle."
          },
          {
            "name": "One-liners Generation",
            "description": "This subtask focuses on crafting short, snappy jokes or witty remarks that are typically one sentence long. The process involves distilling humor from the text into a concise, impactful phrase. The goal is to produce a memorable and funny one-liner that quickly delivers a punchline."
          },
          {
            "name": "Anecdotal Humor Development",
            "description": "This subtask requires constructing short and amusing stories inspired by the provided text. It involves identifying relatable scenarios within the text where humor can be amplified. The aim is to create engaging and funny anecdotes that resonate with the audience and illustrate a point or idea humorously."
          },
          {
            "name": "Topical Jokes Formulation",
            "description": "This subtask is about generating jokes that relate to current events, trends, or cultural phenomena, based on the text's context. It requires staying up to date with contemporary issues and cleverly incorporating them into the humor. The objective is to create fresh and relevant jokes that appeal to the audience's sense of timeliness."
          },
          {
            "name": "Satirical Commentary",
            "description": "This subtask involves using irony, sarcasm, or exaggeration to comment on the text in a satirical manner. It requires a critical and creative approach to highlight flaws, contradictions, or absurdities in the material. The aim is to construct a humorous critique that entertains while potentially provoking thought."
          },
          {
            "name": "Character-Based Jokes",
            "description": "This subtask requires inventing jokes that revolve around fictional or exaggerated characters derived from the text. It involves creating distinctive personalities with quirks or idiosyncrasies that are inherently funny. The goal is to weave these characters into jokes that bring their humorous traits to life."
          },
          {
            "name": "Word Association Games",
            "description": "This subtask is about crafting jokes or humorous phrases by associating words from the text with unrelated or seemingly incongruous ideas. It requires a playful approach to language and connections. The goal is to surprise the audience with unexpected links that prompt laughter."
          },

          {
            "name": "Irony Crafting",
            "description": "This subtask focuses on creating expressions of irony, where the intended meaning is the opposite of the literal meaning. It involves a sophisticated play on words that conveys a wry sense of humor. The objective is to subtly highlight discrepancies through ironic remarks that make the audience reflect and laugh."
          },
          {
            "name": "Situational Comedy Setup",
            "description": "This subtask is about constructing humorous situations or scenes inspired by the text. It requires creating setups that lead to comedic payoffs, where the humor arises from the situation itself. The aim is to develop scenarios that are intrinsically funny and play out to an amusing conclusion."
          },
          {
            "name": "Absurdist Humor Generation",
            "description": "This subtask involves crafting jokes or scenarios that are based on absurdity, illogic, or nonsense. It requires embracing randomness and surreal elements to create humor that defies conventional expectations. The goal is to amuse the audience by exploring the humor inherent in the absurd."
          },
          {
            "name": "Sarcasm Implementation",
            "description": "This subtask is about infusing the text with sarcastic remarks or tones, which imply the opposite of what they appear to say. It requires a nuanced understanding of context to ensure the sarcasm is apparent and effective. The objective is to imbue the text with a layer of sharp, biting humor."
          },
          {
            "name": "Comedic Metaphor and Simile Invention",
            "description": "This subtask requires the creation of humorous metaphors and similes that draw witty comparisons to the content of the text. It involves thinking analogically to find amusing connections. The goal is to use figurative language to elicit laughter by presenting creative and funny likenesses."
          },
          {
            "name": "Punchline Creation",
            "description": "This subtask involves crafting the punchline or the climactic part of a joke. The writer must consider timing, relevance, and impact to ensure the punchline delivers the intended humor. The goal is to produce a memorable and effective punchline that resonates with the audience."
          },
          {
            "name": "Setup Construction",
            "description": "The objective here is to construct the setup for a joke, which is the part that precedes the punchline. The setup must establish context and engage the listener, creating anticipation for the punchline. An effective setup is key to making the punchline land successfully."
          },
          {
            "name": "Topical Humor Development",
            "description": "This task requires creating jokes that are relevant to current events or popular trends. It involves researching recent news or cultural phenomena and incorporating them into the humor. The aim is to produce timely and relatable content that appeals to the audience's sense of relevance."
          },
          {
            "name": "Wordplay Innovation",
            "description": "The subtask centers on the use of puns, double entendres, and other forms of wordplay. It demands a strong command of language and creativity to twist words in a way that is unexpected and amusing. The goal is to delight the audience with clever and intelligent use of wordplay."
          },
          {
            "name": "Situational Comedy Crafting",
            "description": "This involves devising humorous scenarios or situations that are intrinsically funny. The creator must think of relatable circumstances and exaggerate them for comedic effect. The aim is to elicit laughter through the absurdity or extreme nature of the situation presented."
          },
          {
            "name": "Character-Based Humor",
            "description": "Creating jokes that revolve around a fictional or real character's specific traits or behaviors. This requires an understanding of character development and the ability to exaggerate or highlight traits for comedic effect. The objective is to generate humor through character-driven scenarios and dialogues."
          },
          {
            "name": "Observational Humor Generation",
            "description": "This task involves generating humor based on everyday observations or life's peculiarities. The writer must be keenly aware of the nuances of social interactions and commonplace events. Crafting this type of humor requires a perspective that finds the comedy inherent in ordinary experiences."
          },
          {
            "name": "Audience-Specific Joke Tailoring",
            "description": "The process of customizing jokes to suit the particular tastes, interests, or demographics of a target audience. It requires research into the audience's preferences and sensitivities. The goal is to create humor that resonates specifically with the intended group."
          },
          {
            "name": "Satirical Humor Creation",
            "description": "This subtask involves the development of humor that employs irony, sarcasm, or ridicule to criticize or mock. The writer needs to understand the subject well enough to highlight its flaws or contradictions humorously. The intent is to amuse while also provoking thought or commentary on societal issues."
          },
          {
            "name": "Parody Writing",
            "description": "Creating humorous imitations of specific genres, works, or styles. This subtask demands an understanding of the original material and the ability to mimic its elements in a comedic way. The goal is to entertain by presenting a familiar concept or work in an exaggerated and humorous light."
          },
          {
            "name": "Anecdotal Humor Formulation",
            "description": "This task focuses on creating jokes or humorous stories based on personal experiences or anecdotes. The humor arises from narrating these experiences with a comedic twist. The challenge lies in making personal stories universally amusing and relatable."
          },
          {
            "name": "Surreal Humor Conception",
            "description": "Developing jokes or scenarios that are based on absurd, illogical, or fantastical elements. This subtask requires an imaginative mind that can blend the bizarre with the comical. The intent is to surprise the audience with offbeat humor that defies conventional expectations."
          },
          {
            "name": "Physical Comedy Scripting",
            "description": "The art of creating humor that emphasizes bodily movements, facial expressions, and physical mishaps. This type of humor requires careful choreography and timing to ensure the physicality translates effectively into laughs. The objective is to create visual comedy that is universally understandable."
          },
          {
            "name": "Dark Humor Crafting",
            "description": "This subtask involves producing humor that makes light of subjects typically considered serious, taboo, or distressing. The creator must balance edginess with sensitivity to avoid offense while still delivering the comedic impact. The goal is to find humor in the darker aspects of life in a way that is both provocative and entertaining."
          },
          {
            "name": "Interactive Humor Creation",
            "description": "Designing jokes or comedic content that involve the audience directly, often through participation or response. This task requires an understanding of how to engage the audience actively and make them a part of the humor. The aim is to create a shared comedic experience that is dynamic and inclusive."
          }
        ]
      },
      "Personalized Recommendation Generation": {
        "descr": "Generating tailored suggestions or recommendations based on user preferences or requirements, applicable in areas like books, movies, products, or travel destinations.",
        "subtasks": [
           {
      "name": "Contextual Movie Recommendation",
      "description": "This task involves providing movie suggestions based on the user's current mood, recent movie watching history, or preferred genres. The aim is to offer personalized movie choices that align with the user's immediate preferences."
    },
    {
      "name": "Music Recommendation for Activities",
      "description": "The task is to recommend music playlists or songs suitable for specific activities or times of day, such as working out, studying, or relaxing, considering the user's musical tastes and past listening history."
    },
    {
      "name": "Book Recommendation for Genre Enthusiasts",
      "description": "This involves suggesting books based on the user's favorite genres or authors, taking into account their reading history and ratings they have given to previous books."
    },
    {
      "name": "Travel Destination Suggestion",
      "description": "Offering travel destination recommendations based on the user's past travel experiences, budget preferences, and desired activities or cultural interests."
    },
    {
      "name": "Personalized Product Recommendations",
      "description": "Providing product suggestions tailored to the user's past purchase history, brand preferences, and specific needs or requirements in areas like fashion, tech, or home goods."
    },
    {
      "name": "Cuisine and Restaurant Suggestions",
      "description": "Recommending cuisines or restaurants based on the user's dietary preferences, previous dining experiences, and current location or desired culinary experiences."
    },
    {
      "name": "Fitness Routine Music Recommendation",
      "description": "Suggesting music that complements the user's fitness routine, considering the type of exercise, its intensity, and the user's musical preferences to enhance their workout experience."
    },
    {
      "name": "Podcast Recommendation for Commutes",
      "description": "Recommending podcasts for the user's daily commute, considering the length of the commute, the user's interests, and preferred podcast genres or themes."
    },
    {
      "name": "Event and Activity Recommendations",
      "description": "Suggesting events and activities such as concerts, exhibitions, or workshops, tailored to the user's interests, location, and availability."
    },
    {
      "name": "Educational Content Suggestions",
      "description": "Providing recommendations for educational content like online courses, webinars, or instructional videos, based on the user's learning goals, interests, and preferred learning style."
    }
        ]
      },
      "Hobby Development Assistance": {
        "descr": "Providing guidance and support for exploring and developing new hobbies, including advice on selecting hobbies, creating learning plans, and offering tips for skill advancement.",
        "subtasks": [
          {
            "name": "Hobby Selection Guidance",
            "description": "This subtask involves assisting users in identifying hobbies that align with their interests and lifestyles. It requires evaluating various factors such as the user's preferences, time availability, and potential for engagement. The goal is to provide a personalized list of hobbies that the user is likely to enjoy and pursue."
          },
          {
            "name": "Skill Progression Planning",
            "description": "This subtask aims to create a step-by-step plan detailing the progression of skills needed to master the hobby. It includes setting achievable goals, milestones, and time frames. The plan should be adaptable to the user's pace of learning and designed to maintain motivation."
          },
          {
            "name": "Budget Management Advice",
            "description": "This task assists the user in planning a budget for their hobby, taking into account initial and ongoing expenses. It helps identify cost-effective strategies and resources to minimize financial barriers. The goal is to enable the user to pursue the hobby without causing financial strain."
          },
          {
            "name": "Time Allocation Strategies",
            "description": "The subtask helps users strategize how to incorporate their new hobby into their daily routine. It addresses time management and provides tips for balancing the hobby with other responsibilities. The aim is to ensure the hobby adds value to the user's life without creating stress."
          },
          {
            "name": "Skill Assessment Tools",
            "description": "This subtask revolves around identifying or creating tools for the user to assess their current skill level and track their improvement in the hobby. It may include quizzes, self-assessment checklists, or progress logs. The purpose is to provide measurable feedback and encourage growth."
          },
          {
            "name": "Community Engagement Tactics",
            "description": "It focuses on methods for connecting the user with communities related to their hobby. This may involve suggesting online forums, local clubs, or events. Engaging with a community can provide support, inspiration, and opportunities to practice skills."
          },
          {
            "name": "Equipment and Material Sourcing",
            "description": "This subtask involves identifying and recommending the necessary equipment and materials required to pursue the hobby. It includes providing information on where to acquire these items and how to select the best options based on quality and price. The objective is to equip the user with the tools needed to get started and sustain their hobby."
          },
          {
            "name": "Safety Guidelines",
            "description": "The subtask is to inform the user about safety precautions and best practices related to their hobby. It particularly applies to hobbies that involve physical activities or the use of potentially dangerous equipment. Ensuring the user's safety is a top priority."
          },
          {
            "name": "Performance Improvement Strategies",
            "description": "The subtask is dedicated to providing strategies for the user to improve their performance and skill level within the hobby. It may include feedback mechanisms, practice routines, and optimization of techniques. The focus is on fostering continuous personal growth."
          },
          {
            "name": "Hobby-Related Event Information",
            "description": "This subtask provides information about upcoming events, such as workshops, competitions, or exhibitions, that are related to the user's hobby. It helps the user stay informed and take advantage of opportunities to learn and showcase their skills. Participation in events can also enhance their enjoyment and commitment to the hobby."
          },
          {
            "name": "Relaxation and Enjoyment Tips",
            "description": "The subtask suggests ways to ensure that the hobby remains a source of relaxation and enjoyment, rather than becoming another stressor. It may include mindfulness practices, setting realistic goals, and remembering to appreciate the process. The aim is to preserve the intrinsic joy derived from the hobby."
          },
          {
            "name": "Long-Term Hobby Development Plan",
            "description": "This subtask entails creating a long-term plan for the development and sustainability of the hobby. It considers future advancements, potential shifts in interests, and ways to keep the hobby engaging over time. The goal is to foster a lasting and evolving relationship with the hobby."
          },
          {
            "name": "Hobby Identification",
            "description": "This subtask involves assisting users in discovering hobbies that align with their interests and lifestyle. It includes evaluating a user's preferences, time availability, and any prior experiences they may have. The goal is to generate a personalized list of potential hobbies that the user may find enjoyable and fulfilling."
          },
          {
            "name": "Resource Compilation",
            "description": "The subtask requires gathering and presenting a list of resources, such as books, websites, or local classes, that can help the user learn more about a chosen hobby. The focus is on curating high-quality and relevant materials. This step is aimed at providing the user with the tools they need to explore and develop their new interest."
          },
          {
            "name": "Beginner Tips Provision",
            "description": "This subtask consists of offering practical advice and strategies tailored to beginners in a new hobby. The aim is to help novices overcome common challenges and engage in the hobby with confidence. These tips should be straightforward, focused on foundational skills, and designed to facilitate a positive introductory experience."
          },
          {
            "name": "Learning Plan Development",
            "description": "This subtask involves creating a structured plan that outlines a progression path for the hobbyist. It should detail objectives, milestones, and a timeline, providing a clear road map for skill development. The learning plan will be adaptable to the user's pace and evolving interests."
          },
          {
            "name": "Skill Progression Tracking",
            "description": "The subtask focuses on developing methods for users to track their progress in the new hobby. It involves establishing criteria for measuring improvement and providing tools to record achievements. Tracking progress is crucial for motivation and recognizing areas that need further development."
          },
          {
            "name": "Community Engagement Guidance",
            "description": "This subtask aims to connect the user with relevant communities related to their hobby. It includes finding online forums, local clubs, or social media groups where they can share experiences and learn from others. Engagement with a community can offer support, advice, and camaraderie."
          },
          {
            "name": "Time Management Advice",
            "description": "This subtask is about helping users integrate their new hobby into their existing schedules. It involves suggesting time management strategies to ensure consistent engagement with the hobby without neglecting other responsibilities. The advice will be tailored to accommodate the individual's lifestyle and priorities."
          },
          {
            "name": "Budgeting Assistance",
            "description": "The subtask entails aiding users in creating a budget for their hobby-related expenses. It includes estimating costs, offering money-saving tips, and helping users set financial boundaries to avoid overspending. Effective budgeting can make developing a new hobby more sustainable."
          },
          {
            "name": "Equipment Recommendation",
            "description": "This subtask deals with advising users on the essential equipment or tools needed to pursue their hobby. Recommendations will be based on the requirements of the hobby, user preference, and cost considerations. The objective is to ensure users have the appropriate resources to actively participate."
          },
          {
            "name": "Skill Enhancement Techniques",
            "description": "The subtask includes providing advanced techniques and methods to help the user enhance their skills in the hobby. It involves offering detailed advice on refining techniques and overcoming plateaus. This subtask aims to support ongoing improvement and mastery."
          },
          {
            "name": "Creative Exploration Encouragement",
            "description": "This subtask encourages users to explore their hobby in creative and unconventional ways. It includes suggesting exercises or projects that push the boundaries of traditional practice. The goal is to stimulate innovation and keep the hobby engaging."
          },
          {
            "name": "Event Participation Incentive",
            "description": "The subtask involves motivating users to participate in events related to their hobby, such as workshops, competitions, or exhibitions. It aims to expose them to new experiences and help them engage more deeply with the hobby community. Participation in events can also offer networking opportunities and feedback."
          },
          {
            "name": "Well-being Monitoring",
            "description": "This subtask focuses on ensuring that the pursuit of a new hobby contributes positively to the user's mental and physical well-being. It involves providing advice on maintaining a healthy balance and recognizing when the hobby might be causing stress. The aim is to ensure that the hobby remains a source of relaxation and enjoyment."
          },
          {
            "name": "Feedback Mechanism Setup",
            "description": "The subtask includes setting up a system for the user to receive feedback on their progress in the hobby. It could involve finding a mentor, joining critique sessions, or self-assessment guides. Constructive feedback is vital for improvement and motivation."
          },
          {
            "name": "Success Celebration Planning",
            "description": "This subtask is dedicated to recognizing and celebrating milestones achieved within the hobby. It involves helping users plan ways to acknowledge their efforts, whether through sharing with friends and family or rewarding themselves. Celebrating successes can boost confidence and commitment to the hobby."
          }
        ]
      },
      "Prompt Development and Customization": {
        "descr": "The process of creating and refining prompts for various applications, encompassing the generation of original prompts and the modification of existing ones to suit specific needs or contexts.",
        "subtasks": [

          {
            "name": "Targeted Prompt Refinement",
            "description": "This subtask involves modifying existing prompts to target specific user groups or individuals. It requires the AI to consider demographic factors, interests, and preferences to tailor prompts that resonate with the target audience. The goal is to enhance engagement and response accuracy."
          },
          {
            "name": "Prompt Expansion",
            "description": "The task of expanding a basic prompt into a more detailed or complex one falls under this subtask. It involves adding depth and breadth to the initial prompt, making it more informative or descriptive. This is especially useful for guiding more detailed or nuanced responses."
          },
          {
            "name": "Prompt Simplification",
            "description": "Here, the objective is to simplify complex prompts into easier-to-understand versions. It requires distilling the essence of the prompts, making them more accessible, especially for audiences with varying levels of comprehension. The goal is clarity without sacrificing the prompt's purpose."
          },
          {
            "name": "Multi-Lingual Prompt Adaptation",
            "description": "This subtask entails translating and adjusting prompts for multi-lingual applications. It involves not only language translation but also cultural adaptation to ensure relevance and appropriateness across different languages and cultures. The aim is to maintain the intent of the prompts while ensuring they are comprehensible globally."
          },

          {
            "name": "Prompt Variability Generation",
            "description": "The creation of multiple variations of a prompt to test which elicits the best response is what this subtask involves. It requires generating a range of alternate prompts while retaining the original intent. This is key for A/B testing and optimizing user engagement."
          },
          {
            "name": "Factual Prompt Compilation",
            "description": "This subtask entails assembling prompts based on factual information or data. It requires accuracy and attention to detail to ensure that prompts are grounded in verifiable facts. These prompts are useful for educational and informative purposes."
          },
          {
            "name": "Ethical Prompt Evaluation",
            "description": "The aim here is to scrutinize prompts to ensure they adhere to ethical standards and do not promote harmful behavior or bias. This subtask involves critical analysis and possibly user feedback to assess the appropriateness of prompts. Ethical consideration is crucial for maintaining trust and integrity in user interactions."
          },
          {
            "name": "Scenario-Based Prompt Construction",
            "description": "This task involves creating prompts based on hypothetical or real-world scenarios. It requires envisioning various situations in which the prompts could be used and formulating them accordingly. Such prompts are valuable for simulations, role-play exercises, or strategic planning."
          },
          {
            "name": "Specificity Enhancement",
            "description": "This subtask involves revising prompts to include more specific details or constraints tailored to the desired output. It aims to narrow the focus of the prompt to produce more targeted and relevant responses. The goal is to improve the precision of the interaction by providing fine-tuned prompts."
          },
          {
            "name": "Contextual Customization",
            "description": "The aim of this subtask is to adapt the prompt to fit a particular context or scenario, making it more applicable to the situation at hand. It requires understanding the nuances of the context and incorporating them into the prompt. This ensures the prompt elicits responses that are appropriate for the specific context."
          },
          {
            "name": "Tone Adjustment",
            "description": "This subtask entails modifying the language and style of the prompt to reflect a desired tone, such as formal, casual, humorous, or serious. It is important to align the tone with the application's target audience and purpose. The result is a customized prompt that communicates in a manner most effective for its intended use."
          },
          {
            "name": "Prompt Simplification",
            "description": "Simplification focuses on making the prompt more accessible by reducing complexity and using clearer language. The intent is to create prompts that are easy to understand without sacrificing the essence of what is being asked. This helps in engaging users who may have varying levels of language proficiency or familiarity with the subject."
          },
          {
            "name": "Creative Prompt Generation",
            "description": "This task involves coming up with new, imaginative prompts that encourage innovative thinking or problem-solving. The challenge is to be original while still remaining relevant to the topic or purpose. These prompts are designed to stimulate creativity in the respondent."
          },
          {
            "name": "Multilingual Prompt Development",
            "description": "Developing prompts that can be understood and used in different languages is the focus of this subtask. It requires translating and culturally adapting the prompts to maintain their meaning and effectiveness across linguistic boundaries. The goal is to create inclusive prompts for a diverse audience."
          },
          {
            "name": "User Intent Clarification",
            "description": "The aim is to refine prompts to more accurately capture and reflect the user's intended meaning or purpose. This subtask involves interpreting user input and reformulating the prompt to align with their goals. Correctly identifying and addressing user intent enhances the relevance of the responses."
          },
          {
            "name": "Prompt Sequencing",
            "description": "This subtask involves organizing prompts into a logical sequence to facilitate a natural progression of interaction or conversation. It requires planning the order of prompts to build upon previous information or responses. This helps in maintaining a coherent and structured dialogue."
          },
          {
            "name": "Prompt Personalization",
            "description": "Personalization involves tailoring prompts to individual users based on their preferences, history, or profile information. The aim is to create a more engaging and relevant experience by reflecting the user's unique characteristics in the prompts. This subtask requires careful handling of personal data to respect privacy."
          },
          {
            "name": "Feedback-Driven Refinement",
            "description": "This subtask is focused on iterating the prompt based on user feedback or response performance. It involves analyzing responses and feedback to identify areas for improvement and updating the prompts accordingly. Continuous refinement ensures the prompts remain effective over time."
          },
          {
            "name": "Prompt Expansion",
            "description": "Expanding prompts involves adding additional information or questions to enrich the context and provide more depth. This can help in eliciting more detailed or comprehensive responses. The subtask requires balancing the additional content to avoid overwhelming the user."
          },
          {
            "name": "Interdisciplinary Integration",
            "description": "Integration entails creating prompts that draw from multiple fields or areas of knowledge to facilitate a broader perspective. This subtask combines diverse concepts to foster cross-disciplinary thinking and insights. The objective is to craft prompts that encourage holistic understanding."
          },
          {
            "name": "Ethical Consideration",
            "description": "This subtask concentrates on ensuring that prompts adhere to ethical standards and do not promote harm or bias. It involves evaluating and revising prompts to align with ethical guidelines. The goal is to maintain integrity and respect for all users in the prompt development process."
          },
          {
            "name": "Prompt Obfuscation",
            "description": "Obfuscation involves intentionally making a prompt ambiguous or open-ended to challenge the user to think critically or creatively. The subtask is to craft prompts that are non-specific but still engaging, driving users to interpret and explore the potential of the prompt in their own way."
          },
          {
            "name": "Call-to-Action Creation",
            "description": "This subtask focuses on developing prompts that motivate the user to take a specific action or make a decision. It requires crafting clear, compelling calls-to-action that prompt immediate response or engagement. The aim is to induce a desired behavior or outcome through the prompt."
          }
        ]
      }
    },
    "Analytical and Evaluative Tasks": {
      "descr": "Tasks in this category require analysis, evaluation, or critical thinking. They involve interpreting information, making judgments, or providing reasoned arguments.",
      "Linguistic Analysis": {
        "descr": "Analyzing grammatical, syntactic, and stylistic aspects of the text.",
        "subtasks": [
          {
            "name": "Parts of Speech Tagging",
            "description": "This subtask involves identifying and labeling each word in the text according to its part of speech (e.g., noun, verb, adjective, etc.). It is a foundational task for understanding the structure of sentences. The outcome provides insights into the syntactic roles of different words within the text."
          },
          {
            "name": "Pragmatic Analysis",
            "description": "The focus here is on understanding the intended message, implications, or communicative functions behind the text. It goes beyond literal meanings to consider context, tone, and social rules. Pragmatic analysis can reveal the relationships between speakers, their intentions, and the effectiveness of communication."
          },
          {
            "name": "Semantic Role Labeling",
            "description": "This involves assigning labels to words or phrases in a sentence that indicate their semantic role in relation to the main verb, such as the agent, patient, or instrument. It is used to understand the meaning of sentences by identifying how participants are involved in each action. Semantic role labeling is crucial for full comprehension of the text's meaning."
          },
          {
            "name": "Morphological Analysis",
            "description": "In this subtask, the focus is on the internal structure of words, analyzing the root forms, affixes, and how they combine. It helps in understanding word formation and inflection. Morphological analysis is particularly important for identifying variations of the same word and understanding their specific roles in the text."
          },
          {
            "name": "Discourse Analysis",
            "description": "This subtask examines how sequences of sentences, or discourses, come together to convey meaning and achieve coherence in the text. It encompasses the study of both written and spoken language, considering factors like context, tone, and the relationship between the text and its audience. Discourse analysis can unravel complexities in communication that go beyond sentence-level analysis."
          },
          {
            "name": "Lexical Density Analysis",
            "description": "The task is to calculate the lexical density of the text, which is the ratio of lexical items (like nouns, verbs, adjectives, and adverbs) to the total number of words. High lexical density can indicate a more complex or formal text. This analysis can inform readability and text complexity assessments."
          },
          {
            "name": "Readability Assessment",
            "description": "This involves evaluating the text to determine how easy it is to read and understand, often using established formulas like Flesch-Kincaid or Gunning Fog. These assessments take into account sentence length, syllable count, and word frequency. Readability assessments are useful for tailoring content to specific audiences."
          },
          {
            "name": "Stylistic Analysis",
            "description": "The objective is to analyze the author's use of language, including choices in diction, syntax, figurative language, and sentence structure. This subtask can reveal the unique voice or style of the author and is important for literary analysis. Stylistic analysis contributes to a deeper understanding of the text's aesthetic and expressive qualities."
          },
          {
            "name": "Text Cohesion Analysis",
            "description": "This subtask assesses the connections and transitions between sentences and paragraphs to determine the text's overall cohesion. Cohesion is achieved through grammatical and lexical linking devices, such as conjunctions, pronouns, and synonyms. Analyzing cohesion helps in understanding the flow and clarity of the text."
          },
          {
            "name": "Phonological Analysis",
            "description": "Here, the focus is on the sound system of the language, studying patterns of phonemes, stress, intonation, and rhythm in the text. This is especially relevant for spoken language analysis or when considering the poetic aspects of written text. Phonological analysis can provide insights into pronunciation, rhyme schemes, and the musicality of language."
          },
          {
            "name": "Grammatical Error Detection",
            "description": "This subtask involves scanning the text for grammatical mistakes, including issues with verb tense, subject-verb agreement, and article usage. The goal is to identify and correct errors to improve the clarity and readability of the text. It ensures the text adheres to standard language conventions."
          },
          {
            "name": "Vocabulary Richness Assessment",
            "description": "This subtask evaluates the diversity and sophistication of the vocabulary used in the text. It involves looking at the range of vocabulary and the use of specific terminology or jargon. It aims to determine the text's lexical richness and appropriateness for the intended audience."
          },
          {
            "name": "Cohesion and Coherence Analysis",
            "description": "The focus of this subtask is on the logical flow and connectivity of ideas within the text. It examines how sentences and paragraphs are linked and whether the text presents a unified argument or narrative. This is crucial for ensuring the text is well-organized and easy to follow."
          },
          {
            "name": "Pragmatic Analysis",
            "description": "This subtask assesses the text's ability to achieve its intended communicative purpose, taking into account context and usage. It explores how language is used in practice, including speech acts and conversational implicatures. The goal is to determine the text's effectiveness in conveying its intended message."
          },
          {
            "name": "Lexical Density Measurement",
            "description": "This subtask measures the proportion of lexical items (nouns, verbs, adjectives, adverbs) in the text compared to the total number of words. It provides insights into the text's complexity and informativeness. A higher lexical density could imply a more information-rich text."
          },
          {
            "name": "Collocation Extraction",
            "description": "This subtask identifies commonly paired words within the text, known as collocations. It helps to understand the text's lexical patterns and phraseology. Recognizing collocations can also aid in natural-sounding language production and comprehension."
          },
          {
            "name": "Sentiment Analysis",
            "description": "This subtask evaluates the sentiment or emotional tone conveyed by the text, classifying it as positive, negative, or neutral. It involves parsing the text to determine the author's attitude and the emotional response the text may elicit from readers. This can provide valuable context for the text's overall impact."
          },
          {
            "name": "Discourse Structure Analysis",
            "description": "This subtask analyzes the organization of the text at a discourse level, such as the use of introduction, body, and conclusion in an essay. It assesses how well the text is structured to support coherent communication. This analysis helps in understanding the text's argumentative or narrative effectiveness."
          },
          {
            "name": "Figurative Language Identification",
            "description": "The aim of this subtask is to detect and interpret figurative language, including metaphors, similes, and idioms, within the text. It requires differentiating between literal and non-literal language use. This contributes to a deeper understanding of the text's nuanced meanings."
          },
          {
            "name": "Connotation Analysis",
            "description": "This subtask is about identifying words or phrases that carry connotative meanings beyond their denotative definitions. It involves analyzing the text for language that evokes certain associations, emotions, or attitudes. This is important for a full appreciation of the text's impact and subtleties."
          },
          {
            "name": "Anaphora Resolution",
            "description": "The objective of this subtask is to identify and link pronouns or other referring expressions to their correct antecedents within the text. It ensures the text's references are clear and unambiguous. Anaphora resolution is fundamental for maintaining coherence and understanding who or what is being discussed."
          },
          {
            "name": "Textual Entailment Recognition",
            "description": "This subtask determines if one portion of the text logically follows from another, indicating a relationship of entailment. It entails a determination of whether a true relation exists between segments of the text. This analysis can be important for automated reasoning and understanding implicit information."
          }
        ]
      },
      "Critical Review and Assessment": {
        "descr": "Evaluating content, such as articles, books, or projects, for quality, coherence, and overall effectiveness, often providing constructive feedback.",
        "subtasks": [
          {
            "name": "Argument Strength Assessment",
            "description": "This subtask involves scrutinizing the arguments presented within the text to evaluate their credibility and strength. It requires a critical examination of the evidence, reasoning, and logical coherence of each argument. The goal is to gauge the persuasiveness and solidity of the text's argumentative structure."
          },
          {
            "name": "Consistency Check",
            "description": "This subtask requires checking the text for internal consistency, ensuring that all parts contribute to a coherent whole without contradictions. It focuses on the logical flow and whether the text remains true to its initial premises throughout. Identifying any discrepancies is a key outcome of this task."
          },
          {
            "name": "Bias Identification",
            "description": "The aim of this subtask is to analyze the text for any subjective biases or perspectives that may affect the impartiality of the content. It involves detecting language, examples, or arguments that reveal a particular bias. The outcome provides insight into the text's objectivity and balance."
          },
          {
            "name": "Relevance Rating",
            "description": "The relevance rating subtask aims to evaluate how pertinent and applicable the text's content is to the intended topic or audience. It involves an assessment of the material's significance and its practical value. The goal is to understand and rate the text's usefulness for its intended purpose."
          },
          {
            "name": "Clarity and Comprehensibility Check",
            "description": "The task requires evaluating the text's clarity of expression and ease of understanding. It involves analyzing sentence structure, vocabulary, and the presentation of ideas to ensure they are conveyed clearly. The objective is to ensure that the text can be easily comprehended by its intended audience."
          },
          {
            "name": "Structural Analysis",
            "description": "This subtask involves examining the overall structure and organization of the text. It looks at how well the content is logically arranged, including the use and effectiveness of headings, subheadings, and paragraph transitions. The goal is to assess the orderliness and layout which contribute to the text's readability."
          },
          {
            "name": "Accessibility Audit",
            "description": "The accessibility audit subtask focuses on how accessible the text is to a diverse audience, including individuals with disabilities. It involves examining the text for inclusive language and the availability of accessibility features such as alt text for images. The aim is to ensure that the content is barrier-free and usable by all."
          },
          {
            "name": "Recommendation Formulation",
            "description": "After a thorough critical review, this subtask focuses on generating constructive recommendations for the author. It entails suggesting improvements on aspects like content development, structure, and style. The objective is to provide actionable advice that enhances the quality and effectiveness of the text."
          },
          {
            "name": "Evidence Evaluation",
            "description": "The focus of this subtask is to appraise the quality and relevance of the evidence provided in the text. It requires a careful examination of the data, examples, and citations to ascertain their credibility and significance. The goal is to assess how effectively the evidence backs the claims made."
          },
          {
            "name": "Impact Prediction",
            "description": "The subtask involves estimating the potential impact or influence of the text in its respective field or among its target audience. It assesses the significance and implications of the content. The goal is to predict how the text might shape or contribute to the discourse."
          },
          {
            "name": "Completeness Review",
            "description": "This subtask examines whether the text covers its topics comprehensively. It checks for any missing components or gaps in the information provided. The goal is to ensure that the text offers a complete treatment of its subject matter."
          },
          {
            "name": "Audience Suitability",
            "description": "The focus here is to evaluate whether the text is suitable for its intended audience in terms of complexity, tone, and content. It involves considering the background knowledge and preferences of the audience. The aim is to determine the appropriateness of the text for its readers."
          },
          {
            "name": "Structural Analysis",
            "description": "This subtask involves examining the organization and layout of the text. It looks at the structure of arguments, the flow of content, and the use of headings and subheadings. The objective is to assess the logical arrangement and presentation of ideas."
          },
          {
            "name": "Style Critique",
            "description": "The subtask evaluates the author's style, including linguistic choices, narrative voice, and tone. It considers how these stylistic elements affect the message and reader engagement. The goal is to critique the effectiveness of the writing style."
          },
          {
            "name": "Contextual Analysis",
            "description": "This subtask involves placing the text within its broader context, considering factors such as historical background, cultural aspects, or current events. It assesses how well the text responds to or considers its context. The aim is to determine the text's relevance and timeliness."
          },
          {
            "name": "Purpose Clarity",
            "description": "The aim of this subtask is to evaluate how clearly the text conveys its intended purpose. It examines whether the objectives or goals are explicitly stated and easily discernible. The goal is to assess the clarity with which the text communicates its raison d'être."
          },
          {
            "name": "Suggestive Improvement",
            "description": "This subtask focuses on proposing constructive improvements to the text based on the identified weaknesses or areas for enhancement. It involves suggesting specific changes or additions. The objective is to provide practical recommendations to refine the text."
          }
        ]
      },
      "Grammatical Error Correction": {
        "descr": "The task of detecting and correcting grammatical errors in a text, which includes fixing issues related to verb tense, subject-verb agreement, sentence structure, punctuation, and other aspects of grammar.",
        "subtasks": [
          {
            "name": "Spelling Correction",
            "description": "This subtask involves identifying and correcting spelling mistakes throughout the text. It requires a careful examination of each word to ensure it is spelled correctly according to standard dictionaries. The objective is to produce a text that is free of spelling errors, improving its overall readability."
          },
          {
            "name": "Punctuation Correction",
            "description": "The subtask targets the proper use of punctuation marks such as commas, periods, semicolons, and others. It involves reviewing the text for correct punctuation, ensuring that sentences are well-defined and that the intended meaning is clear. The goal is to ensure clarity and coherence in the text through the accurate placement of punctuation."
          },
          {
            "name": "Subject-Verb Agreement Verification",
            "description": "This subtask focuses on ensuring that subjects and verbs in sentences agree in number and person. It includes scrutinizing each sentence to confirm that singular subjects have singular verbs and plural subjects have plural verbs. The aim is to create grammatically correct sentences that flow smoothly and make sense."
          },
          {
            "name": "Verb Tense Consistency Check",
            "description": "The subtask is to maintain consistent verb tenses throughout the text, according to the context and timeline of the events described. It involves identifying and correcting shifts in tense that can confuse the reader or alter the sequence of events. The goal is to achieve temporal coherence and enhance the text's comprehensibility."
          },
          {
            "name": "Sentence Structure Improvement",
            "description": "This subtask requires rephrasing awkward or complex sentences to improve readability. It involves the reorganization of sentence elements to create a logical and clear structure. The objective is to produce a text with sentences that are easy to follow and understand."
          },
          {
            "name": "Pronoun-Antecedent Agreement",
            "description": "This subtask emphasizes the correct use of pronouns and their corresponding antecedents in gender, number, and person. It involves scanning the text for pronouns and ensuring they accurately reflect the nouns to which they refer. The aim is to avoid confusion and maintain clarity in the narrative or argument."
          },
          {
            "name": "Capitalization Correction",
            "description": "The subtask addresses the proper use of capital letters at the beginning of sentences and for proper nouns. It includes a meticulous review of the text to apply capitalization rules accurately. The goal is to ensure that the text adheres to standard grammatical conventions for capitalization."
          },
          {
            "name": "Modifier Placement Adjustment",
            "description": "This subtask focuses on placing modifiers near the words they modify to prevent confusion. It involves restructuring sentences to position adjectives, adverbs, and other modifiers correctly. The aim is to enhance the clarity and precision of the text."
          },
          {
            "name": "Conjunction Usage Optimization",
            "description": "The subtask ensures the correct and effective use of conjunctions to form compound and complex sentences. It requires evaluating the text for flow and coherence, using conjunctions to join ideas where appropriate. The goal is to improve the textual flow while maintaining the intended meaning."
          },
          {
            "name": "Preposition Selection",
            "description": "This subtask involves choosing the correct prepositions to accurately convey location, time, and other relationships between elements in the text. It includes scrutinizing prepositional phrases and making necessary adjustments. The objective is to use prepositions that fit the context and provide clear communication."
          },
          {
            "name": "Article Usage Refinement",
            "description": "The subtask refines the use of definite and indefinite articles such as 'the', 'a', and 'an' to ensure grammatical correctness. It entails reviewing noun phrases and determining the suitability of article usage based on specificity and countability. The goal is to improve the text's accuracy in depicting particular or general items."
          },
          {
            "name": "Sentence Fragment Repair",
            "description": "This subtask identifies incomplete sentences, known as fragments, and revises them to form complete thoughts. It involves adding missing subjects, predicates, or other necessary elements to construct full sentences. The aim is to create a complete and coherent text, free of ambiguous or incomplete ideas."
          },
          {
            "name": "Run-on Sentence Splitting",
            "description": "The subtask is to break down run-on sentences into smaller, more manageable sentences that are clear and concise. It requires identifying sentences that improperly join independent clauses without punctuation or conjunctions. The goal is to enhance readability by creating separate sentences that each convey a single, clear idea."
          },
          {
            "name": "Consolidation of Redundancies",
            "description": "This subtask involves eliminating redundant words, phrases, or ideas to make the text more concise and powerful. It includes identifying and removing unnecessary repetition that does not add meaning or value to the content. The objective is to streamline the text, making it more impactful and easier to read."
          },
          {
            "name": "Verb Tense Consistency Check",
            "description": "This subtask involves reviewing the text to ensure that all verbs are in the appropriate tense, according to the context and timeline of the content. The goal is to identify and correct any inconsistencies in verb tense usage, which can confuse the reader about the sequencing of events. Maintaining tense consistency is crucial for clear and coherent writing."
          },
          {
            "name": "Subject-Verb Agreement Verification",
            "description": "The focus of this subtask is to scan the text for instances where the subject and verb do not properly agree in number, and then correct any such errors. It involves a detailed inspection of singular and plural subjects paired with their respective verbs. Ensuring correct subject-verb agreement is fundamental for grammatically sound sentences."
          },
          {
            "name": "Punctuation Correction",
            "description": "This subtask requires the examination of the text for proper use of punctuation marks such as periods, commas, semicolons, and quotation marks. It involves detecting and fixing punctuation errors to enhance the clarity and readability of the text. Correct punctuation aids in the proper interpretation and flow of the written material."
          },
          {
            "name": "Sentence Structure Improvement",
            "description": "The purpose of this subtask is to improve awkward or confusing sentence constructions. It entails identifying poorly structured sentences and revising them for clarity and effectiveness. This process enhances the overall quality of the text by ensuring that each sentence is concise and easy to understand."
          },
          {
            "name": "Spelling Consistency Check",
            "description": "This subtask looks for inconsistencies in spelling, particularly with words that have different accepted spellings (e.g., American vs. British English). The goal is to standardize the spelling throughout the text to maintain consistency. Correct and consistent spelling is crucial for the text's professionalism and readability."
          },
          {
            "name": "Pronoun-Antecedent Agreement Check",
            "description": "It checks for cases where pronouns do not agree in number, gender, or person with their antecedents. The task adjusts any pronoun that does not correctly refer back to a clear and matching antecedent, ensuring that the text remains clear and unambiguous."
          },
          {
            "name": "Capitalization Rules Enforcement",
            "description": "The task entails examining the text for proper use of capital letters at the beginning of sentences, proper nouns, titles, and other conventional capitalization points. It involves correcting any capitalization mistakes to adhere to standardized writing conventions. Proper capitalization is necessary for a text to appear professional and to follow grammatical rules."
          },
          {
            "name": "Apostrophe Usage Correction",
            "description": "This subtask requires the checking of possessive forms and contractions to correct misuse or omission of apostrophes. It includes distinguishing between its/it's, your/you're, and similar contractions, as well as ensuring possessives are properly formed. Correct apostrophe usage prevents misinterpretation of a text."
          },
          {
            "name": "Adjective and Adverb Usage Review",
            "description": "The aim here is to evaluate the text for the correct use of adjectives and adverbs, including their comparative and superlative forms. This entails identifying and amending any misuse that affects the sentences' clarity or changes their intended meaning. Proper use of modifiers enhances the description and detail in writing."
          },
          {
            "name": "Fragment and Run-on Sentence Correction",
            "description": "The subtask focuses on identifying and revising sentence fragments (incomplete sentences) and run-on sentences (improperly combined independent clauses). By transforming these into complete, properly punctuated sentences, the text's readability is significantly improved. Addressing these issues is vital for maintaining proper sentence structure."
          },
          {
            "name": "Parallel Structure Verification",
            "description": "This subtask involves checking for parallelism errors in lists and series to ensure syntactic consistency. It requires modifying sentences to align the structure of their elements, thereby improving readability and stylistic elegance. Parallel structure helps convey information in a more organized and understandable manner."
          },
          {
            "name": "Comma Splice Elimination",
            "description": "The focus here is to detect and correct comma splices, which occur when two independent clauses are incorrectly joined by a comma without a conjunction. Corrections typically involve adding a conjunction, changing the comma to a semicolon, or separating the clauses into two sentences. Eliminating comma splices is essential for proper sentence construction."
          },
          {
            "name": "Modifier Placement Adjustment",
            "description": "This subtask checks the text for misplaced or dangling modifiers and rearranges them as necessary to clear up any potential ambiguity. By ensuring modifiers are close to the words they modify, the sentences convey their intended meaning more precisely. Proper modifier placement is critical for the text's accuracy and clarity."
          },
          {
            "name": "Homophone Clarification",
            "description": "The subtask is designed to identify and rectify instances where homophones (words that sound alike but have different meanings) are misused. This involves replacing the incorrect homophone with the correct one to ensure the sentence makes sense in context. Homophone clarification reduces reader confusion and improves comprehension."
          },
          {
            "name": "Active and Passive Voice Balancing",
            "description": "This subtask evaluates the text for an appropriate balance between active and passive voice, revising as necessary to suit the context and purpose. It involves restructuring passive sentences into active ones where a more direct, clear expression is beneficial, and ensuring that the passive voice is used intentionally when appropriate. Proper balancing of voice contributes to a text's dynamism and clarity."
          }
        ]
      },
      "Simplifying Complex Ideas": {
        "descr": "The process of breaking down and explaining complex concepts or information in a simpler, more understandable way, making them accessible to a broader audience.",
        "subtasks": [
          {
            "name": "Vocabulary Simplification",
            "description": "This subtask involves replacing complex words and jargon with simpler, more commonly understood terms. The aim is to ensure that the text remains meaningful while becoming more accessible to readers with different levels of understanding. It is crucial to maintain the original information's integrity while simplifying the language."
          },
          {
            "name": "Sentence Structure Simplification",
            "description": "This subtask focuses on breaking down long and convoluted sentences into shorter, more digestible ones. By doing so, the text becomes clearer and easier to follow. The essence of the original sentences is preserved but communicated in a way that is more straightforward for the reader to comprehend."
          },
          {
            "name": "Conceptual Explanation",
            "description": "Here, the subtask is to provide clear explanations for complex concepts mentioned in the text. This could involve the use of analogies, metaphors, or real-world examples to make abstract ideas more concrete. The goal is to aid understanding by connecting new information to the reader's existing knowledge."
          },
          {
            "name": "Analogous Comparison",
            "description": "In this subtask, complex ideas are aligned with more familiar scenarios or concepts through comparison. By drawing parallels to well-understood ideas, the reader can more easily grasp the unfamiliar material. The comparison must be apt and enhance comprehension without oversimplifying the original idea."
          },
          {
            "name": "Sequential Breakdown",
            "description": "Complex processes or ideas are broken down into sequential steps or stages in this subtask. The aim is to outline a linear path through the information, making it easier to follow and comprehend. Each step is explained individually, contributing to a full understanding of the entire process."
          },
          {
            "name": "Interactive Explanation",
            "description": "Involves creating an interactive experience, such as a quiz or a set of exercises, that helps readers understand complex ideas through engagement. This method encourages active learning and can aid in the retention of complicated concepts. Interactive elements should be relevant and designed to reinforce the material presented in the text."
          },
          {
            "name": "Simplified Definition",
            "description": "Focuses on providing simplified definitions for technical terms or complex concepts found in the text. A good definition will convey the essence of a term in plain language, without extensive background knowledge required. This subtask is critical for ensuring that all readers are on the same page regarding the meanings of specialized vocabulary."
          },
          {
            "name": "Topical Segmentation",
            "description": "Complex material is segmented into distinct topics or categories in this subtask. By organizing the content into smaller, thematically related sections, readers can tackle one concept at a time. This segmentation helps in managing cognitive load and makes the material less intimidating."
          },
          {
            "name": "Narrative Integration",
            "description": "This subtask entails embedding complex ideas into a narrative or story format. Narratives can make learning more engaging by adding human elements and emotions, which aids in understanding and memory. The story should be crafted in a way that highlights and clarifies the key concepts without distortion."
          },
          {
            "name": "FAQ Compilation",
            "description": "This subtask focuses on compiling a list of frequently asked questions (FAQs) related to the complex concepts, followed by straightforward answers. This format allows readers to quickly find and understand specific information they are interested in. An effective FAQ section addresses common misunderstandings and clarifies complexities."
          },
          {
            "name": "Contextual Explanation",
            "description": "Providing background information and context is the aim of this subtask to help readers understand complex ideas within a broader frame of reference. It involves outlining the history, application, or implications of an idea. Context aids comprehension by situating the concept within a familiar framework."
          },
          {
            "name": "Simplified Glossary Creation",
            "description": "This subtask entails creating a glossary with simplified definitions of technical terms found within the text. The challenge is to define terms using everyday language without losing their specific meanings. A glossary serves as a reference that can increase the accessibility of the material."
          },
          {
            "name": "Use-Case Description",
            "description": "Describing practical use-cases or real-world applications of complex ideas is the cornerstone of this subtask. It involves identifying cases where the complex ideas are applied and explaining these applications in a straightforward manner. This helps demonstrate the relevance and functionality of the concepts."
          },
          {
            "name": "Logical Sequencing",
            "description": "This subtask involves organizing information in a logical order that builds from simple to complex. It requires structuring the presentation of ideas so that each concept naturally leads to the next. Logical sequencing helps readers follow and understand the progression of thoughts."
          },
          {
            "name": "Contrast and Comparison",
            "description": "The focus of this subtask is to compare complex ideas with simpler or more familiar ones to highlight differences and similarities. This method involves selecting appropriate subjects for comparison to illuminate aspects of the complex ideas. Contrast and comparison can demystify challenging content by relating it to known entities."
          },
          {
            "name": "Summary Creation",
            "description": "Creating summaries that encapsulate the essence of complex concepts in a condensed form is what this subtask is about. It requires distilling the most crucial aspects of the information while omitting extraneous details. Summaries provide a quick and simplified overview that can precede or follow a detailed explanation."
          },
          {
            "name": "Narrative Structuring",
            "description": "Employing storytelling techniques to convey complex ideas is the aim of this subtask. It involves crafting a narrative that incorporates the concepts into an engaging and relatable tale. Storytelling can make complex ideas more memorable and easier to digest by giving them context and emotional resonance."
          }
        ]
      },
      "Mathematical Problem Solving": {
        "descr": "The task of solving mathematical problems or equations, ranging from basic arithmetic to more advanced areas like calculus, statistics, or algebra.",
        "subtasks": [
          {
            "name": "Problem Classification",
            "description": "This subtask involves categorizing the mathematical problem into a relevant field of mathematics or type of problem. It requires analyzing the problem statement to determine whether it pertains to arithmetic, algebra, geometry, calculus, statistics, etc. The aim is to streamline the problem-solving process by identifying the appropriate methods and formulas."
          },
          {
            "name": "Variable Identification",
            "description": "The focus here is on pinpointing and labeling all the variables involved in the given mathematical problem. This involves carefully reading the problem statement to find unknowns, constants, and parameters. Establishing what each variable represents is crucial for constructing appropriate equations and solving the problem."
          },
          {
            "name": "Equation Formulation",
            "description": "The task is to translate the mathematical problem into one or more equations using the identified variables and known information. It involves applying mathematical logic and relevant formulas to create an equation that embodies the problem statement. Proper formulation is the foundation of solving any mathematical problem."
          },
          {
            "name": "Solution Pathway Identification",
            "description": "This entails outlining a step-by-step approach to solving the mathematical problem. It involves determining the sequence of operations, manipulations, and theorem applications needed. Identifying a clear solution pathway ensures an organized and logical progression toward the solution."
          },
          {
            "name": "Assumption Verification",
            "description": "Here, the task is to assess any assumptions made during problem analysis and ensure they align with mathematical principles and the problem's constraints. This subtask includes scrutinizing assumptions for validity to prevent logical errors. It is a safeguard against deriving incorrect solutions."
          },
          {
            "name": "Equation Simplification",
            "description": "This subtask involves reducing complex equations to simpler forms to facilitate easier problem-solving. It requires applying operations like factoring, expanding, and canceling to streamline the equations. Simplifying equations can reveal solutions more directly and clearly."
          },
          {
            "name": "Numerical Calculation",
            "description": "This involves performing the actual arithmetic or algebraic calculations to progress towards the solution. This subtask includes operations like addition, subtraction, multiplication, division, or applying more advanced mathematical operations. Accuracy in this step is critical to ensure the correctness of the final answer."
          },
          {
            "name": "Solution Checking",
            "description": "After a solution is found, this subtask comprises revisiting the original problem to verify that the solution is correct. It can involve substituting answers back into the original equations or checking against known constraints. This step is crucial to validate that the solution is indeed correct."
          },
          {
            "name": "Alternative Method Exploration",
            "description": "This subtask encourages finding different strategies or methods to solve the same problem. It is about applying alternative mathematical approaches to arrive at a solution. This can provide validation for the original answer or offer a more efficient path to the same destination."
          },
          {
            "name": "Result Interpretation",
            "description": "In this subtask, the solver must interpret the significance of the solution in the context of the problem. It involves explaining what the solution means in practical terms, especially if the problem is applied rather than pure mathematics. Understanding the implications of a solution is as important as finding it."
          },
          {
            "name": "Real-world Application",
            "description": "If applicable, this subtask extends the problem's solution to real-world contexts to demonstrate practical utility. It involves conceptualizing how the mathematical solution can be applied to solve actual problems or explain phenomena. This helps bridge the gap between abstract mathematics and tangible applications."
          },
          {
            "name": "Identifying Variables",
            "description": "This subtask requires the identification of all variables and unknowns within the given mathematical problem. It involves isolating and naming each variable, which is necessary before beginning to solve the problem. The objective is to set the stage for formulating equations or expressions that will be solved."
          },
          {
            "name": "Equation Setup",
            "description": "The focus here is on constructing mathematical equations or expressions based on the problem's description. It requires translating the words of the problem into mathematical language, using appropriate symbols and operations. The goal is to create a solvable mathematical representation of the problem."
          },
          {
            "name": "Operational Order Determination",
            "description": "This subtask involves deciding the correct sequence of operations needed to solve the problem. It's essential for complying with mathematical rules such as the order of operations (PEMDAS/BODMAS). The aim is to clarify the procedural steps for solving the problem accurately."
          },
          {
            "name": "Data Organization",
            "description": "For problems involving sets of data, this subtask requires organizing and structuring the data in a manner that makes it easier to analyze and solve the problem. It might include creating tables, graphs, or charts. The focus is on preparing the data for effective problem-solving."
          },
          {
            "name": "Unit Conversion",
            "description": "When a problem includes different units of measurement, this subtask is about converting all the units into a common system. It ensures consistency and accuracy in calculations. The goal is to prevent errors in the solution process due to unit discrepancies."
          },
          {
            "name": "Formula Recall",
            "description": "This subtask entails recalling and selecting the appropriate mathematical formulas needed to solve the problem. It involves accessing one's memory or resources to find the correct formula that applies to the situation at hand. The objective is to prepare for the application of these formulas in the problem-solving process."
          },
          {
            "name": "Simplification",
            "description": "A key step in problem-solving, this subtask involves simplifying complex expressions or equations to their most basic form. It makes problems more manageable and easier to solve. The goal is to reduce the complexity of the mathematics involved."
          },
          {
            "name": "Substitution",
            "description": "When problems involve expressions with multiple variables, this subtask focuses on substituting known values into these expressions. It's a critical step in solving equations and inequalities. The aim is to move closer to finding the value of unknown variables."
          },
          {
            "name": "Logical Reasoning",
            "description": "This subtask is about applying logical reasoning to deduce steps or patterns needed to solve a problem, particularly in proofs or complex problem scenarios. It involves thinking critically about the relationships between different parts of the problem. The goal is to leverage logic to navigate the problem-solving process."
          },
          {
            "name": "Estimation",
            "description": "Before delving into precise calculations, this subtask is about approximating values or outcomes to get a rough idea of the solution. It helps in verifying the plausibility of final answers. The aim is to provide a quick sanity check for the results obtained."
          },
          {
            "name": "Graphical Representation",
            "description": "Some problems are best approached by visualizing them graphically. This subtask involves plotting functions or data points on a graph to identify patterns or solutions. The objective is to use visual tools to aid in understanding and solving the problem."
          },
          {
            "name": "Dimensional Analysis",
            "description": "Particularly relevant in physics or chemistry problems, this subtask focuses on checking that the mathematical operations respect the rules of dimensions and units. It ensures that the solutions are physically plausible. The goal is to prevent nonsensical answers that violate dimensional consistency."
          },
          {
            "name": "Algorithmic Computation",
            "description": "When solving problems requires repetitive or complex computations, this subtask involves devising or implementing algorithms to perform calculations. It's especially useful for large or computationally intensive problems. The objective is to utilize systematic approaches for efficient problem-solving."
          },
          {
            "name": "Proof Writing",
            "description": "In mathematics, particularly in geometry or higher math, this subtask consists of creating a structured, logical argument that demonstrates the truth of a statement. It requires sequence and clarity in reasoning. The goal is to formally validate the solution to a problem or theorem."
          },
          {
            "name": "Checking Solutions",
            "description": "After arriving at a potential solution, this subtask is about verifying its correctness. It includes plugging the solution back into the original problem and checking if it satisfies all given conditions. The aim is to ensure that the proposed solution is indeed valid."
          }
        ]
      },
      "Code Analysis": {
        "descr": "Involves examining, interpreting, and debugging existing code, as well as providing insights on code structure, optimization, and best practices in software development.",
        "subtasks": [
          {
            "name": "Syntax Checking",
            "description": "This subtask involves scanning the code for syntax errors that prevent it from running correctly. It includes identifying missing semicolons, brackets, or other necessary syntactical elements. The goal is to ensure that the code is free of syntax errors and is thus syntactically valid."
          },
          {
            "name": "Logical Flow Analysis",
            "description": "The task is centered around understanding and evaluating the logical flow of the code. This includes examining conditionals, loops, and function calls to ensure that the logic is sound and functional. The objective is to verify that the code operates as intended and follows a coherent logic."
          },
          {
            "name": "Code Efficiency Review",
            "description": "This subtask focuses on identifying areas in the code that could be optimized for better performance. It involves assessing loop efficiencies, algorithm choices, and resource usage. The goal is to suggest improvements that can make the code run faster and more efficiently."
          },
          {
            "name": "Code Style Compliance",
            "description": "This subtask checks whether the code adheres to industry-standard style guidelines and conventions. It involves reviewing naming conventions, indentation, comment quality, and code organization. The objective is to ensure that the code is readable and maintainable by following consistent coding standards."
          },
          {
            "name": "Dependency Analysis",
            "description": "The subtask involves examining the code for its dependencies and their impact on the overall system. It checks for both external library dependencies and internal module dependencies. The goal is to identify potential problems related to versioning, licensing, or compatibility."
          },
          {
            "name": "Documentation Review",
            "description": "This subtask assesses the quality and completeness of the code documentation. It involves ensuring that there is adequate documentation for functions, classes, and modules, and that the documentation accurately reflects the code's functionality. The goal is to make the codebase understandable and usable for other developers."
          },
          {
            "name": "Code Readability Improvement",
            "description": "The subtask focuses on enhancing the readability and understandability of the code. It looks at variable naming, function decomposition, and overall code structure to make it more approachable. The goal is to refactor the code, where necessary, to make it easier for others to read and maintain."
          },

          {
            "name": "Error Handling Review",
            "description": "The subtask includes scrutinizing the code's approach to handling errors and exceptions. It assesses how the code manages unexpected conditions or input, and whether it fails gracefully. The objective is to ensure that the code is robust and can handle errors in a controlled and predictable manner."
          },
          {
            "name": "Refactoring for Maintainability",
            "description": "This subtask consists of modifying the code to improve its internal structure without changing its external behavior. This often includes reducing complexity, eliminating redundancy, and improving naming conventions. The goal is to make the codebase more maintainable and easier to understand."
          },
          {
            "name": "Dependency Analysis",
            "description": "Analyzing dependencies involves evaluating the code's reliance on external libraries or modules to identify potential issues with versioning, licensing, or deprecation. It requires understanding the project's dependencies and their impact on the system. Ensuring that the codebase uses up-to-date and secure dependencies is vital for robust software."
          },
          {
            "name": "Test Coverage Evaluation",
            "description": "This subtask entails assessing the extent and quality of the code's existing test suites. It involves analyzing which parts of the codebase are tested, which are not, and the effectiveness of the tests. The aim is to ensure the reliability of the code through comprehensive testing."
          },
          {
            "name": "Performance Profiling",
            "description": "Performance profiling is about analyzing the code to identify bottlenecks and performance issues. Using profiling tools, it involves measuring the time and resources consumed by various parts of the code. The intent is to pinpoint areas for performance improvements."
          },
          {
            "name": "Static Code Analysis",
            "description": "This subtask uses static code analysis tools to automatically analyze the source code without executing it. It aims to identify potential issues such as code smells, anti-patterns, and possible bugs. Static analysis helps improve code quality and consistency."
          },
          {
            "name": "Code Complexity Measurement",
            "description": "Measuring code complexity involves using quantitative methods to assess the complexity of the code's structure. Metrics such as cyclomatic complexity are used to determine the code's maintainability and potential for refactoring. Reducing complexity can help prevent errors and improve understandability."
          },
          {
            "name": "Cross-Platform Compatibility Check",
            "description": "This subtask checks if the code runs consistently across different operating systems, platforms, and environments. It involves testing the code in various configurations to identify platform-specific issues. Ensuring compatibility increases the code's robustness and user reach."
          },
          {
            "name": "Code Annotation for Tool Integration",
            "description": "Code annotation involves adding metadata to the source code, usually for integration with tools like IDEs, static analyzers, and debuggers. This subtask requires adding specific comments or annotations that can help these tools better understand and work with the codebase. These annotations can facilitate better development workflows and automated processes."
          },
          {
            "name": "Usability Assessment for Developer Tools",
            "description": "This subtask focuses on evaluating the code from the perspective of how well it integrates with developer tools and environments. It considers factors such as ease of setup, build automation, and debugging features. Enhancing the usability of code in development tools can streamline the development process and reduce setup times."
          }
        ]
      },
      "Business Analysis and Strategy Development": {
        "descr": "The process of evaluating business opportunities, analyzing plans and reports, and generating strategic ideas to support business growth, decision-making, and operational efficiency.",
        "subtasks":  [
    {
      "name": "Market Trend Identification",
      "description": "Analyzing a brief text on market dynamics to identify current trends affecting a particular industry or sector."
    },
    {
      "name": "Competitor Strategy Assessment",
      "description": "Evaluating a paragraph describing a competitor's strategy to determine its potential impacts on the market and the business."
    },
    {
      "name": "SWOT Analysis",
      "description": "Conducting a SWOT analysis (Strengths, Weaknesses, Opportunities, Threats) based on a concise company profile or business scenario."
    },
    {
      "name": "Consumer Behavior Insights",
      "description": "Extracting insights about consumer behavior and preferences from a short customer feedback or survey excerpt."
    },
    {
      "name": "Product Feature Evaluation",
      "description": "Reviewing a brief description of a product to assess its features, benefits, and potential market appeal."
    },
    {
      "name": "Financial Health Quick Assessment",
      "description": "Performing a preliminary analysis of a company's financial health based on a summarized financial statement or data snippet."
    },
    {
      "name": "Operational Efficiency Review",
      "description": "Evaluating operational processes described in a brief text to identify efficiency improvements or potential bottlenecks."
    },
    {
      "name": "Risk Management Overview",
      "description": "Assessing potential risks in a business scenario presented in a paragraph, considering factors like market volatility or operational hazards."
    },
    {
      "name": "Supply Chain Analysis",
      "description": "Analyzing a succinct description of a supply chain process to identify key components and possible vulnerabilities."
    },
    {
      "name": "Innovation Opportunity Spotting",
      "description": "Identifying opportunities for innovation and improvement from a brief account of current business practices or market conditions."
    }
  ]
      },
      "Healthcare and Medical Analysis": {
        "descr": "This task task encompasses a variety of subtasks focused on interpreting and evaluating healthcare and medical-related information",
        "subtasks": [
    {
      "name": "Symptom Interpretation",
      "description": "Analyzing a short description of symptoms to identify possible medical conditions or illnesses."
    },
    {
      "name": "Medication Effect Analysis",
      "description": "Evaluating a paragraph describing a medication to determine its potential effects and side effects."
    },
    {
      "name": "Dietary Recommendation Analysis",
      "description": "Assessing a brief dietary plan or recommendation to identify its suitability for specific health conditions."
    },
    {
      "name": "Preventive Healthcare Suggestions",
      "description": "Analyzing a text on lifestyle habits to suggest preventive healthcare measures."
    },
    {
      "name": "Laboratory Result Interpretation",
      "description": "Interpreting a short description of laboratory test results to provide a preliminary analysis."
    },
    {
      "name": "Treatment Plan Evaluation",
      "description": "Evaluating a brief outline of a treatment plan for its appropriateness for a given medical condition."
    },
    {
      "name": "Health Risk Assessment",
      "description": "Analyzing a paragraph detailing personal or family medical history to assess potential health risks."
    },
    {
      "name": "Surgical Procedure Analysis",
      "description": "Reviewing a brief description of a surgical procedure to understand its purpose and potential risks."
    },
    {
      "name": "Vaccine Efficacy Review",
      "description": "Assessing information on a vaccine to determine its efficacy and suitability for different age groups or health conditions."
    },
    {
      "name": "Physical Therapy Techniques Evaluation",
      "description": "Analyzing a description of physical therapy techniques to determine their effectiveness for specific injuries or conditions."
    }
  ]
      },
      "Legal  Analysis": {
        "descr": "Examining legal documents, cases, and precedents to interpret laws and provide legal insights or strategies.",
        "subtasks": [
    {
      "name": "Identifying Legal Issues",
      "description": "Analyzing a paragraph to pinpoint specific legal issues or questions presented in a case."
    },
    {
      "name": "Case Fact Summary",
      "description": "Summarizing the key facts of a legal case based on a brief text description."
    },
    {
      "name": "Argument Strength Assessment",
      "description": "Evaluating the strength and validity of arguments in a legal paragraph."
    },
    {
      "name": "Legal Precedent Identification",
      "description": "Identifying any legal precedents or similar cases mentioned in a short text."
    },
    {
      "name": "Statute Interpretation",
      "description": "Interpreting the meaning and implications of a statute or law referenced in a paragraph."
    },
    {
      "name": "Contract Clause Analysis",
      "description": "Analyzing a specific clause within a contract described in a brief text."
    },
    {
      "name": "Tort Liability Evaluation",
      "description": "Assessing potential tort liability based on a short scenario description."
    },
    {
      "name": "Compliance Check",
      "description": "Determining if the actions described in a paragraph are in compliance with stated legal standards or regulations."
    },
    {
      "name": "Evidence Credibility Review",
      "description": "Reviewing the credibility or relevance of evidence presented in a brief legal context."
    },
    {
      "name": "Legal Risk Assessment",
      "description": "Assessing potential legal risks or issues based on a concise description of a business or personal scenario."
    },
    {
      "name": "Property Law Analysis",
      "description": "Analyzing a paragraph related to property law to identify key issues or rights involved."
    },
    {
      "name": "Employment Law Inquiry",
      "description": "Examining a brief text for issues related to employment law, such as wrongful termination or discrimination claims."
    },
    {
      "name": "Family Law Consideration",
      "description": "Reviewing a short text for family law matters such as custody or divorce implications."
    },
    {
      "name": "Criminal Law Elements Identification",
      "description": "Identifying elements of a criminal offense based on a brief case description."
    },
    {
      "name": "Intellectual Property Rights Review",
      "description": "Evaluating a paragraph for issues related to intellectual property rights, such as copyright or trademark infringement."
    }
  ]
      },
      "Cybersecurity Threat Assessment": {
        "descr": "Evaluating texts for potential security threats and vulnerabilities, suggesting measures to enhance security.",
        "subtasks": [
    {
      "name": "Phishing Attempt Identification",
      "description": "Analyzing a paragraph to determine if it describes a phishing attempt, focusing on key indicators like suspicious links or requests for personal information."
    },
    {
      "name": "Malware Threat Analysis",
      "description": "Evaluating a brief description to identify potential malware threats, such as viruses or ransomware, mentioned in the text."
    },
    {
      "name": "Data Breach Impact Evaluation",
      "description": "Analyzing a paragraph to evaluate the potential impact of a described data breach, including the type of data compromised."
    },
    {
      "name": "Password Security Review",
      "description": "Reviewing a text for password security practices, identifying any weak or risky behaviors described."
    },
    {
      "name": "Social Engineering Recognition",
      "description": "Identifying instances of social engineering tactics in a paragraph, such as manipulation or deceit used to gain confidential information."
    },
    {
      "name": "Security Policy Compliance Check",
      "description": "Evaluating a text to determine if the described practices comply with standard cybersecurity policies."
    },
    {
      "name": "Encryption Effectiveness Analysis",
      "description": "Analyzing a paragraph for mentions of encryption methods and assessing their effectiveness."
    },
    {
      "name": "Insider Threat Identification",
      "description": "Reviewing a text to identify potential insider threats or risks within an organization."
    },
    {
      "name": "Mobile Security Threat Assessment",
      "description": "Evaluating a paragraph for potential security threats related to mobile devices and applications."
    },
    {
      "name": "Cloud Security Evaluation",
      "description": "Analyzing text for cloud computing-related security issues, such as data storage and access vulnerabilities."
    },
    {
      "name": "IoT Security Analysis",
      "description": "Assessing a paragraph for security concerns related to Internet of Things (IoT) devices."
    },
    {
      "name": "Cybersecurity Incident Response Plan Review",
      "description": "Reviewing a text for the adequacy and completeness of a described cybersecurity incident response plan."
    },
    {
      "name": "User Authentication Methods Critique",
      "description": "Evaluating a paragraph for the strength and reliability of user authentication methods mentioned."
    }
  ]
      },
      "Fiction Analysis": {
        "descr": "Critically evaluating a piece of fiction, focusing on its narrative structure, character development, and impact.",
        "subtasks": [
    {
      "name": "Character Analysis",
      "description": "Evaluating the paragraph to understand a character's traits, motivations, or development within the story."
    },
    {
      "name": "Setting Description Interpretation",
      "description": "Analyzing the text to extract details about the story's setting, including time and place."
    },
    {
      "name": "Narrative Style Assessment",
      "description": "Evaluating the author's narrative style, including point of view, tone, and language use."
    },
    {
      "name": "Symbolism Detection",
      "description": "Identifying and interpreting any symbolic elements or metaphors within the text."
    },
    {
      "name": "Conflict Exploration",
      "description": "Analyzing the paragraph to understand the central conflict or challenges faced by characters."
    },
    {
      "name": "Plot Development Analysis",
      "description": "Assessing how the events in the paragraph contribute to the overall plot development."
    },
    {
      "name": "Dialogue Interpretation",
      "description": "Evaluating the dialogue in the text to gain insights into character relationships and dynamics."
    },
    {
      "name": "Mood and Atmosphere Analysis",
      "description": "Determining the mood or atmosphere conveyed in the paragraph and how it contributes to the narrative."
    },
    {
      "name": "Genre Classification",
      "description": "Classifying the paragraph into a specific fiction genre based on the elements presented."
    },
    {
      "name": "Literary Device Identification",
      "description": "Identifying literary devices such as foreshadowing, irony, or alliteration used in the text."
    },
    {
      "name": "Narrative Perspective Examination",
      "description": "Analyzing the perspective from which the story is told and its impact on the narrative."
    },
    {
      "name": "Emotional Tone Assessment",
      "description": "Assessing the emotional tone of the text and how it affects reader engagement."
    },
    {
      "name": "Imagery and Descriptive Language Analysis",
      "description": "Evaluating the use of imagery and descriptive language to create vivid scenes or characters."
    },
    {
      "name": "Reader Response Interpretation",
      "description": "Predicting or analyzing the potential reader response or emotional impact based on the paragraph."
    }
  ]
      }
    }
  }
}