{"input_message": "Given a JSON input describing a general task and its subtasks, create a system prompt for another LLM for each subtask. The system prompt should be one sentences long (15-20 words) and configure the LLM to perform the specified subtask. The sentence must:\n\na) Clearly state the task and explain that all text following the command is to be treated as input for the task.\nb) Provide a brief explanation of how the following text should be processed in line with this subtask.\n\nExample Input:\n\n{\n  \"Fiction Analysis\": {\n    \"descr\": \"The task involves analyzing various elements of fiction within a text.\",\n    \"subtasks\": [\n      {\n        \"name\": \"Character Analysis\",\n        \"description\": \"Evaluating the paragraph to understand a character's traits, motivations, or development.\"\n      },\n      // ...additional subtasks...\n    ]\n  }\n}\n\nExample Output:\n\n{\n  \"Fiction Analysis\": {\n    \"descr\": \"The task involves analyzing various elements of fiction within a text.\",\n    \"subtasks\": [\n      {\n        \"name\": \"Character Analysis\",\n        \"description\": \"Evaluating the paragraph to understand a character's traits, motivations, or development.\",\n        \"system_prompt\": \"Perform a Character Analysis on the text that follows, focusing on dissecting the character's traits and motivations.\"\n      },\n      // ...system prompts for additional subtasks...\n    ]\n  }\n}\n\nPlease create system prompts for the following subtasks based on the input format provided and ensuring each prompt is one sentence long. \n\n", "data": {"descr": "These are three most general types of tasks", "Information Processing and Retrieval": {"descr": "This category includes classical NLP tasks that involve the handling, interpretation, and retrieval of information. It encompasses activities where the primary goal is to manage and utilize existing knowledge or data.", "Text Summarization": {"descr": "Condensing lengthy texts into concise summaries, capturing the essential points.", "subtasks": [{"name": "Introductory Summarization", "description": "This subtask involves identifying and summarizing the introduction or opening segments of the text. It focuses on setting the context or providing an overview of the material to follow. The aim is to create a summary that gives the reader a clear idea of the starting point or premise of the text."}, {"name": "Conclusion Summarization", "description": "This subtask targets the summarization of the concluding part of the text. It entails extracting the final thoughts, resolutions, or the crux of the arguments presented. The goal is to provide a distilled version of the text's ending, emphasizing the outcomes or final messages."}, {"name": "Argumentative Summarization", "description": "This subtask centers on condensing the argumentative aspects of the text. It requires isolating the main arguments, rebuttals, and supportive evidence. The purpose is to produce a summary that encapsulates the persuasive elements and the structure of the argumentation."}, {"name": "Narrative Summarization", "description": "This subtask focuses on summarizing narrative elements within the text. It involves identifying the plot, key characters, and significant events. The objective is to create a coherent and concise narrative summary that reflects the story arc or progression."}, {"name": "Factual Summarization", "description": "This subtask aims to extract and summarize factual information from the text. It looks for data, statistics, dates, and specific details. The goal is to provide a summary rich in concrete information, omitting subjective analysis or interpretation."}, {"name": "Analytical Summarization", "description": "This subtask focuses on summarizing the analytical components of the text. It requires distilling complex discussions, interpretations, and evaluations. The aim is to produce a summary that captures the analytical depth of the text, highlighting the thought processes involved."}, {"name": "Process Summarization", "description": "The subtask involves summarizing any processes described within the text. It targets sequences of actions, methodologies, or steps taken within a described procedure. The goal is to provide a clear and ordered summary of the process, preserving logical progression."}, {"name": "Comparative Summarization", "description": "This subtask is about summarizing the comparative aspects found in the text. It looks at contrasting viewpoints, differences, and similarities highlighted by the author. The objective is to create a summary that effectively presents the comparative analysis from the text."}, {"name": "Statistical Summarization", "description": "This subtask is dedicated to summarizing statistical information. It involves identifying and condensing any statistical data, graphs, or charts into a narrative that reflects the quantitative evidence presented. The goal is to produce a summary that accurately communicates the statistical findings in a digestible format."}, {"name": "Instructional Summarization", "description": "This subtask focuses on summarizing instructional or how-to content. It entails extracting key steps, tips, and guidelines. The purpose is to create a summary that conveys a clear, actionable guide from the detailed instructions provided in the text."}]}, "Information Extraction": {"descr": "Identifying and extracting key pieces of information from a larger dataset or complex texts.", "subtasks": [{"name": "Named Entity Recognition", "description": "This subtask involves scanning the text to identify and label important entities such as people, organizations, locations, dates, and other specifics. It helps in structuring unstructured data by categorizing key information. The goal is to output a list of these entities with their corresponding types."}, {"name": "Keyword Extraction", "description": "The aim of this subtask is to identify the most relevant words or phrases within the text, known as keywords. These keywords often hold significant information about the content and context of the text. The result is a list of terms that can be used for indexing, summarization, or further analysis."}, {"name": "Fact Extraction", "description": "This subtask is dedicated to pulling out factual information, such as statistics, events, or specific data points. It involves discerning and extracting objective statements from the text. The extracted facts can be used to populate databases, create timelines, or support analysis."}, {"name": "Relation Extraction", "description": "This subtask aims to identify and extract relationships between entities within the text. By analyzing how entities are connected, the extracted relationships can elucidate complex information structures. This can be used to build knowledge graphs or to map networks of interactions."}, {"name": "Sentiment Analysis", "description": "Sentiment analysis involves determining the emotional tone behind a series of words, used to gain an understanding of the attitudes, emotions, and opinions expressed in the text. It involves classifying the sentiment as positive, negative, or neutral. This can be useful for understanding public opinion or customer feedback."}, {"name": "Topic Classification", "description": "The goal of this subtask is to categorize the text into one or more predefined topics. This involves understanding the overall subject matter and using it to classify the text accordingly. It's particularly useful for organizing large sets of documents or for content discovery."}, {"name": "Trend Analysis", "description": "This subtask involves examining the text data over time to identify any trends or patterns. It can be used to track the popularity of certain topics or the frequency of specific terms. This analysis helps in understanding changes in discourse or interest over time."}, {"name": "Event Extraction", "description": "Event extraction is about identifying occurrences of specific events mentioned within the text. It involves recognizing event descriptions and categorizing them into types of events. This can be crucial for timeline creation or monitoring occurrences in news stories."}, {"name": "Summarization for Information Extraction", "description": "This subtask entails creating a concise summary of the text that specifically highlights the extracted information. It involves condensing the text while ensuring that the key extracted details are retained and clearly presented. It aids in quick comprehension of the extracted data without reading the entire original text."}, {"name": "Pattern Recognition", "description": "Pattern recognition involves identifying recurring themes, structures, or sequences in the text. This subtask is crucial for predicting future occurrences or for recognizing standard schemas within the data. Understanding these patterns can provide insights into habitual behavior or common practices."}]}}, "Creative and Generative Tasks": {"descr": "This category is for tasks that require the generation of new content or ideas. It emphasizes creativity, originality, and the ability to construct meaningful or aesthetically pleasing outputs.", "Textual Adaptation and Transformation": {"descr": "Involves modifying existing texts to create new versions, such as developing alternative endings for stories, converting texts into different genres, or reimagining narratives from new perspectives.", "subtasks": [{"name": "Genre Conversion", "description": "This subtask involves changing the genre of the original text to another, such as transforming a news article into a poem or a scientific paper into a short story. It includes the retention of key elements while altering the style, structure, and language to fit the conventions of the new genre. The aim is to present the original content in a completely new format while maintaining its core message."}, {"name": "Narrative Perspective Shift", "description": "The subtask requires rewriting the text from a different narrative point of view, such as changing from first-person to third-person narration or vice versa. It challenges the rewriter to maintain the narrative's authenticity while shifting the perspective. The goal is to offer a fresh angle on the story or content, enhancing the reader's engagement and interpretation."}, {"name": "Temporal Update", "description": "This subtask means updating the text to make it relevant to a different time period, either past or future. It entails altering references, slang, technology, and cultural norms to fit the chosen era. The primary objective is to make the text relatable and accurate to the new temporal context while preserving its original intent."}, {"name": "Localization", "description": "Localization involves adapting the text to cater to a specific geographic region or culture. This includes modifying idiomatic expressions, cultural references, measurements, and any region-specific content. The end goal is to make the text resonate with the target audience's cultural context without losing the original's essence."}, {"name": "Textual Simplification", "description": "The subtask is to simplify the complexity of the text to make it more understandable for a broader audience or for readers with different language proficiency levels. It involves rewriting using simpler vocabulary and sentence structures. The aim is to convey the same information in a way that is accessible and easy to comprehend for all readers."}, {"name": "Dialogic Transformation", "description": "This subtask transforms narrative or descriptive text into dialogue form, suitable for plays, screenplays, or conversational pieces. It involves creating characters, setting up interactions, and expressing the original text's messages through spoken words. The challenge is to preserve the text's core information and emotional tone through dialogue."}, {"name": "Emotional Tone Alteration", "description": "This subtask requires the rewriter to modify the emotional tone of the text, such as changing a somber piece into a humorous one. It includes the nuanced crafting of language and situations to evoke a different emotional response from the reader. The objective is to change how the reader feels about the text while keeping the main storyline or information intact."}, {"name": "Interactivity Enhancement", "description": "The goal of this subtask is to transform the text into an interactive experience, such as a choose-your-own-adventure style or interactive fiction. It involves adding decision points, branching narratives, and possible outcomes. The intent is to engage the reader as an active participant in the narrative."}, {"name": "Cultural Adaptation", "description": "This subtask adapts the text to resonate with a different cultural background than originally intended. It includes modifying cultural references, norms, values, and language to reflect the new target culture. The challenge is to achieve cultural sensitivity and relevance while preserving the original message and intent of the text."}, {"name": "Lexical Modernization", "description": "Lexical modernization involves updating the language of the text to reflect contemporary usage. It requires replacing outdated or archaic terms with current phrases and expressions. The goal is to make the text more relatable and understandable to a modern audience without altering its fundamental meaning."}]}, "Culinary Assistance and Guidance": {"descr": "Providing support and advice in cooking processes, including recipe selection, ingredient substitution, cooking techniques, and presentation tips.", "subtasks": [{"name": "Recipe Selection Guidance", "description": "This subtask helps users choose recipes that match their dietary preferences, available ingredients, or desired cuisine. It involves filtering and suggesting recipes based on user-defined criteria such as meal type, cooking time, or dietary restrictions. The goal is to provide a personalized selection of recipes that cater to the user's individual needs."}, {"name": "Ingredient Substitution Suggestions", "description": "This subtask offers alternatives for ingredients that users may need to replace due to allergies, dietary restrictions, or unavailability. It requires knowledge of ingredient properties and possible substitutes that maintain the dish's integrity. The aim is to enable users to adapt recipes to their specific situation without compromising on taste or quality."}, {"name": "Cooking Technique Clarification", "description": "This subtask involves explaining various cooking techniques and methods to the user in an understandable way. It may include step-by-step guidance or demonstrations of techniques such as sautéing, braising, or baking. The objective is to enhance the user's cooking skills and confidence in applying different cooking methods."}, {"name": "Nutritional Analysis", "description": "This subtask provides users with a breakdown of the nutritional content of recipes or dishes, including calorie count, macronutrients, and micronutrients. It assists in understanding the nutritional value of meals and helps in making informed dietary choices. The goal is to support health-conscious cooking and eating habits."}, {"name": "Meal Planning Assistance", "description": "This subtask aids users in planning their meals for a set period, taking into consideration factors like nutrition, personal schedules, and food variety. It helps in organizing grocery shopping and food preparation to streamline cooking processes. The aim is to create a balanced and efficient meal plan that simplifies daily life."}, {"name": "Cooking Time Estimation", "description": "This subtask estimates the total time required to prepare and cook a recipe, factoring in preparation steps and actual cooking time. It helps users manage their time effectively and plan their cooking schedule. The objective is to enhance time management in the kitchen, ensuring meals are prepared in a timely fashion."}, {"name": "Serving Size Calculation", "description": "This subtask calculates the appropriate serving size for recipes based on the number of people and the amount of each ingredient. It assists in reducing food waste and ensures that all guests are adequately served. The goal is to help users adjust recipes to suit the exact number of servings needed."}, {"name": "Flavor Profile Analysis", "description": "This subtask examines the flavor profiles of dishes, including the balance of taste elements such as sweet, salty, sour, bitter, and umami. It can suggest modifications to enhance the overall flavor profile. The objective is to deepen the user's understanding of taste and aid in creating more delicious and harmonious dishes."}, {"name": "Food Safety Advising", "description": "This subtask provides important information on handling, cooking, and storing food safely to prevent foodborne illness. It may include temperature guidelines, cross-contamination prevention, and proper food storage practices. The goal is to educate users on food safety protocols to ensure a healthy eating environment."}, {"name": "Special Diets Adaptation", "description": "This subtask tailors existing recipes to fit special dietary requirements such as vegan, gluten-free, or ketogenic diets. It involves modifying or replacing certain ingredients while maintaining the dish's appeal. The aim is to make cooking inclusive and enjoyable for people with various dietary needs."}]}}, "Analytical and Evaluative Tasks": {"descr": "Tasks in this category require analysis, evaluation, or critical thinking. They involve interpreting information, making judgments, or providing reasoned arguments.", "Mathematical Problem Solving": {"descr": "The task of solving mathematical problems or equations, ranging from basic arithmetic to more advanced areas like calculus, statistics, or algebra.", "subtasks": [{"name": "Equation Identification", "description": "This subtask involves scanning the text to identify any mathematical equations or expressions. It focuses on distinguishing mathematical content from surrounding text. The goal is to prepare for further analysis or problem-solving by cataloguing all mathematical information."}, {"name": "Variable Isolation", "description": "The objective here is to isolate and identify all variables within the presented mathematical problems. This subtask requires a thorough examination of the equations to pinpoint variables and their roles. Successful variable isolation is crucial for proper manipulation and solving of the equations."}, {"name": "Unit Conversion", "description": "This task entails converting all units in the problem to a consistent system of measurement. It is important for ensuring that all quantities are in the same units before proceeding with calculations. Proper unit conversion is essential to avoid errors in the final solution."}, {"name": "Constant Recognition", "description": "The goal of this subtask is to recognize any constants within the mathematical problem. Constants could include known numerical values or specific numbers like pi (π). Acknowledging these constants helps in the simplification and solving of the problem."}, {"name": "Problem Simplification", "description": "This involves breaking down complex problems into simpler, more manageable parts. Simplification can include expanding parentheses, combining like terms, or applying basic arithmetic operations. This step can make it easier to understand and solve the problem."}, {"name": "Operational Ordering", "description": "This subtask requires the identification of the correct order of operations for a given problem. It ensures that calculations proceed according to mathematical conventions such as PEMDAS (Parentheses, Exponents, Multiplication and Division, Addition and Subtraction). Correct operational ordering is critical for arriving at the appropriate solution."}, {"name": "Diagram Interpretation", "description": "For problems involving diagrams, this subtask involves interpreting and extracting relevant information from them. It may include understanding geometrical figures or graphs. Accurate diagram interpretation aids in forming equations and solving the problem."}, {"name": "Solution Verification", "description": "After solving a problem, this task involves checking the solution for accuracy. It may require substituting the solution back into the original equation or performing a reality check for word problems. Verification ensures the reliability of the solution."}, {"name": "Symbolic Representation", "description": "This subtask involves converting word problems into symbolic mathematical equations. It requires translating written language into mathematical symbols and expressions. This step is vital for clarity and for applying mathematical operations."}, {"name": "Formula Identification", "description": "The task here is to identify any relevant mathematical formulas or theorems that apply to the problem. It requires knowledge of mathematical principles and the ability to match them to the problem at hand. Selecting the appropriate formula is crucial for solving the problem efficiently."}]}, "Healthcare and Medical Analysis": {"descr": "Examining healthcare practices, medical treatments, or patient data to improve health outcomes and care efficiency.", "subtasks": [{"name": "Trend Analysis", "description": "This subtask involves analyzing the text to identify and summarize emerging trends in healthcare or medical practices. It includes pinpointing new patterns in treatment efficacy, technological advancements, or shifts in patient care strategies. The goal is to create a synthesis that outlines current and future directions in the healthcare industry."}, {"name": "Comparative Effectiveness", "description": "Comparative effectiveness is a subtask that aims to compare and contrast different healthcare practices or medical treatments within the text. It requires evaluating the relative benefits, costs, and outcomes of various approaches. The final output is a summary that highlights the pros and cons of each method to inform decision-making."}, {"name": "Epidemiological Assessment", "description": "This subtask involves the study of distribution and determinants of health-related events in the text. It includes analyzing data on the incidence, prevalence, and control of diseases. The outcome is a detailed review that contributes to the understanding and prevention of diseases and health conditions."}, {"name": "Policy Impact Review", "description": "The subtask focuses on assessing the impact of health policies or medical guidelines mentioned in the text. It involves examining the effectiveness and implications of these policies on patient care and public health. An analytical summary that reflects the benefits or drawbacks of the implemented policies is provided."}, {"name": "Cost-Benefit Analysis", "description": "Cost-benefit analysis is a subtask that evaluates the economic aspects of healthcare practices or treatments. It involves calculating and comparing the costs and savings or benefits associated with medical interventions. The result is an informative summary that aids in understanding the financial viability of healthcare options."}, {"name": "Patient Outcomes Evaluation", "description": "This subtask involves reviewing and summarizing patient outcomes related to specific treatments or healthcare practices. It requires analyzing patient recovery rates, satisfaction levels, and quality of life measures. The aim is to provide an overview of treatment effectiveness from the patient's perspective."}, {"name": "Treatment Pathway Analysis", "description": "The subtask assesses different treatment pathways and their sequences mentioned in the text. It requires understanding the progression of care, from diagnosis to treatment and follow-up. The compiled summary helps in visualizing optimal care pathways for various conditions."}, {"name": "Risk Factor Identification", "description": "Risk factor identification is a subtask that involves pinpointing and summarizing key risk factors associated with diseases or health outcomes. It is crucial for understanding the etiology and for the development of prevention strategies. The summary outlines major risk factors to guide patient education and risk reduction efforts."}, {"name": "Clinical Guideline Formulation", "description": "This subtask centers on the creation of clinical guidelines from the information provided in the text. It involves distilling best practices, treatment standards, and care protocols. The aim is to synthesize the text into actionable guidelines that can improve care delivery and outcomes."}, {"name": "Medical Innovation Synopsis", "description": "Medical innovation synopsis involves summarizing advancements and breakthroughs in medical research and technology. It requires identifying novel therapies, diagnostic tools, or surgical techniques. The summary provides a quick overview of cutting-edge developments that can transform patient care."}]}}}, "output": {"Information Processing and Retrieval": {"descr": "This category includes classical NLP tasks that involve the handling, interpretation, and retrieval of information. It encompasses activities where the primary goal is to manage and utilize existing knowledge or data.", "Text Summarization": {"descr": "This category includes classical NLP tasks that involve the handling, interpretation, and retrieval of information. It encompasses activities where the primary goal is to manage and utilize existing knowledge or data.", "subtasks": {"descr": "Condensing lengthy texts into concise summaries, capturing the essential points.", "subtasks": [{"name": "Introductory Summarization", "description": "This subtask involves identifying and summarizing the introduction or opening segments of the text. It focuses on setting the context or providing an overview of the material to follow. The aim is to create a summary that gives the reader a clear idea of the starting point or premise of the text.", "system_prompt": "Generate an Introductory Summarization of the incoming text, highlighting its premise and context."}, {"name": "Conclusion Summarization", "description": "This subtask targets the summarization of the concluding part of the text. It entails extracting the final thoughts, resolutions, or the crux of the arguments presented. The goal is to provide a distilled version of the text's ending, emphasizing the outcomes or final messages.", "system_prompt": "Summarize the conclusion of the text that follows, emphasizing its final thoughts and resolutions."}, {"name": "Argumentative Summarization", "description": "This subtask centers on condensing the argumentative aspects of the text. It requires isolating the main arguments, rebuttals, and supportive evidence. The purpose is to produce a summary that encapsulates the persuasive elements and the structure of the argumentation.", "system_prompt": "Create an Argumentative Summarization of the text provided, focusing on its main arguments and rebuttals."}, {"name": "Narrative Summarization", "description": "This subtask focuses on summarizing narrative elements within the text. It involves identifying the plot, key characters, and significant events. The objective is to create a coherent and concise narrative summary that reflects the story arc or progression.", "system_prompt": "Produce a Narrative Summarization that captures the plot, characters, and events of the story in the text."}, {"name": "Factual Summarization", "description": "This subtask aims to extract and summarize factual information from the text. It looks for data, statistics, dates, and specific details. The goal is to provide a summary rich in concrete information, omitting subjective analysis or interpretation.", "system_prompt": "Summarize the text that follows, extracting and focusing solely on its factual content."}, {"name": "Analytical Summarization", "description": "This subtask focuses on summarizing the analytical components of the text. It requires distilling complex discussions, interpretations, and evaluations. The aim is to produce a summary that captures the analytical depth of the text, highlighting the thought processes involved.", "system_prompt": "Condense the analytical parts of the ensuing text, detailing its interpretations and evaluations."}, {"name": "Process Summarization", "description": "The subtask involves summarizing any processes described within the text. It targets sequences of actions, methodologies, or steps taken within a described procedure. The goal is to provide a clear and ordered summary of the process, preserving logical progression.", "system_prompt": "Create a Process Summarization of the text, outlining the steps and sequence described."}, {"name": "Comparative Summarization", "description": "This subtask is about summarizing the comparative aspects found in the text. It looks at contrasting viewpoints, differences, and similarities highlighted by the author. The objective is to create a summary that effectively presents the comparative analysis from the text.", "system_prompt": "Summarize the comparative elements in the text, noting contrasts and similarities."}, {"name": "Statistical Summarization", "description": "This subtask is dedicated to summarizing statistical information. It involves identifying and condensing any statistical data, graphs, or charts into a narrative that reflects the quantitative evidence presented. The goal is to produce a summary that accurately communicates the statistical findings in a digestible format.", "system_prompt": "Perform a Statistical Summarization on the incoming text, focusing on its quantitative data."}, {"name": "Instructional Summarization", "description": "This subtask focuses on summarizing instructional or how-to content. It entails extracting key steps, tips, and guidelines. The purpose is to create a summary that conveys a clear, actionable guide from the detailed instructions provided in the text.", "system_prompt": "Generate an Instructional Summarization from the text, highlighting key steps and tips."}]}}, "Information Extraction": {"descr": "This category includes classical NLP tasks that involve the handling, interpretation, and retrieval of information. It encompasses activities where the primary goal is to manage and utilize existing knowledge or data.", "subtasks": {"descr": "Identifying and extracting key pieces of information from a larger dataset or complex texts.", "subtasks": [{"name": "Named Entity Recognition", "description": "This subtask involves scanning the text to identify and label important entities such as people, organizations, locations, dates, and other specifics. It helps in structuring unstructured data by categorizing key information. The goal is to output a list of these entities with their corresponding types.", "system_prompt": "Identify and label entities in the following text, noting people, organizations, locations, and dates."}, {"name": "Keyword Extraction", "description": "The aim of this subtask is to identify the most relevant words or phrases within the text, known as keywords. These keywords often hold significant information about the content and context of the text. The result is a list of terms that can be used for indexing, summarization, or further analysis.", "system_prompt": "Extract the most relevant keywords from the subsequent text for content analysis and indexing."}, {"name": "Fact Extraction", "description": "This subtask is dedicated to pulling out factual information, such as statistics, events, or specific data points. It involves discerning and extracting objective statements from the text. The extracted facts can be used to populate databases, create timelines, or support analysis.", "system_prompt": "Extract factual information from the following text, including statistics, events, and data points."}, {"name": "Relation Extraction", "description": "This subtask aims to identify and extract relationships between entities within the text. By analyzing how entities are connected, the extracted relationships can elucidate complex information structures. This can be used to build knowledge graphs or to map networks of interactions.", "system_prompt": "Identify and extract relationships between entities in the subsequent text for knowledge graph construction."}, {"name": "Sentiment Analysis", "description": "Sentiment analysis involves determining the emotional tone behind a series of words, used to gain an understanding of the attitudes, emotions, and opinions expressed in the text. It involves classifying the sentiment as positive, negative, or neutral. This can be useful for understanding public opinion or customer feedback.", "system_prompt": "Analyze the emotional tone of the next text and classify its sentiment as positive, negative, or neutral."}, {"name": "Topic Classification", "description": "The goal of this subtask is to categorize the text into one or more predefined topics. This involves understanding the overall subject matter and using it to classify the text accordingly. It's particularly useful for organizing large sets of documents or for content discovery.", "system_prompt": "Classify the following text into predefined topics based on its overall subject matter."}, {"name": "Trend Analysis", "description": "This subtask involves examining the text data over time to identify any trends or patterns. It can be used to track the popularity of certain topics or the frequency of specific terms. This analysis helps in understanding changes in discourse or interest over time.", "system_prompt": "Analyze the text below to identify trends or patterns over time for tracking topic popularity."}, {"name": "Event Extraction", "description": "Event extraction is about identifying occurrences of specific events mentioned within the text. It involves recognizing event descriptions and categorizing them into types of events. This can be crucial for timeline creation or monitoring occurrences in news stories.", "system_prompt": "Identify and categorize events mentioned in the following text for timeline creation or monitoring."}, {"name": "Summarization for Information Extraction", "description": "This subtask entails creating a concise summary of the text that specifically highlights the extracted information. It involves condensing the text while ensuring that the key extracted details are retained and clearly presented. It aids in quick comprehension of the extracted data without reading the entire original text.", "system_prompt": "Create a summary of the next text, emphasizing the key extracted information for quick comprehension."}, {"name": "Pattern Recognition", "description": "Pattern recognition involves identifying recurring themes, structures, or sequences in the text. This subtask is crucial for predicting future occurrences or for recognizing standard schemas within the data. Understanding these patterns can provide insights into habitual behavior or common practices.", "system_prompt": "Recognize and describe patterns in the following text to predict future occurrences or standard practices."}]}}}, "Creative and Generative Tasks": {"descr": "This category is for tasks that require the generation of new content or ideas. It emphasizes creativity, originality, and the ability to construct meaningful or aesthetically pleasing outputs.", "Textual Adaptation and Transformation": {"descr": "This category is for tasks that require the generation of new content or ideas. It emphasizes creativity, originality, and the ability to construct meaningful or aesthetically pleasing outputs.", "subtasks": {"descr": "Involves modifying existing texts to create new versions, such as developing alternative endings for stories, converting texts into different genres, or reimagining narratives from new perspectives.", "subtasks": [{"name": "Genre Conversion", "description": "This subtask involves changing the genre of the original text to another, such as transforming a news article into a poem or a scientific paper into a short story. It includes the retention of key elements while altering the style, structure, and language to fit the conventions of the new genre. The aim is to present the original content in a completely new format while maintaining its core message.", "system_prompt": "Convert the following text into a new genre, ensuring key elements remain but with altered style and structure."}, {"name": "Narrative Perspective Shift", "description": "The subtask requires rewriting the text from a different narrative point of view, such as changing from first-person to third-person narration or vice versa. It challenges the rewriter to maintain the narrative's authenticity while shifting the perspective. The goal is to offer a fresh angle on the story or content, enhancing the reader's engagement and interpretation.", "system_prompt": "Rewrite the text from the target narrative perspective, altering the viewpoint while preserving authenticity."}, {"name": "Temporal Update", "description": "This subtask means updating the text to make it relevant to a different time period, either past or future. It entails altering references, slang, technology, and cultural norms to fit the chosen era. The primary objective is to make the text relatable and accurate to the new temporal context while preserving its original intent.", "system_prompt": "Update the following text to reflect a different time period, modifying era-specific references and norms."}, {"name": "Localization", "description": "Localization involves adapting the text to cater to a specific geographic region or culture. This includes modifying idiomatic expressions, cultural references, measurements, and any region-specific content. The end goal is to make the text resonate with the target audience's cultural context without losing the original's essence.", "system_prompt": "Localize the text to suit a specific region, adapting cultural references and idiomatic expressions accordingly."}, {"name": "Textual Simplification", "description": "The subtask is to simplify the complexity of the text to make it more understandable for a broader audience or for readers with different language proficiency levels. It involves rewriting using simpler vocabulary and sentence structures. The aim is to convey the same information in a way that is accessible and easy to comprehend for all readers.", "system_prompt": "Simplify the following text using basic vocabulary and simple sentences to aid understanding."}, {"name": "Dialogic Transformation", "description": "This subtask transforms narrative or descriptive text into dialogue form, suitable for plays, screenplays, or conversational pieces. It involves creating characters, setting up interactions, and expressing the original text's messages through spoken words. The challenge is to preserve the text's core information and emotional tone through dialogue.", "system_prompt": "Transform the text into dialogue, crafting character interactions while maintaining the original message."}, {"name": "Emotional Tone Alteration", "description": "This subtask requires the rewriter to modify the emotional tone of the text, such as changing a somber piece into a humorous one. It includes the nuanced crafting of language and situations to evoke a different emotional response from the reader. The objective is to change how the reader feels about the text while keeping the main storyline or information intact.", "system_prompt": "Alter the emotional tone of the text to elicit a different response, preserving the main storyline."}, {"name": "Interactivity Enhancement", "description": "The goal of this subtask is to transform the text into an interactive experience, such as a choose-your-own-adventure style or interactive fiction. It involves adding decision points, branching narratives, and possible outcomes. The intent is to engage the reader as an active participant in the narrative.", "system_prompt": "Enhance the text with interactivity, adding decision points and branching outcomes for the reader."}, {"name": "Cultural Adaptation", "description": "This subtask adapts the text to resonate with a different cultural background than originally intended. It includes modifying cultural references, norms, values, and language to reflect the new target culture. The challenge is to achieve cultural sensitivity and relevance while preserving the original message and intent of the text.", "system_prompt": "Adapt the text for a different culture, altering references and norms to maintain sensitivity and relevance."}, {"name": "Lexical Modernization", "description": "Lexical modernization involves updating the language of the text to reflect contemporary usage. It requires replacing outdated or archaic terms with current phrases and expressions. The goal is to make the text more relatable and understandable to a modern audience without altering its fundamental meaning.", "system_prompt": "Modernize the text lexically, substituting outdated terms with contemporary language while retaining meaning."}]}}, "Culinary Assistance and Guidance": {"descr": "This category is for tasks that require the generation of new content or ideas. It emphasizes creativity, originality, and the ability to construct meaningful or aesthetically pleasing outputs.", "subtasks": {"descr": "Providing support and advice in cooking processes, including recipe selection, ingredient substitution, cooking techniques, and presentation tips.", "subtasks": [{"name": "Recipe Selection Guidance", "description": "This subtask helps users choose recipes that match their dietary preferences, available ingredients, or desired cuisine.", "system_prompt": "Guide the user in selecting a recipe based on the criteria described in the following text."}, {"name": "Ingredient Substitution Suggestions", "description": "This subtask offers alternatives for ingredients.", "system_prompt": "Suggest ingredient substitutions for the items listed in the text that follows."}, {"name": "Cooking Technique Clarification", "description": "This subtask involves explaining various cooking techniques and methods to the user.", "system_prompt": "Clarify the cooking technique specified in the upcoming text, providing clear steps or methods."}, {"name": "Nutritional Analysis", "description": "This subtask provides users with a breakdown of the nutritional content of recipes or dishes.", "system_prompt": "Analyze the nutritional content based on the recipe or meal information provided next."}, {"name": "Meal Planning Assistance", "description": "This subtask aids users in planning their meals for a set period.", "system_prompt": "Assist in meal planning by addressing the parameters outlined in the following details."}, {"name": "Cooking Time Estimation", "description": "This subtask estimates the total time required to prepare and cook a recipe.", "system_prompt": "Estimate the cooking time for the recipe presented in the subsequent text."}, {"name": "Serving Size Calculation", "description": "This subtask calculates the appropriate serving size for recipes.", "system_prompt": "Calculate the serving size for the number of people mentioned in the next input."}, {"name": "Flavor Profile Analysis", "description": "This subtask examines the flavor profiles of dishes.", "system_prompt": "Analyze the flavor profile of the dish detailed in the text that follows."}, {"name": "Food Safety Advising", "description": "This subtask provides important information on food safety.", "system_prompt": "Advise on food safety for the storage and preparation methods listed in the input below."}, {"name": "Special Diets Adaptation", "description": "This subtask tailors existing recipes to fit special dietary requirements.", "system_prompt": "Adapt the provided recipe to meet the specified special diet criteria."}]}}}, "Analytical and Evaluative Tasks": {"descr": "Tasks in this category require analysis, evaluation, or critical thinking. They involve interpreting information, making judgments, or providing reasoned arguments.", "Mathematical Problem Solving": {"descr": "Tasks in this category require analysis, evaluation, or critical thinking. They involve interpreting information, making judgments, or providing reasoned arguments.", "subtasks": {"descr": "The task of solving mathematical problems or equations, ranging from basic arithmetic to more advanced areas like calculus, statistics, or algebra.", "subtasks": [{"name": "Equation Identification", "description": "This subtask involves scanning the text to identify any mathematical equations or expressions. It focuses on distinguishing mathematical content from surrounding text. The goal is to prepare for further analysis or problem-solving by cataloguing all mathematical information.", "system_prompt": "Identify all mathematical equations in the following text, differentiating them from non-mathematical content."}, {"name": "Variable Isolation", "description": "The objective here is to isolate and identify all variables within the presented mathematical problems. This subtask requires a thorough examination of the equations to pinpoint variables and their roles. Successful variable isolation is crucial for proper manipulation and solving of the equations.", "system_prompt": "Isolate and list all variables from the mathematical problems in the subsequent text."}, {"name": "Unit Conversion", "description": "This task entails converting all units in the problem to a consistent system of measurement. It is important for ensuring that all quantities are in the same units before proceeding with calculations. Proper unit conversion is essential to avoid errors in the final solution.", "system_prompt": "Convert all units in the following problem to a consistent system of measurement."}, {"name": "Constant Recognition", "description": "The goal of this subtask is to recognize any constants within the mathematical problem. Constants could include known numerical values or specific numbers like pi (π). Acknowledging these constants helps in the simplification and solving of the problem.", "system_prompt": "Identify and list constants within the mathematical problem presented next."}, {"name": "Problem Simplification", "description": "This involves breaking down complex problems into simpler, more manageable parts. Simplification can include expanding parentheses, combining like terms, or applying basic arithmetic operations. This step can make it easier to understand and solve the problem.", "system_prompt": "Simplify the following complex mathematical problem into more manageable parts."}, {"name": "Operational Ordering", "description": "This subtask requires the identification of the correct order of operations for a given problem. It ensures that calculations proceed according to mathematical conventions such as PEMDAS (Parentheses, Exponents, Multiplication and Division, Addition and Subtraction). Correct operational ordering is critical for arriving at the appropriate solution.", "system_prompt": "Determine the correct order of operations for the mathematical problem that follows."}, {"name": "Diagram Interpretation", "description": "For problems involving diagrams, this subtask involves interpreting and extracting relevant information from them. It may include understanding geometrical figures or graphs. Accurate diagram interpretation aids in forming equations and solving the problem.", "system_prompt": "Interpret the diagrams that follow and extract relevant mathematical information for problem-solving."}, {"name": "Solution Verification", "description": "After solving a problem, this task involves checking the solution for accuracy. It may require substituting the solution back into the original equation or performing a reality check for word problems. Verification ensures the reliability of the solution.", "system_prompt": "Verify the accuracy of the provided solution by checking it against the original problem."}, {"name": "Symbolic Representation", "description": "This subtask involves converting word problems into symbolic mathematical equations. It requires translating written language into mathematical symbols and expressions. This step is vital for clarity and for applying mathematical operations.", "system_prompt": "Convert the following word problem into symbolic mathematical expressions and equations."}, {"name": "Formula Identification", "description": "The task here is to identify any relevant mathematical formulas or theorems that apply to the problem. It requires knowledge of mathematical principles and the ability to match them to the problem at hand. Selecting the appropriate formula is crucial for solving the problem efficiently.", "system_prompt": "Identify any relevant mathematical formulas or theorems for the upcoming problem."}]}}, "Healthcare and Medical Analysis": {"descr": "Tasks in this category require analysis, evaluation, or critical thinking. They involve interpreting information, making judgments, or providing reasoned arguments.", "subtasks": {"descr": "Examining healthcare practices, medical treatments, or patient data to improve health outcomes and care efficiency.", "subtasks": [{"name": "Trend Analysis", "description": "This subtask involves analyzing the text to identify and summarize emerging trends in healthcare or medical practices.", "system_prompt": "Analyze the following text to extract and summarize the emerging trends in healthcare and medical practices."}, {"name": "Comparative Effectiveness", "description": "Comparative effectiveness is a subtask that aims to compare and contrast different healthcare practices or medical treatments within the text.", "system_prompt": "Compare and contrast the healthcare practices or medical treatments in the subsequent text, highlighting their effectiveness."}, {"name": "Epidemiological Assessment", "description": "This subtask involves the study of distribution and determinants of health-related events in the text.", "system_prompt": "Assess the epidemiology within the text, focusing on the incidence, prevalence, and control of health events."}, {"name": "Policy Impact Review", "description": "The subtask focuses on assessing the impact of health policies or medical guidelines mentioned in the text.", "system_prompt": "Review the health policies or medical guidelines in the text to evaluate their impact on patient care and public health."}, {"name": "Cost-Benefit Analysis", "description": "Cost-benefit analysis is a subtask that evaluates the economic aspects of healthcare practices or treatments.", "system_prompt": "Perform a cost-benefit analysis on the healthcare practices or treatments detailed in the following text."}, {"name": "Patient Outcomes Evaluation", "description": "This subtask involves reviewing and summarizing patient outcomes related to specific treatments or healthcare practices.", "system_prompt": "Evaluate the patient outcomes from the treatments or practices in the text, summarizing recovery rates and satisfaction."}, {"name": "Treatment Pathway Analysis", "description": "The subtask assesses different treatment pathways and their sequences mentioned in the text.", "system_prompt": "Analyze the treatment pathways outlined in the text, focusing on the progression of patient care from diagnosis to follow-up."}, {"name": "Risk Factor Identification", "description": "Risk factor identification is a subtask that involves pinpointing and summarizing key risk factors associated with diseases or health outcomes.", "system_prompt": "Identify and summarize the key risk factors for diseases or health outcomes presented in the following text."}, {"name": "Clinical Guideline Formulation", "description": "This subtask centers on the creation of clinical guidelines from the information provided in the text.", "system_prompt": "Formulate clinical guidelines based on best practices and care protocols identified in the text that follows."}, {"name": "Medical Innovation Synopsis", "description": "Medical innovation synopsis involves summarizing advancements and breakthroughs in medical research and technology.", "system_prompt": "Summarize the medical innovations and breakthroughs from the text, focusing on their potential to transform patient care."}]}}}}}